Repository: MkPereira/gcompris
Catalog: po/*.po
Languages: ar_tn, pa, ro

source: First, select the proper tool from the toolbar. Then drag the mouse to create objects. When you are done, click on the OK button. Errors will be marked with a little red cross. The order of objects (above/under) is not important but be careful not to end up with unwanted objects under others.
pa: ਸਭ ਤੋਂ ਪਹਿਲਾਂ ਟੂਲਬਾਰ ਦੇ ਵਿੱਚੋਂ ਸਹੀ ਟੂਲ ਠੂੰ ਚੂਣੋ। ਉਸ ਤੋਂ ਬਾਦ ਚੀਸ਼ ਠੂੰਬਣਾਉਣ ਦੇ ਲਈ ਮਾਉਸ ਠੂੰ ਖਿੱਚੋ। ਜਦੋਂ ਤੁਸੀਂ ਬਣਾ ਲਈ ਤਾ ਕਰ। ਫਿੱਕੇ ਲਾਲ ਕਰਾਸ ਦੇ ਨਿਸ਼ਾਨ ਨਾਲ ਗਲਤੀ ਮਾਰਕ ਕਰ ਦਿੱਤੀ ਜਾਵੇਗੀ।ਚੀਜ਼ਾਂ ਦੀ ਤਰਕੀਬ (ਉੱਪਰ-ਥੱਲੇ) ਦਾ ਕੋਈ ਮਹੱਤਵ ਠਹੀ ਹੈ ਪਰ ਧਿਆਠ ਰੱਖੋ ਕਿ ਅਣਲੋੜੀਦੀ ਚੀਜ਼ਾਂ ਦੂਜੀਆਂ ਦੇ ਥੱਲੇ ਠਾ ਆਉਣ।
ro: Prima dată, selectează unealta potrivită din bara de unelte. Apoi trage mausul pentru a crea un obiect. Când ai terminat, fă clic pe butonul OK. Erorile vor fi marcate cu o cruciuliță roșie. Ordinea obiectelor (deasupra/dedesupt) nu este importantă dar fi atent să nu ajungi cu obiecte nedorite sub altele.

source: Redraw the given item
ar_tn: أعد تصوير الشكل المطلوب
pa: ਦਿੱਤੀ ਗਈ ਚੀਸ਼ ਨੂੰ ਦੁਬਾਰਾ ਬਣਾਉ।
ro: Redesenați elementul dat.

source: Copy the mirror image of an object from the box on the right into the box on the left.
pa: ਕਿਸੇ ਚੀਸ਼ ਦੀ ਬਿਲਕੁਲ ਉਹੀ ਕਾਪੀ ਸੱਜੇ ਪਾਸੇ ਵਾਲੇ ਡੱਬੇ ਤੋਂ ਖੱਬੇ ਪਾਸੇ ਵਾਲੇ ਡੱਬੇ ਵਿੱਚ ਕਰ।
ro: Copiați imaginea-oglindă obiectului din cutia din dreapta în cutia din stânga.

source: First, select the proper tool from the toolbar. Then drag the mouse to create objects. When you are done, click on the OK button. A little red cross will show you where something isn't right yet. The order of objects (above/under) is not important but be careful not to end up with unwanted objects under others.
pa: ਸਭ ਤੋਂ ਪਹਿਲਾਂ ਟੂਲਬਾਰ ਦੇ ਵਿੱਚੋਂ ਸਹੀ ਟੂਲ ਠੂੰ ਚੂਣੋ। ਉਸ ਤੋਂ ਬਾਦ ਚੀਸ਼ ਠੂੰ ਬਣਾਉਣ ਦੇ ਲਈ ਮਾਉਸ ਠੂੰ ਖਿੱਚੋ। ਜਦੋਂ ਤੁਸੀਂ ਬਣਾ ਲਈ ਤਾਂ ਓਕੇ ਬਟਨ ਤੇ ਕਲਿੱਕ ਕਰ।ਇੱਕ ਛੋਟਾ ਜਿਹਾ ਲਾਲ ਕਰਾਸ ਦਾ ਨਿਸ਼ਾਨ ਦੱਸੇਗਾ ਕਿ ਕਿੱਥੇ ਹਾਲੇ ਸਹੀ ਨਹੀ ਹੈ।ਚੀਜ਼ਾਂ ਦੀ ਤਰਕੀਬ (ਉੱਪਰ-ਥੱਲੇ) ਦਾ ਕੋਈ ਮਹੱਤਵ ਠਹੀ ਹੈ ਪਰ ਧਿਆਠ ਰੱਖੋ ਕਿ ਅਣਲੋੜੀਦੀ ਚੀਜ਼ਾਂ ਦੂਜੀਆਂ ਦੇ ਥੱਲੇ ਠਾ ਆਉਣ।
ro: Prima dată, selectează unealta potrivită din bara de unelte. Apoi trage mausul pentru a crea un obiect. Când ai terminat, fă clic pe butonul OK. O cruciuliță roșie va arăta unde nu este corect încă. Ordinea obiectelor (deasupra/dedesubt) nu este importantă dar fi atent să nu ajungi cu obiecte nedorite sub altele.

source: Mirror the given item
ar_tn: أعد تصوير الشكل المطلوب
pa: ਦਿੱਤੀ ਵਸਤੂ ਨੂੰ ਦਰਪਣ ਵਾਂਗ ਉਤਾਰੋ।
ro: Faceți o copie-oglindă

source: Can move the mouse, can read numbers and subtract numbers up to 10 for the first level
pa: ਮਾਉਸ ਨੂੰ ਚਲਾ ਸਕਦੇ ਹੋ,ਅੰਕਾਂ ਨੂੰ ਪੜ ਸਕਦੇ ਹੋ ਅਤੇ ਪਹਿਲ ਅਧਾਰ ਤੇ ਅੰਕਾਂ ਨੂੰ 10 ਤੱਕ ਘਟਾਉ।

source: Click on the dice to show how many ice spots there are between Tux and the fish. Click the dice with the right mouse button to count backwards. When done, click on the OK button or hit the Enter key.
pa: ਟਕਸ ਅਤੇ ਮੱਛੀ ਦੇ ਵਿੱਚਕਾਰ ਇਹ ਦੇਖਣ ਲਈ ਕਿ ਕਿੰਨੇ ਬਰਫ ਥਿੰਮ ਹਨ,ਗੀਟੇ ਤੇ ਕਲਿੱਕ ਕਰੋ।ਪਿੱਛੇ ਗਿਣਨ ਦੇ ਲਈ ਗੀਟੇ ਤੇ ਸੱਜੇ ਮਾਊਸ ਬਟਨ ਦੇ ਨਾਲ ਕਲਿੱਕ ਕਰੋ।ਜਦੋਂ ਪੁਰਾ ਹੋ ਜਾਵੇ ਤਾਂ ਓਕੇ ਬਟਨ ਤੇ ਕਲਿੱਕ ਕਰੋ ਜਾਂ ਐਂਟਰ ਕੁੰਜੀ ਨੂੰ ਦਬਾਓ।

source: Practice subtraction with a fun game
ar_tn: مارس عملية الطرح من خلال لعبة مسلية
pa: ਮਨੋਰੰਜਨ ਦੇ ਨਾਲ ਘਟਾਓ ਦਾ ਅਭਇਆਸ ਕਰੋ।
ro: Exersează scăderea cu un joc amuzant

source: Tux is hungry. Help him find fish by counting to the correct ice spot.
ar_tn: البطريق جائع. ساعده في البحث عن السمك بعد القطع الثلجية التي يجب أن يقفزها
pa: ਟਕਸ ਭੁੱਖਾ ਹੈ।ਸਹੀ ਬਰਫ ਥਿੰਮ ਨੂੰ ਗਿਣ ਕੇ ਮੱਛੀ ਲੱਭਣ ਦੇ ਲਈ ਉਸ ਦੀ ਮਦਦ ਕਰੋ।
ro: Tux este flămând. Ajută-l să găsească pește numărând până la petecul de gheață corect.

source: Balance the scales properly
ar_tn: توصل إلى توازن بين كفتي الميزان
pa: ਤਰਾਜੂਆਂ ਦਾ ਸਹੀ ਸੰਤੁਲਨ ਕਰੋ।
ro: Balansează cântarul

source: Drag and Drop masses to balance the scales
ar_tn: أمسك و اسحب الكتل لتحقق توازن كفتي الميزان
pa: ਤਰਾਜੂ ਦਾ ਸੰਤੁਲਨ ਕਰਨ ਦੇ ਲਈ ਲੁਕਾਈ ਨੂੰ ਖਿੱਚੋ ਅਤੇ ਛੱਡੋ।
ro: Trage și lasă greutățile pentru a balansa cântarul

source: Mental calculation, arithmetic equality
ar_tn: حساب ذهني, مساواة حسابية
pa: ਦਿਮਾਗੀ ਗਣਨਾ ,ਗਿਣਤੀ ਬਰਾਬਰੀ।
ro: Calcul mental, egalitate aritmetică

source: The painting is an original painting created by Virginie MOREAU (virginie.moreau@free.fr) in 2001. Its name is 'Spices Seller in Egypt'. It is released under the GPL licence.
pa: ਤਸਵੀਰ ਇੱਕ ਤਸਵੀਰ ਅਸਲੀ ਹੈ ਜੋ ਕੀ ਵੀਰਗਨੀ ਮੋਰੀਉ ਦੁਆਰਾ 2001(virginie.moreau@free.fr) ਚ ਬਣਾਈ ਗਈ।ਯੂਨਾਨ ਦੇ ਵਿੱਚ ਇਸ ਖੇਡ ਦਾ ਨਾਂ ਸਪਾਈਸ ਸੈਲਰ ਹੈ।
ro: Pictura este o operă originală creată de Virginie MOREAU (virginie.moreau@free.fr) în 2001. Numele ei este 'Vânzătorul de condimente în Egipt'. Este publicată sub licența GPL.

source: To balance the scales, move the masses on the left or the right side. The masses can be arranged in any order.
pa: ਤਰਾਜੂ ਦਾ ਸੰਤੁਲਨ ਕਰਨ ਦੇ ਲਈ,ਭਾਰ ਨੂੰ ਸੱਜੇ ਸੱਜੇ ਪਾਸੇ ਹਲਾਉ।
ro: Pentru a balansa cântarul, mută greutățile pe partea stângă sau pe partea dreaptă. Greutățile

source: Direct your boat accurately to win the race.
ar_tn: قد قاربك بدقة لتربح السباق
pa: ਆਪਣੀ ਕਿਸ਼ਤੀ ਨੂੰ ਜਿੱਤਣ ਦੇ ਲਈ ਸਹੀ ਨਿਰਦੇਸ਼ ਦਿਉ।
ro: Direcționează vaporul pentru a câștiga cursa.

source: In this activity, you will learn how to enter commands into a computer. Even if the language is extremely basic, you learn here how to think ahead and construct a program. This activity can be used to introduce the programming concept to children.
pa: ਇਸ ਕਿ੍ਆ ਦੇ ਵਿੱਚ ਤੁਸੀਂ ਕੰਪਿਊਟਰ ਦੇ ਵਿੱਚ ਨਿਰਦੇਸ਼ਾਂ ਨੂੰ ਭੇਜਣਾ ਸਿਖੋਗੇ।ਹਾਲਾਂਕਿ ਭਾਸ਼ਾ ਬਹੁਤ ਹੀ ਮੁਢਲੀ ਹੈ,ਇੱਥੇ ਤੁਸੀਂ ਸਿੱਖੋਗੇ ਕਿ ਅੱਗੇ ਕਿਵੇਂ ਸੋਚਣਾ ਹੈ ਅਤੇ ਇੱਕ ਪੋ੍ਗਰਾਮ ਕਿਵੇਂ ਬਣਾਉਣਾ ਹੈ।ਇਹ ਕਿ੍ਆ ਬੱਚਿਆਂ ਨੂੰ ਪੋ੍ਗਰਾਮਿੰਗ ਦਾ ਮਤਲਬ ਸਮਝਾਉਣ ਦੇ ਲਈ ਵਰਤੀ ਜਾ ਸਕਦੀ ਹੈ।

source: Sea race (2 Players)
ar_tn: (السباق البحري (لاعبين
pa: ਸਮੁੰਦਰੀ ਦੌੜ (ਦੋ ਖਿਡਾਰੀ)
ro: Curse maritime (2 Jucători)

source: Give good instructions to your ship in order to be first in the race.
ar_tn: أعط تعليمات جيدة لقاربك لتربح السباق
pa: ਦੌੜ ਦੇ ਵਿੱਚ ਪਹਿਲੇ ਸਥਾਨ ਤੇ ਆਉਣ ਲਈ ਆਪਣੇ ਜਹਾਜ਼ ਨੂੰ ਚੰਗੇ ਨਿਰਦੇਸ਼ ਦਿਉ।
ro: Instructează bine vaporul pentru a fi primul în cursă.

source: Sea race (Single Player)
ar_tn: (السباق البحري (فردي
pa: ਸਮੁੰਦਰੀ ਦੌੜ ( ਇੱਕ ਖਿਡਾਰੀ)
ro: Curse maritime (1 Jucător)

source: Count the number of dots on dice before they reach the ground
ar_tn: أدخل الكلمات المتساقطة قبل أن تصل إلى الأرض
pa: ਮੈਦਾਨ ਵਿੱਚ ਪਹੁੰਚਣ ਤੋਂ ਪਹਿਲਾਂ ਗੀਟੇ ਤੇ ਬਿੰਦੀਆਂ ਨੂੰ ਗਿਣੋ।
ro: Numără punctele de pe zar înainte ca acesta să atingă pământul

source: Counting skills
ar_tn: تعلم الحساب
pa: ਗਿਣਨ ਦੀ ਮੁਹਾਰਤ।

source: In a limited time, count the number of dots
ar_tn: أحص عدد النقط في الوقت المحدد
pa: ਸੀਮਿਤ ਸਮੇਂ ਵਿੱਚ ਬਿੰਦੀਆਂ ਦੀ ਗਿਣਤੀ ਕਰੋ।
ro: În limita timpului, număra punctele

source: Numbers With Dice
ar_tn: أرقام و مكعبات
pa: ਗੀਟੇ ਨਾਲ ਅੰਕ।
ro: Numere Cu Zaruri

source: With the keyboard, type the number of dots you see on the falling dice.
ar_tn: اضغط على المفتاح المناسب لعدد النقط الموجودة على المكعب المتساقط
pa: ਕੀਬੋਰਡ ਦੇ ਨਾਲ ਡਿੱਗੇ ਹੋਏ ਗੀਟੇ ਤੇ ਜਿਹੜੀ ਤੁਸੀਂ ਬਿੰਦੀਆਂ ਵੇਖਦੇ ਹੋ ਉਹਨਾ ਨੂੰ ਲਿਖੋ।
ro: Tastează numărul de puncte pe care în vezi pe zarul în cădere.

source: Numbers with pairs of dice
ar_tn: أرقام و مكعبات
pa: ਜੋੜੇ ਗੀਟੇ ਦੇ ਨਾਲ ਅੰਕ।
ro: Numere cu perechi de zaruri

source: Go to Sound activities
ar_tn: الأنشطة المعتمدة على الألوان
pa: ਆਵਾਜ਼ ਕਿ੍ਆਵਾਂ ਤੇ ਜਾਉ।
ro: Dute la activități Sunet

source: Sound based activities.
ar_tn: الأنشطة المعتمدة على الألواح
pa: ਆਵਾਜ਼ ਤੇ ਅਧਾਰਿਤ ਕਿ੍ਆਵਾਂ।
ro: Activități bazate pe sunet

source: Strategy games
ar_tn: ألعاب استراتيجية
pa: ਖੇਡ ਰਾਜਨੀਤੀ।
ro: Jocuri strategice

source: Strategy games like chess, connect4, ...
ar_tn: ألعاب استراتيجية مثل الشطرنج، اربط 4،....
pa: ਖੇਡ ਰਾਜਨੀਤੀ ਸ਼ਤਰੰਜ ਦੀ ਤਰੂਂ,ਕੰਨੈਕਟ4,....
ro: Jocuri strategice ca șah, connect4, ...

source: Learn how a submarine works
ar_tn: تعلم كيف تعمل الغواصة
pa: ਸਿੱਖੋ ਕਿ ਸਬਮਰੀਨ ਕਿਵੇਂ ਕੰਮ ਕਰਦੇ ਹਨ।
ro: Învață cum submarina lucrează

source: Physics basics
ar_tn: مبادئ الفيزياء
pa: ਬੁਨਿਆਦੀ ਭੌਤਿਕ ਵਿਗਿਆਨ।
ro: Bazele fizice

source: Pilot a submarine
ar_tn: قيادة غواصة
pa: ਇੱਕ ਸਬਮਰੀਨ ਨੂੰ ਚਲਾਉ।
ro: Pilotează submarina

source: Pilot a submarine using air tanks and dive rudders
ar_tn: قد غواصة باستعمال خزانات الهواء ودفة الغوص
pa: ਇੱਕ ਸਬਮਰੀਨ ਨੂੰ ਹਵਾ ਟੈਂਕ ਅਤੇ ਪਤਵਾਰ ਚੁੱਬੀ ਨਾਲ ਚਲਾਉ।
ro: Pilotează submarina folosind rezervoarele de apă și cârmele de scufundare

source: Completing the puzzle requires patience and logical ability
ar_tn: إكمال اللغز يستوجب الصبر و التفكير المنطقي
pa: ਉਵਝਣ ਨੂੰ ਪੂਰਾ ਕਰਨ ਲਈ ਸਬਰ ਅਤੇ ਤਰਕ ਯੋਗਤਾ ਦੀ ਜਰੂਰਤ ਹੁੰਦੀ ਹੈ।

source: For the first level with colored symbols, drag symbols on the left to their target position. For the higher levels, click on an empty square to give it the keyboard focus. Then enter a possible letter or number. GCompris will not let you enter invalid data.
pa: ਰੰਗੇ ਹੋਏ ਨਿਸ਼ਾਨਾਂ ਨਾਲ ਪਹਿਲੇ ਪੜਾਅ ਦੇ ਲਈ ,ਨਿਸ਼ਾਨਾਂ ਨੂੰ ਖੱਬੇ ਪਾਸੇ ਤੋਂ ਉਹਨਾਂ ਦੇ ਟੀਚੇ ਤੇ ਖੀਚੋ।ਉੱਚੇ ਪੜਾਵਾਂ ਦੇ ਵਾਸਤੇ ਕੀਬੋਰਡ ਤੇ ਫੋਕਸ ਹੋਣ ਲਈ ਖਾਲੀ ਚੌਰਸ ਡੱਬੇ ਤੇ ਕਲਿੱਕ ਕਰੋ।ਉਸ ਤੋਂ ਸੰਭਾਵਿਤ ਅੱਖਰ ਜਾਂ ਅੰਕ ਲਿਖੋ।ਜੀਕੰਪ੍ਾਇਸ ਤੁਹਾਨੂੰ ਗਲਤ ਡਾਟਾ ਦਾਖਲ ਨਹੀ ਕਰਨ ਦਿੰਦੀ।

source: Sudoku, place unique symbols in a square.
ar_tn: سيدوكو,ضع رمزا واحدا في كل مربع
pa: ਸੁਡੋਕੁ ਦੇ ਵਿੱਚ ਅੱਲਗ ਤਰਾਂ ਦੇ ਚੌਰਸ ਨਿਸ਼ਾਨ ਹੁੰਦੇ ਹਨ।

source: Symbols must be unique in a row, in a column, and (if defined) each region.
ar_tn: يجب أن يكون الرمز وحيدا في السطر و في المنطقة إذا حددت
pa: ਲਾਈਨ,ਖਾਨੇ ਅਤੇ ਹਰ ਖੇਤਰ (ਜੇ ਦਿੱਤਾ ਹੈ) ਦੇ ਨਿਸ਼ਾਨ ਅੱਲਗ ਹੋਣੇ ਚਾਹੀਦੇ ਹਨ।

source: The aim of the puzzle is to enter a symbol or numeral from 1 through 9 in each cell of a grid, most frequently a 9x9 grid made up of 3x3 subgrids (called 'regions'), starting with various symbols or numerals given in some cells (the 'givens'). Each row, column and region must contain only one instance of each symbol or numeral (Source &lt;http://en.wikipedia.org/wiki/Sudoku&gt;).
pa: ਇੱਕ ਗਰਿੱਡ ਦੇ ਹਰ ਸੈਲ ਵਿੱਚ ਨਿਸ਼ਾਨ ਨੂੰ ਨੰਬਰ 1 ਤੋਂ 9 ਤੱਕ ਦਾਖਲਾ ਕਰਨਾ ਪਜ਼ਲ ਦਾ ਮੁੱਖ ਉਦੇਸ਼ ਹੈ।ਜਿਆਦਾਤਰ 9x9 ਗਰਿੱਡ 3x3 ਸਬਗਰਿੱਡ ਹੁੰਦਾ ਹੈ।(ਜਿਹਨੂੰ ਖੇਤਰ ਕਹਿੰਦੇ ਹਨ),ਜੋ ਕਈ ਤਰਾਂ ਦੇ ਕਿਸੇ ਸੈਲ ਚ ਦਿੱਤੇ ਨਿਸ਼ਾਨਾਂ ਜਾਂ ਨੰਬਰਾਂ ਨਾਲ ਸ਼ੁਰੂ ਹੁੰਦਾ ਹੈ।ਹਰ ਲਾਈਨ,ਖਾਨੇ ਅਤੇ ਖੇਤਰ ਦੇ ਵਿੱਚ ਨਿਸ਼ਾਨ ਜਾਂ ਨਂਬਰ ਦੀ ਸਿਰਫ ਇੱਕ ਹੀ ਉਦਾਹਰਣ ਹੋਣੀ ਚਾਹੀਦੀ ਹੈ।

source: Click on the items until you find what you think is the correct answer. Then, click on the OK button in the control bar. In the lower levels, Tux gives you an indication if you found a hiding place by marking the item with a black box. You can use the right mouse button to flip the colors in the opposite order.
pa: ਜਦੋਂ ਤਕ ਤੁਹਾਨੂੰ ਸਹੀ ਨਾ ਲੱਗੇ ਤਦ ਤੱਕ ਚੀਜ਼ਾਂ ਤੇ ਕਲਿੱਕ ਕਰਦੇ ਰਹੋ।ਫਿਕ ਕੰਟਰੋਲਬਾਰ ਦੇ ਵਿੱਚੋਂ ਉਕੇ ਬਟਨ ਨੂੰ ਦਖਾਉ।ਨਿਚਲੇ ਪੜਾਵਾਂ ਤੇ ,ਕਾਲੇ ਡੱਬੇ ਨਾਲ ਮਾਰਕਿੰਗ ਕਰਨ ਤੇ ਜੇ ਤੁਹਾਨੂੰ ਇੱਕ ਛੁਪੀ ਹੋਈ ਥਾਂ ਲੱਭਦੀ ਹੈ ਤਾਂ ਟਕਸ ਤੁਹਾਨੂੰ ਇੱਕ ਇਸ਼ਾਰਾ ਦਇੰਦੀ ਹੈ।ਉਲਟੀ ਤਰਕੀਬ ਦੇ ਵਿੱਚ ਰੰਗ ਨੂੰ ਬਦਲਣ ਦੇ ਲਈ ਤੁਸੀਂ ਮਾਊਸ ਦਾ ਸੱਜਾ ਬਟਨ ਵਰਤ ਸਕਦੇ ਹੋ।

source: Super Brain
ar_tn: الذكاء الفائق
pa: ਬਹੁਤ ਦਿਮਾਗੀ।
ro: Super Creier

source: Tux has hidden several items. Find them again in the correct order
ar_tn: البطريق يخفي عدة أشياء , جدها بالتسلسل الصحيح
pa: ਟਕਸ ਨੇ ਕਈ ਚੀਜ਼ਾਂ ਛੁਪਾਈਆਂ ਹੋਈਆਂ ਹਨ। ਉਹਨਾਂ ਨੂੰ ਦੁਬਾਰਾ ਸਹੀ ਤਰਤੀਬ ਦੇ ਵਿੱਚ ਲੱਭੋ।

source: From Wikipedia, the free encyclopedia. Tangram (Chinese: literally "seven boards of cunning") is a Chinese puzzle. While the tangram is often said to be ancient, its existence has only been verified as far back as 1800. It consists of 7 pieces, called tans, which fit together to form a square; taking the square as the unit: * 5 right isosceles triangles o 2 small (legs of 1) o 1 medium size (legs of square root of 2) o 2 large size (legs of 2) * 1 square (side of 1) * 1 parallelogram (sides of 1 and square root of 2)
pa: ਵਿੱਕੀਪੀਡੀਆ ਤੋਂ, ਮੁਫਤ ਇਨਸੀਕਲੋਪੀਡੀਆ। ਟੰਗਾ੍ਮ ਇੱਕ ਚਾਈਨੀਜ਼ ਪਜ਼ਲ ਹੈ।ਹਾਲਾਂਕਿ ਇਹ ਕਿਹਾ ਜਾਂਦਾ ਹੈ ਕਿ ਟੰਗਾ੍ਮ ਸਦੀਆਂ ਪੁਰਾਣਾਂ ਹੈ, ਪਰ ਇਸ ਦੀ ਅਸਲੀ ਹੋਂਦ 1800 ਸਾਲ ਪਿੱਛੋਂ ਦੀ ਹੈ।ਇਹ ਸੱਤ ਟੁਕੜਿਆਂ ਤੋਂ ਬਣਿਆ ਹੋਇਆ ਹੈ, ਜਿਹਨੂੰ ਕਿ ਟੈੰਨਸ ਕਹਿੰਦੇ ਹਨ, ਸਕੇਅਰ ਨੂੰ ਇੱਕ ਇਕਾਈ ਲੈ ਕੇ ਜਿਹੜਾ ਕਿ ਇੱਕ ਚੋਰਸ ਡੱਬਾ ਬਣਾਉਣ ਦੇ ਲਈ ਢੁੱਕਵਾਂ ਹੈ। *5 ਸਜੀ ਆਈਸੋਸ਼ੇਲਸ ਤਿਕੋਣਾਂ o2 ਛੋਟੀ (1 ਦੀ ਭੂਜਾ) o 1 ਵਿਚਾਲੜਾ ਮਾਪ (2 ਦੇ ਵਰਗਮੂਲ ਦੀਆਂ ਭੂਜਾਵਾਂ) o 2 ਵੱਡਾ ਮਾਪ (2 ਦੀਆਂ ਭੂਜਾਵਾਂ) * 1 ਵਰਗ (1 ਦੀ ਭੂਜਾ) * 1 ਸਮਾਂਤਰ ਚਤੁਰਭੁਜ ਦੀ (1 ਦੀ ਭੂਜਾ ਅਤੇ 2 ਦਾ ਵਰਗਮੂਲ)

source: Select the tangram to form. Move a piece by dragging it. Right-click on it to create a symmetrical item. Select an item and drag around it to show the rotation you want. Once you've shown what shape you want, the computer will create it. If you need help, click on the shape button, and the border of the shape will be drawn.
pa: ਬਣਾਉਣ ਦੇ ਲਈ ਟੰਗਾ੍ਮ ਨੂੰ ਚੁਣੋ।ਇੱਕ ਟੁਕੜੇ ਨੂੰ ਖਿੱਚ ਕੇ ਹਿਲਾਉ।ਇੱਕ ਸੀਮਟਰੀਕਲ ਚੀਜ਼ ਨੂੰ ਬਣਾਉਣ ਦੇ ਲਈ ਇਸ ਦੇ ਉੱਤੇ ਸੱਜੇ ਪਾਸੇ ਵਾਲਾ ਕਲਿਕ ਕਰੋ।ਇੱਕ ਚੀਜ਼ ਨੂੰ ਚੁਣੋ ਅਤੇ ਜਿਹੜਾ ਚੱਕਰ ਤੁਸੀਂ ਦਿਖਾਉਣਾ ਚਾਹੁੰਦੇ ਹੋ ਉਸ ਨੂੰ ਇਸ ਦੇ ਚਾਰੇ ਪਾਸੇ ਖਿੱਚੋ।ਜੇ ਤੁਸੀਂ ਇੱਕ ਵਾਰੀ ਉਹ ਆਕਿ੍ਤੀ ਦਿਖਾ ਦਿੱਤੀ ਜੋ ਤੁਸੀਂ ਚਾਹੁੰਦੇ ਹੋ, ਤਾਂ ਕੰਪਿਟਰ ਇਸਨੂੰ ਬਣਾਏਗਾ। ਜੇ ਤੁਹਾਨੂੰ ਸਹਾਇਤਾ ਦੀ ਜ਼ਰੂਰਤ ਹੈ ਤਾਂ ਸ਼ੇਪ ਬਟਨ ਦੇ ਉੱਤੇ ਕਲਿਕ ਕਰੋ, ਅਤੇ ਆਕਿ੍ਤੀ ਦੀ ਹੱਦ ਬਣਾ ਦਿੱਤੀ ਜਾਵੇਗੀ।

source: The objective is to form a given shape with seven pieces
ar_tn: الهدف هو تكوين شكل بسبعة قطع
pa: ਸੱਤ ਟੁਕੜਿਆਂ ਦੇ ਨਾਲ ਦਿੱਤੀ ਆਕਿ੍ਤੀ ਨੂੰ ਬਣਾਉਣਾ ਇਸਦਾ ਮਕਸਦ ਹੈ।
ro: Scopul e alcătuirea formei date din șapte piese

source: The original code was written by Philippe Banwarth in 1999. It was ported to GCompris by Yves Combe in 2005.
pa: ਅਸਲੀ ਕੋਡ 1999 ਦੇ ਵਿੱਚ ਫੀਲੀਪੀ ਬੈਨਵਾਰਥ ਦੁਆਰਾ ਲਿਖੇ ਗਏ। ਇਹ 2005 ਦੇ ਵਿੱਚ ਜੀਕੰਪਾ੍ਈਸ ਚ ਵੇਸ ਕੰਬੇ ਦੁਆਰਾ ਲਿਆਂਦੀ ਗਈ।

source: The tangram puzzle game
ar_tn: لغز التانغرام
pa: ਟੰਗਾ੍ਮ ਪਜ਼ਲ ਖੇਡ

source: Can move the mouse, can read numbers and count up to 15 for the first level
pa: ਮਾਊਸ ਨੂੰ ਚਲਾ ਸਕਦੀ ਹੈ, ਨੰਬਰਾਂ ਨੂੰ ਪੜ੍ਹ ਸਕਦੀ ਹੈ ਅਤੇ ਪਹਿਲੇ ਪੜਾਅ ਦੇ ਲਈ 15 ਤੱਕ ਗਿਣ ਸਕਦੀ ਹੈ।
ro: Poate muta șoricelul, poate citi numere și număra până la 15 pentru primul nivel

source: Check the wind speed and direction, and then click on the target to launch a dart. When you all your darts are thrown, a window appears asking you to count your score. Enter the score with the keyboard then press the Enter key or the OK button.
pa: ਹਵਾ ਦੀ ਰਫਤਾਰ ਅਤੇ ਦਿਸ਼ਾ ਪਰਖੋ ਅਤੇ ਫਿਰ ਸੂਆ ਨੂੰ ਚਲਾਉਣ ਲਈ ਟੀਚੇ ਤੇ ਕਲਿੱਕ ਕਰੋ।ਜਦੋਂ ਤੁਸੀਂ ਆਪਣੇ ਸਾਰੇ ਸੂਏ ਸੁੱਟ ਦਿੰਦੇ ਹੋ ਤਾਂ, ਇੱਕ ਵਿੰਡੋ ਖੁਲੇਗੀ ਜੋ ਕਿ ਤੁਹਾਨੂੰ ਤੁਹਾਡਾ ਸਕੋਰ ਗਿਣਨ ਦੇ ਲਈ ਪੁੱਛੇਗੀ।ਕੀਬੋਰਡ ਦੇ ਨਾਲ ਸਕੋਰ ਨੂੰ ਲਿਖੋ ਅਤੇ ਫਿਰ ਐਂਟਰ ਜਾਂ ਓਕੇ ਬਟਨ ਨੂੰ ਦਬਾਓ।

source: Hit the target and count your points
ar_tn: صب الهدف و اجمع النقاط
pa: ਟੀਚੇ ਤੇ ਨਿਸ਼ਾਨਾ ਸੇਧੋ ਅਤੇ ਆਪਣੇ ਅੰਕ ਗਿਣੋ।
ro: Lovește ținta și numără-ți punctele

source: Practice addition with a target game
ar_tn: مارس عملية الجمع من خلال لعبة الهدف
pa: ਟਾਰਗੈਟ ਗੇਮ ਦੇ ਨਾਲ ਜੋੜ ਦਾ ਅਭਿਆਸ ਕਰੋ।
ro: Exersează adunarea cu un joc cu țintă

source: Throw darts at a target and count your score.
ar_tn: ارم الأسم على الهدف و اجمع نتيجتك
pa: ਸੂਏ ਟਿਕਾਣੇ ਤੇ ਸੁੱਟੋ ਅਤੇ ਆਪਣੇ ਅੰਕ ਗਿਣੋ।
ro: Aruncă săgețile la țintă și calculeză-ți scorul.

source: A sliding-block puzzle game
ar_tn: لعبة لغز الكتلة المنزلقة
pa: ਢਿਲਕਵੀ ਉਲਝਣ ਖੇਡ।

source: Each car can only move either horizontally or vertically. You must make some room in order to let the red car move through the gate on the right.
ar_tn: افسح بعض المكان للسماح للسيارة الحمراء بالعبور عبر البوابة التي على اليمين
pa: ਹਰੇਕ ਕਾਰ ਖੱਬੇ-ਸੱਜੇ ਜਾਂ ਅੱਗੇ-ਪਿੱਛੇ ਹੀ ਚੱਲ ਸਕਦੀ ਹੈ।ਸੱਜੇ ਪਾਸੇ ਤੋਂ ਕਾਰ ਨੂੰ ਲੈ ਕੇ ਜਾਣ ਲਈ ਤੁਹਾਨੂੰ ਇੱਕ ਕਮਰਾ ਜ਼ਰੂਰ ਬਣਾਉਣਾ ਚਾਹੀਦਾ ਹੈ।
ro: Fiecare mașină se poate mișca sau orizontal sau vertical. Trebuie sa faceti ceva spațiu pentru a permite mașinei roșii mișcarea către poarta din dreapta.

source: Remove the red car from the parking lot through the gate on the right
ar_tn: أنزل السيارة الحمراء من الموقف من خلال البوابة التي على اليمين
pa: ਸੱਜੇ ਗੇਟ ਦੇ ਰਾਹੀਂ ਲਾਲ ਕਾਰ ਨੂੰ ਪਾਰਕਿੰਗ ਦੇ ਵਿੱਚੋੰ ਬਾਹਰ ਕੱਢੋ।

source: Drawing activity (pixmap)
ar_tn: نشاط الرسم (بيكسماب)
pa: ਚਿੱਤਰਕਲਾ ਕਿ੍ਆਵਾਂ (ਪਿਕਸਮੈਪ)
ro: Activitate de desen.

source: Launch Tuxpaint
ar_tn: أنشئ مرسم البطريق
pa: ਟਕਸਪੇਂਟ ਨੂੰ ਖੋਲੋ
ro: Lansați Tuxpaint-ul

source: Tuxpaint
ar_tn: مرسم البطريق
pa: ਟਕਸਪੇਂਟ

source: Use Tuxpaint to draw. When Tuxpaint is finished this board will end.
ar_tn: استخدم كسبينت للرسم. عند الانتهاء كسبينت هذه اللوحة ستنتهي
pa: ਤਸਵੀਰ ਬਣਾਉਣ ਦੇ ਲਈ ਟਕਸਪੇਂਟ ਨੂੰ ਵਰਤੋ।ਜਦੋਂ ਟਕਸਪੇਂਟ ਖਤਮ ਹੋ ਜਾਵੇਗਾ ਇਸ ਫੱਟੇ ਦਾ ਅੰਤ ਹੋ ਜਾਵੇਗਾ।
ro: Folosește Tuxpaint pentru a desena. Când Tuxpaint va fi terminat, acest panou se va închide.

source: mouse and keyboard manipulation
ar_tn: استخدام الفأرة و لوحة المفاتيح
pa: ਮਾਊਸ ਅਤੇ ਕੀਬੋਰਡ ਦੀ ਜੋੜ-ਤੋੜ।
ro: Folosirea tastaturii și șoricelului

source: Click on different active elements : sun, cloud, water pump station, and water cleanup station, in order to reactivate the entire water system. When the system is back up and Tux is in the shower, push the shower button for him.
ar_tn: انقر على عناصر حيّة مختلفة: شمس، غيمة، محطة الضخ المائية، محطة التنظيف المائية من أجل إعادة تشغيل النظام المائي بأكمله. عندما يعود النظام، البطريق سيكون في دش الاستحمام. اضغط له زر الدش
pa: ਪੂਰੇ ਪਾਣੀ ਦੇ ਢੰਗ ਨੂੰ ਦੁਬਾਰਾ ਚਲਾਉਣ ਲਈ ਵੱਖ-ਵੱਖ ਕਿ੍ਆਸ਼ੀਲ ਤੱਤਾਂ ਤੇ ਕਲਿਕ ਕਰੋ-ਸੂਰਜ,ਬੱਦਲ,ਪਾਣੀ ਖਿੱਚਣ ਵਾਲਾ ਅੱਡਾ ਅਤੇ ਪਾਣੀ ਸਾਫ ਕਰਨ ਵਾਲਾ ਅੱਡਾ।ਜਦੋਂ ਪਾਣੀ ਦਾ ਸਿਸਟਮ ਦੁਬਾਰਾ ਚਲ ਗਿਆ ਅਤੇ ਟਕਸ ਨਹਾ ਰਿਹਾ ਹੈ ਤਾਂ ਸ਼ਾਵਰ ਦੇ ਬਟਨ ਨੂੰ ਚਲਾਓ।
ro: Faceți un click pe elementele active: soare, nor, stația de pompare a apei, și stația de curățire a apei, pentru a reactiva sistemul de apă. Când sistemul e setat și Tux e în duș, apasă pe butonul din duș.

source: Learn about the water cycle
ar_tn: استعلم عن دورة المياه
pa: ਜਲ ਚੱਕਰ ਬਾਰੇ ਪੱੜੋ।
ro: Învață despre ciclul apei

source: Learn the water cycle
ar_tn: تعلم دورة المياه
pa: ਜਲ ਚੱਕਰ ਬਾਰੇ ਪੱੜੋ।
ro: Învață ciclul apei

source: Tux has come back from a long fishing party on his boat. Bring the water system back up so he can take a shower.
ar_tn: لقد عاد ثكس من رحلة صيد طويلة على قاربه. أعد دورة المياه ليستطيع الاستحمام
pa: ਟਕਸ ਇੱਕ ਲੰਬੀ ਮੱਛੀ ਪਾਰਟੀ ਤੋਂ ਵਾਪਸ ਆਪਣੀ ਕਿਸ਼ਤੀ ਤੇ ਆ ਗਿਆ ਹੈ,ਪਾਣੀ ਫੇਰ ਛੱਡ ਦੋ ਤਾ ਕਿ ਉਹ ਨਹਾ ਸਕੇ।
ro: Tux a venit de la pescuit. Construește sistemul de apă pentru ai permite lui Tux să facă un duș.

source: Falling Words
ar_tn: الكلمات المتساقطة
pa: ਡਿਗਦੇ ਅਖੱਰ
ro: Cuvinte căzătoare

source: Keyboard training
ar_tn: التدرب على لوحة المفاتيح
pa: ਕੀਬੋਰਡ ਦੀ ਸਿਖਲਾਈ।
ro: Exersarea tastaturii

source: Type the complete word as it falls, before it reachs the ground
ar_tn: أدخل الحروف المتساقطة قبل أن تصل إلى الأرض
pa: ਅਖੱਰ ਦੇ ਜ਼ਮੀਨ ਤੇ ਡਿਗਨ ਤੋਂ ਪਹਿਲਾਂ ਉਸ ਨੂੰ ਪੂਰਾ ਲਿੱਖੋ।

source: Type the falling words before they reach the ground
ar_tn: أدخل الكلمات المتساقطة قبل أن تصل إلى الأرض
pa: ਅਖੱਰ ਦੇ ਜ਼ਮੀਨ ਤੇ ਡਿਗਨ ਤੋਂ ਪਹਿਲਾਂ ਉਸ ਨੂੰ ਪੂਰਾ ਟਾਇਪ ਕਰੋ।
ro: Scrie cuvintele care cad înainte să ajungă pe pământ

source: A simple word processor to enter and save any text
pa: ਇੱਕ ਸਧਾਰਣ ਸ਼ਬਦ ਪੋ੍ਸੈਸਰ ਜਿਸ ਵਿੱਚ ਅਖੱਰ ਲਿਖੀਆ ਅਤੇ ਸੇਵਾ ਕਿਤਾ ਜਾ ਸਕਦਾ ਹੈ।
ro: Un procesor simplu de texte pentru întroducerea și păstrarea textului

source: In this wordprocessor you can type the text you want, save and get it back later. You can add some style to your text by using the buttons on the left. The first 4 buttons let you select the style of the line on which your insert cursor is. The 2 others buttons with multiple choices let you select from a predefined document and color theme.
pa: ਇਸ ਸ਼ਬਦ ਪੋ੍ਸੈਸਰ ਵਿੱਚ ਤੁਸੀਂ ਜੋ ਸ਼ਬਦ ਚਾਹੁੰਦੇ ਹੋ ਉਸ ਨੂੰ ਲਿੱਖ,ਸੇਵ ਅਤੇ ਦੁਬਾਰਾ ਵੇਖ ਸਕਦੇ ਹੋ।ਤੁਸੀਂ ਆਪਣੇ ਸ਼ਬਦਾਂ ਵਿੱਚ ਢੰਗ ਲਿਆਉਣ ਲਈ ਖੱਬੇ ਪਾਸੇ ਦਿੱਤੇ ਬਟਨਾਂ ਦੀ ਵਰਤੋ ਕਰ ਸਕਦੇ ਹੋ।ਪਹਿਲੇ ਚਾਰ ਬਟਨ ਤੁਹਾਨੂੰ ਜਿਸ ਲਾਇਨ ਤੇ ਤੁਹਾਡਾ ਕਰਸਰ ਹੈ ਉਸ ਲਾਇਨ ਦੇ ਵੱਖ-ਵੱਖ ਢੰਗ ਚੁਣਨ ਦੀ ਸਹੂਲਿਅਤ ਦਿੰਦਾ ਹੈ।ਬਾਕੀ ਦੋ ਬਟਨ ਤੁਹਾਨੂੰ ਪਹਿਲਾਂ ਦਿੱਤੇ ਹੋਏ ਦਸਤਾਵੇਜ਼ ਅਤੇ ਕਲਰ ਥੀਮ ਵਿੱਚੋਂ ਚੁਣਨ ਦੀ ਸਹੂਲਿਅਤ ਦਿੰਦਾ ਹੈ।

source: Learn how to enter text in a wordprocessor. This wordprocessor is special in that it enforces the use of styles. This way, the children will understand their benefit when moving to more feature full wordprocessor like OpenOffice.org.
pa: ਇਸ ਸ਼ਬਦ ਪੋ੍ਸੈਸਰ ਵਿੱਚ ਅਖੱਰ ਲਿੱਖਣਾਂ ਸਿੱਖੋ।ਇਹ ਸ਼ਬਦ ਪੋ੍ਸੈਸਰ ਖਾਸ ਹੈ ਕਿਉਂਕਿ ਇਹ ਤੁਹਾਨੂੰ ਵੱਖ-ਵੱਖ ਢੰਗ ਚੁਣਨ ਦੀ ਸਹੂਲਿਅਤ ਦਿੰਦਾ ਹੈ।ਇਸ ਨਾਲ ਬੱਚਿਆਂ ਨੂੰ ਓਪਨ ਆਫਿਸ ਤੇ ਕੰਮ ਕਰਨ ਦੀ ਵੀ ਅਸਾਨੀ ਹੋਵੇਗੀ।

source: The children can type their own text or copy one given by the teacher.
pa: ਬੱਚੇ ਆਪਣੇ ਖੁੱਦ ਦੇ ਅਖੱਰ ਵੀ ਲਿੱਖ ਸਕਦੇ ਨੇ ਅਤੇ ਅਧਿਆਪਕ ਵੱਲੋਂ ਦਿੱਤਾ ਹੋਇਆ ਕੰਮ ਵੀ।
ro: Copiii pot să tipărească textul lor sau cel dat de profesor.

source: Your word processor
pa: ਤੁਹਾਡਾ ਸ਼ਬਦ ਪੋ੍ਸੈਸਰ।
ro: Procesorul de texte personal

source: Administration for gcompris
ar_tn: محرر لجكومبري
pa: ਜੀਕੋਮਪਾ੍ਇਸ ਲਈ ਪ੍ਸ਼ਾਸਨ।
ro: Administrarea GCompris

source: Educational game for ages 2 to 10
ar_tn: لعبة تربوية بداية من 3 سنوات
pa: 2 ਤੋਂ 10 ਸਾਲ ਦੇ ਬੱਚਿਆਂ ਲਈ ਵਿਦਿਅਕ ਖੇਡ।
ro: Joc educațional pentru copii între vârstele 2 și 10 ani

source: Educational suite GCompris
ar_tn: مجمةعة البرامج التربوية جكومبري
pa: ਵਿਦਿਅਕ ਜੋੜਾ ਜੀਕੋਮਪਾ੍ਇਸ।
ro: Set educațional GCompris

source: Multi-activity educational game
ar_tn: لعبة تربوية متعددة التمرينات
pa: ਬਹੁ-ਕਿ੍ਆ ਵਿਦਿਅਕ ਖੇਡ।
ro: Joc educațional de activitate

source: NORTH
ar_tn: شمال
pa: ਉੱਤਰ
ro: NORD

source: SOUTH
ar_tn: جنوب
pa: ਦੱਖਣ
ro: SUD

source: Choose a house
ar_tn: اختر بيتاً
pa: ਘਰ ਚੁੱਣੋ
ro: Alege o casă

source: Your turn to play ...
ar_tn: دورك لتلعب
pa: ਹੁਣ ਤੁਹਾਡੇ ਖੇਡਣ ਦੀ ਵਾਰੀ
ro: Rândul tău să mergi ...

source: Not allowed! Try again !
ar_tn: غير مسموح! حاول مجدداً
pa: ਆਗਿਆ ਨਹੀ ਹੈ ! ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ
ro: Nu se permite! Încearcă iarăși !

source: Error: The external program gnuchess died unexpectedly
pa: ਗਲੱਤੀ: ਬਾਹਰਲਾ ਪ੍ਰੋਗਰਾਮ ਨਯੁਚੇਸ ਅਚਾਨਕ ਖਤਮ ਹੋਇਆ ਹੈ
ro: Greșală: Programul extern gnuchess sa terminat inexplicabil

source: Error: The external program gnuchess is mandatory to play chess in gcompris. First install it, and check it is in
ar_tn: خطأ: إن البرنامج الخارجي شطرنج جنو إجباري <br> لتلعب شطرنج في gcomris ركّبه أولاً و تحقق أنه موجود
pa: ਗਲੱਤੀ: ਬਾਹਰਲਾ ਪ੍ਰੋਗਰਾਮ ਨਯੁਚੇਸ ਦੀ ਜ਼ਰੂਰਤ ਹੈ।ਜੀਕੋਮਪਾ੍ਇਸ ਵਿੱਚ ਚੈਸ ਖੇਡਣ ਲਈ।ਪਹਿਲਾਂ ਇਨਸਟਾਲ ਕਰੋ,ਫੇਰ ਚੈਕ ਕਰੋ।त्रुटी: खेलगंमत में से शतरंज खेलने के लिये ग्नुचेस यह प्रोग्राम आवश्यक है. पहले ईन्स्टॉल करें बाद में वे है यह जॉंच लें.

source: White's Turn
ar_tn: دور الأبيض
pa: ਚਿੱਟੇ ਪਿਆਦਿਆਂ ਦੀ ਵਾਰੀ

source: Black's Turn
ar_tn: دور الأسود
pa: ਕਾਲੇ ਪਿਆਦਿਆਂ ਦੀ ਵਾਰੀ

source: White checks
ar_tn: الأحجار البيضاء
pa: ਚਿੱਟਿਆਂ ਦਾ ਚੈਕ

source: Black checks
ar_tn: الأحجار السوداء
pa: ਕਾਲਿਆਂ ਦਾ ਚੈਕ

source: Black mates
ar_tn: السود كش
pa: ਕਾਲਿਆਂ ਨੂੰ ਸ਼ੈਹ
ro: Negrul dă mat

source: White mates
ar_tn: كش للبيض
pa: ਚਿੱਟਿਆਂ ਨੂੰ ਸ਼ੈਹ
ro: Albul dă mat

source: Drawn game
ar_tn: تعادل
pa: ਖੇਡ ਬਰਾਬਰੀ ਤੇ ਖਤਮ ਹੋ ਗਿਆ।
ro: Remiză

source: Error: The external program gnuchess died unexpectingly
ar_tn: خطأ: إن البرنامج الخارجي شطرنج جنو مات فجأة
pa: ਗਲੱਤੀ: ਬਾਹਰਲਾ ਪ੍ਰੋਗਰਾਮ ਨਯੁਚੇਸ ਅਚਾਨਕ ਖਤਮ ਹੋਇਆ ਹੈ
ro: Greșală: Programul extern gnuchess sa terminat inexplicabil

source: Error: this activity cannot be played with the sound effects disabled. Go to the configuration dialog to enable the sound
ar_tn: خطأ: لا يمكن ممارسة هذا التمرين مع المؤثرات الصوتية. اذهب لحوار (التشكيل: configuration) ليتمكن من تشغيل الصوت
pa: ਗਲੱਤੀ: ਅਵਾਜ਼ ਬੰਦ ਕਰਕੇ ਇਹ ਖੇਡ ਨਹੀਂ ਖੇਡ ਸਕਦੇ ਇਸ ਲਈ ਕੋਣਫੀਗੁਰੇਸ਼ਨ ਡਾਈਲਾੱਗ ਬਾਕਸ ਤੇ ਜਾਕੇ ਅਵਾਜ਼ ਚਾਲੂ ਕਰੋ
ro: Greșală: activitatea nu poate fi jucată cu efectele sonore deactivate. Mergeți la dialogul de configurare și activați sunetul.

source: Error: this activity requires that you first install the packages with GCompris voices for the locale '%s' ! Fallback to english, sorry!
ar_tn: خطأ: هذا التمرين يتطلب أولاً تحميل <br> الرزم التي مع أصوات جكومبري من أجل موقع %s! نتأسف التبديل إلى الانكليزية
pa: ਗਲੱਤੀ:ਇਹ ਕਿਰਿਆ ਚਾਹੁੰਦੀ ਹੈ ਕਿ ਤੁਸੀਂ ਪਹਿਲਾਂ ਜੀਕੋਮਪਾ੍ਇਸ ਦੇ ਅਵਾਜ਼ ਦੇ ਧਰਾਂ ਵਾਲੇ ਪੈਕੇਜ ਇਨਸਟਾਲ ਕਰੋ।ਮਾਫ ਕਰੋ ,ਅੰਗੇ੍ਜ਼ੀ ਤੇ ਵਾਪਸ ਜਾਓ

source: <b>%s</b> configuration for profile <b>%s</b>
pa: <b>%s</b> ਇਸ ਪੋ੍ਫਾਇਲ ਲਈ ਕਾਨਫਿਗਰੇਸ਼ਨ <b>%s</b>

source: Uppercase only text
ar_tn: نص الحروف الكبيرة فقط
pa: ਬੱਸ ਵੱਡੇ ਅਖੱਰਾਂ (ਵੱਡੇ ਅੱਖਰਾਂ ਵਿੱਚ ਲਿਖਿਆ) ਵਿੱਚ ਵਿਆਖਿਆ ਕਰੋ
ro: Textul numai cu majuscule

source: Set the watch to:
ar_tn: حرك العقارب لتحديد الساعة :
pa: ਇਸ ਸਮੇਂ ਤੇ ਘੱੜੀ ਲਾਓ
ro: Setați ceasul la:

source: Click on the blue duck
ar_tn: أنقر على الصورة %s
pa: ਨੀਲੀ ਬੱਤਖ ਤੇ ਬਟਨ ਦੱਬੋ‌
ro: Fă clic pe rața albastră

source: Click on the brown duck
ar_tn: أنقر على الصورة %s
pa: ਭੂਰੀ ਬੱਤਖ ਤੇ ਬਟਨ ਦੱਬੋ
ro: Fă clic pe rața maro

source: Click on the green duck
ar_tn: أنقر على اللون المناسب
pa: ਹਰੀ ਬੱਤਖ ਤੇ ਬਟਨ ਦੱਬੋ
ro: Fă clic pe rața verde

source: Click on the grey duck
ar_tn: أنقر على اللون المناسب
pa: ਗੇ੍ ਬੱਤਖ ਤੇ ਬਟਨ ਦੱਬੋ
ro: Faceți clic pe rața gri

source: Click on the orange duck
ar_tn: أنقر على اللون المناسب
pa: ਸੰਗਤਰੀ ਬੱਤਕ ਤੇ ਕਲਿੱਕ ਕਰੋ
ro: Faceți clic pe rața portocalie

source: Click on the purple duck
ar_tn: أنقر على اللون المناسب
pa: ਬੈਂਗਨੀ ਬੱਤਕ ਤੇ ਕਲਿੱਕ ਕਰੋ
ro: Faceți clic pe rața violet

source: Click on the red duck
ar_tn: أنقر على اللون المناسب
pa: ਲਾਲ ਬੱਤਕ ਤੇ ਕਲਿੱਕ ਕਰੋ
ro: Faceți clic pe rața roșie

source: Click on the yellow duck
ar_tn: أنقر على الصورة %s
pa: ਪੀਲੀ ਬੱਤਕ ਤੇ ਕਲਿੱਕ ਕਰੋ
ro: Faceți clic pe rața galbenă
