Repository: MkPereira/gcompris
Catalog: po/*.po
Languages: ar_tn, pa, ro

source: Subtraction memory game against Tux
ar_tn: لعبة ذاكرة الطرح ضد البطريق
pa: ਟਕਸ ਦੇ ਖਿਲਾਫ ਘਟਾਓ ਵਾਲੀ ਮੈਮਿਊਰੀ ਖੇਡ
ro: Un joc ce folosește scăderea contra Tux

source: Multiplication
ar_tn: الضرب
pa: ਗੁਣਾ
ro: Înmulțire

source: Multiplication memory game
ar_tn: لعبة ذاكرة الضرب
pa: ਗੁਣਾ ਵਾਲੀ ਮੈਮਿਊਰੀ ਖੇਡ
ro: Joc de memorie cu înmulțire

source: Practise multiplication, until all the cards are gone.
ar_tn: تدرب على عملية الضرب إلى أن تختفي جميع البطاقات
pa: ਜਦ ਤਕ ਸਾਰੇ ਪੱਤੇ ਗਾਇਬ ਨਾ ਹੋ ਜਾਣ ਗੁਣਾ ਦਾ ਅਭਿਆਸ ਕਰੋ
ro: Exersează înmulțirea, până când toate cărțile au dispărut.

source: Turn the cards over to find two numbers which multiply the same, until all the cards are gone.
ar_tn: اقلب جميع البطاقات لتجد رقمين لديهما نفس محصلة الطرح إلى أن تختفي جميع البطاقات
pa: ਜਦ ਤਕ ਸਾਰੇ ਪੱਤੇ ਗਾਇਬ ਨਾ ਹੋ ਜਾਣ,ਪੱਤੇ ਪਲਟੋ ਤਾਂ ਕਿ ਉਹ ਦੋ ਅੰਕ ਲੱਭ ਜਾਣ ਜਿਨਾ ਦੀ ਗੁਣਾ ਸਮਾਨ ਹੈ।
ro: Întoarceți cărțile pentru a găsi două numere care se înmulțesc identic, până când toate cărțile dispar.

source: Multiplication and division memory game
ar_tn: لعبة ذاكرة الضرب و القسمة
pa: ਗੁਣਾ ਅਤੇ ਤਕਸੀਮ ਵਾਲੀ ਮੈਮਿਊਰੀ ਖੇਡ
ro: Un joc ce folosește înmulțirea și împărțirea

source: Multiplication, division
ar_tn: الضرب، القسمة
pa: ਗੁਣਾ,ਤਕਸੀਮ
ro: Înmulțirea, împărțirea

source: Practise multiplication, division, until all the cards are gone.
ar_tn: تدرب على عملية القسمة إلى أن تختفي جميع البطاقات
pa: ਜਦ ਤਕ ਸਾਰੇ ਪੱਤੇ ਗਾਇਬ ਨਾ ਹੋ ਜਾਣ ,ਗੁਣਾ ਅਤੇ ਤਕਸੀਮ ਦਾ ਅਭਿਆਸ ਕਰੋ
ro: Exersați înmulțirea, împărțirea până când toate fișele vor dispărea.

source: Multiplication and division memory game against Tux
ar_tn: لعبة ذاكرة الضرب و القسمة ضد البطريق
pa: ਟਕਸ ਦੇ ਖਿਲਾਫ ਗੁਣਾ ਅਤੇ ਤਕਸੀਮ ਵਾਲੀ ਮੈਮਿਊਰੀ ਖੇਡ
ro: Un joc ce folosește înmulțirea și împărțirea contra Tux

source: Multiplication memory game against Tux
ar_tn: لعبة ذاكرة الضرب ضد البطريق
pa: ਟਕਸ ਦੇ ਖਿਲਾਫ ਗੁਣਾ ਵਾਲੀ ਮੈਮਿਊਰੀ ਖੇਡ
ro: Un joc ce folosește înmulțirea contra Tux

source: Practise multiplication until all the cards are gone.
ar_tn: تدرب على عملية الضرب إلى أن تختفي جميع البطاقات
pa: ਜਦ ਤਕ ਸਾਰੇ ਪੱਤੇ ਗਾਇਬ ਨਾ ਹੋ ਜਾਣ ,ਗੁਣਾ ਦਾ ਅਭਿਆਸ ਕਰੋ
ro: Exersează înmulțirea până când toate cărțile au dispărut.

source: Go to mathematics memory activities
ar_tn: اذهب إلى أنشطة الذاكرة الحسابية
pa: ਗਣਿਤ ਮੈਮਿਊਰੀ ਕਿ੍ਆ ਤੇ ਜਾਓ
ro: Mergeți la activitățile de matematică

source: Memory activities based on operations
ar_tn: أنشطة ذاكرة تعتمد على العمليات
pa: ਮੈਮਿਊਰੀ ਕਿ੍ਆ ਆਧਾਰਿਤ ਕਿਰਿਆ ਪ੍ਣਾਲੀ
ro: Activități de memorie cu operații

source: Go to mathematics memory activities against Tux
ar_tn: اذهب إلى أنشطة الذاكرة الحسابية ضد البطريق
pa: ਟਕਸ ਦੇ ਖਿਲਾਫ ਗਣਿਤ ਮੈਮਿਊਰੀ ਕਿ੍ਆ ਤੇ ਜਾਓ
ro: Mergeți la activitățile de matematică contra Tux

source: A set of violinist Tux is shown. Each Tux has an associated sound, and each sound has a twin exactly the same. Click on a Tux to see its hidden sound, and try to match the twins. You can only activate two Tux at once, so you need to remember where a sound is, while you listen to its twin. When you turn over the twins, they both disappear.
ar_tn: يوجد مجموعة من البطاريق عازفي الكمان. كل بطريق لديه رنة و كل رنة لديها مثيلتها. انقر على بطريق لتسمع رنته و حاول إيجاد مثيلتها. بإمكانك تفعيل بطريقين فقط في آن واحد لذا عليك تذكر اﻷصوات. عندما تكشف زوجا فإنه يختفي.
pa: ਵਾਇਲਨ ਵਜਾਉਣ ਵਾਲੇ ਟਕਸ ਦਾ ਇਕ ਸਮੂਹ ਦਿਖਾਇਆ ਹੋਇਆ ਹੈ।ਹਰ ਟਕਸ ਵਿੱਚ ਅਵਾਜ਼ ਸਾਮਲ ਹੈ ਅਤੇ ਹਰ ਅਵਾਜ਼ ਆਪਣੇ ਜੋੜੇ ਨਾਲ ਮਿਲਦੀ ਹੈ।ਗੁੱਪਤ ਅਵਾਜ਼ ਦੇਖਣ ਲਈ ਟਕਸ ਨੂੰ ਦਬਾਓ ਅਤੇ ਜੋੜੇ ਨੂੰ ਮਿਲਾਉਣ ਦੀ ਕੋਸ਼ਿਸ਼ ਕਰੋ।ਤੁਸੀ ਇੱਕ ਵੇਲੇ ਦੋ ਟਕਸ ਚਲਾ ਸਕਦੇ ਹੋ,ਤਾਂ ਤੁਹਾਨੂੰ ਯਾਦ ਰਖਣਾ ਪਵੇਗਾ ਕਿ ਅਵਾਜ਼ ਕਿੱਥੋਂ ਆ ਰਹੀ ਹੈ ਜਦੋਂ ਤੁਸੀ ਇਸਦਾ ਜੋੜ ਸੁਣੋਗੇ।ਜਦੋਂ ਤੁਸੀ ਜੋੜਾ ਬੰਦ ਕਰੋਗੇ ਤਾਂ ਦੋਵੇਂ ਲੁੱਕ ਜਾਣਗੇ।

source: Audio memory game
ar_tn: لعبة الذاكرة السمعية
pa: ਅਵਾਜ਼ ਸੰਬਧੀ ਮੈਮਿਊਰੀ ਖੇਡ
ro: Joc audio de memorie

source: Click on Tux the violinist and listen to find the matching sounds
ar_tn: أنقر على البطريق عازف الكمان لتجد الأصوات المطابقة
pa: ਵਾਇਲਨ ਬਜਾਣ ਵਾਲੇ ਚਿੰੱਟੁ ਤੇ ਬਟਨ ਦਬੋ ਅਤੇ ਆਣ ਵਾਲੀ ਅਵਾਜ ਲਭਣ ਦਾ ਯਤਨ ਕਰੋ ।
ro: Faceți un click pe Tux violonistul și ascultați pentru a găsi sunete identice.

source: Mouse manipulation, Brain.
ar_tn: استعمال الفأرة، المخ
pa: ਮਾਉਸ ਦਾ ਪ੍ਯੋਗ , ਦਮਾਕ
ro: Manipularea mausului. Creier.

source: Train your audio memory and remove all the violonists Tux.
ar_tn: درب ذاكرتك السمعية و أزل كل شخصيات البطريق عازف الكمان
pa: अपनी ध्वनी ग्रहणशक्ति विकसित कर के सभी व्हायोलिन बजानेवाले चिंटू को निकाल दें.
ro: Antrenează-ți memoria auditivă și șterge toți violoniștii Tux.

source: Audio memory game against Tux
ar_tn: لعبة ذاكرة سمعية ضد البطريق
pa: ਚਿੰੱਟੁ ਦੇ ਵਿਰੁਧ ਖੇਡਨ ਲਈ ਅਵਾਜ ਸੰਬਦੀ ਭੌਤਿਕ ਖੇਡ ।
ro: Joc de memorie auditivă împotriva lui Tux

source: Play the audio memory game against Tux
ar_tn: العب نهاية مباراة الشطرنج ضد الحاسوب
pa: ਚਿੰੱਟੁ ਦੇ ਵਿਰੁਧ ਅਵਾਜ ਸੰਬਦੀ ਭੌਤਿਕ ਖੇਡ ਖੇਡੋ ।

source: Have a memory competition with Tux.
ar_tn: مباراة الذاكرة ضد البطريق
pa: ਚਿੰੱਟੁ ਦੇ ਵਿਰੁਧ ਖੇਡਨ ਢੀ ਯਾਦਾਸ਼ਤ ਪ੍ਤੀਯੋਗਿਤਾ ।
ro: Exersați-vă memoria jucându-vă cu Tux.

source: Memory Game with images, against Tux
ar_tn: لعبة ذاكرة تعتمد على الصور
pa: ਚਿੱਤਰਾਂ ਤੇ ਅਧਾਰਿਤ ਚਿੰਂਟੁ ਦੇ ਨਾਲ ਖੇਡਨ ਦੀ ਯਾਦਸ਼ਕਤੀ ਦਾ ਖੇਡ
ro: Joc de memorie cu imagini, împotriva lui Tux

source: You can see a set of cards that all look the same. Each card has a picture on the other side, and each picture has a twin somewhere in the set. You can only turn over two cards at once, so you need to remember where the pictures are until you can find the twin. When you turn over twins, they disappear! You take turns with Tux, and to win the game, you have to find more pairs of twins than he does.
ar_tn: بإمكانك رؤية بعض البطاقات و لكنك لا تستطيع رؤية ما في وجها الآخر. كل بطاقة يخفي صورة على الوجه الآخر. و كل صورة لديها توأم في مكان ما في المجموعة. بإمكانك قلب بطاقتين فقط بنفس الوقت، لذا أنت بحاجة أن تذكر أين هي الصور إلى أن تجد التوأم. عندما تجد التوأم، سوف تختفي البطاقات. تناوب مع البطريق و لتربح اللعبة، عليك أن تجد توائم أكثر من اللتي يجدها البطريق
pa: ਤੁਸੀ ਇੱਕੋ ਜਿਹੀ ਕਾਰਡਾਂ ਦਾ ਸਮੂਹ ਦੇਖ ਸਕਦੇ ਹੋਂ ਹਰਇੱਕ ਕਾਰਡ ਦੇ ਦੁੱਜੇ ਹਿੱਸੇ ਉੱਤੇ ਇੱਕ ਚਿੱਤਰ ਹੈ ਹਰਇੱਕ ਚਿੱਤਰ ਨਾਲ ਰਲਦਾ ਹੋਇਆ ਦੁਜਾ ਚਿੱਤਰ ਇਸੈ ਸਮੂਹ ਵਿੱਚ ਹੈ । ਇੱਕ ਵਾਰ ਵਿੱਚ ਤੁਸੀ ਦੋ ਕਾਰਡ ਪਲਟ ਕੇ ਦੇਖ ਸਕਦੇ ਹੋ । ਇਸ ਲਈ ਜਦੋਂ ਤੱਕ ਜੁਢਵਾਂ ਕਾਰਡ ਨਹੀ ਮਿਲਦੇ ਤਦ ਤੱਕ ਇਹ ਚਿੱਤਰ ਕਿੱਥੇ ਹੈ ਇਹ ਯਾਦ ਰਖਨਾ ਜਰੂਰੀ ਹੈ । ਜਦੋਂ ਤੁਸੀ ਇਕੋਜੀਹੇ ਕਾਰਡ ਲਭ ਲੈਂਦੇ ਹੋ ਤਾ ਉਹ ਅਦਿ੍ਸ਼ ਹੋ ਜਾੰਦੇ ਹਨ । ਤੁਹਾਡੇ ਨਾਲ ਚਿੰੱਟੁ ਵੀ ਇਹ ਕਾਰਡ ਪਲਟਦਾ ਹੈ ਇਸ ਲਈ ਜੇ ਤੁਸੀ ਚਿੰੱਟੁ ਤੇ ਵੱਧ ਕਾਰਡ ਜੋੜੇ ਤਂ ਤੂਸੀ ਇਹ ਖੇਡ ਜਿੱਤ ਲਿਆ ।
ro: Aveți un set de cărți, care toate arată identic. Fiecare carte are o imagine pe partea cealaltă și fiecare imagine are o pereche undeva în set. Puteți întoarce numai două cărți odată, deci va trebui să memorați unde sunt imaginile, până nu găsiți perechea. Când întoarceți perechea, cărțile dispar! Dacă vreți să câștigați jocul, va trebui să găsiți mai multe perechi decât Tux.

source: GCompris Main Menu
ar_tn: قائمة الإختيارات الرئيسية لجكومبري
pa: ਜੀਕਮਪ੍ਿਸ ਮੈਨ ਸਿਨੁ
ro: Meniul principal

source: GCompris is a collection of educational games that provides different activities for children aged 2 and up.
ar_tn: جكومبري لعبة تربوية تحتوي على مجموعة من الأنشطة مناسبة لأطفال سنهم عامين فما فوق
pa: ਜੀਕਮਪ੍ਿਸ ਇਕ ਸਿਕਸ਼ਕ ਖੇਲਾਂ ਦਾ ਸਮੂਹ ਹੈ ਅਤੇ 2 ਯਾ 2 ਤੋਂ ਵਧ ਉਮਰ ਦੇ ਬਚਿਆਂ ਲਈ ਵੱਖ ਵੱਖ ਕਿਰਿਆਵਾਂ ਰਖਦਾ ਹੈ ।
ro: GCompris este o colecție de jocuri educaționale care oferă diverse activități pentru copiii de 2 ani și peste.

source: Miscellaneous activities
ar_tn: أنشطة متعددة
pa: ਬਹੁਮੁੱਖੀ ਕੀਰਿਆਵਾਂ
ro: Diverse activități

source: Time, Geography, ...
ar_tn: وقت، جغرافيا
pa: ਸਮਾਂ,ਭੁਗੋਲ , . . .
ro: Timp, Geografie, ..

source: An object is displayed in the main area, and an incomplete word is printed under the picture. Select the missing letter to complete the word.
ar_tn: سيتم عرض صورة على الشاشة و كلمة ناقصة أسفل هاته الصورة, عليك اختيار الحرف الناقص لإكمال الكلمة
pa: ਮੁੱਖ ਵਿਭਾਗ ਵਿੱਚੋਂ ਇੱਕ ਵਸਤੂ ਦਿਖਾਈ ਗਈ ਹੈ ਅਤੇ ਓਸ ਵਸਤੁ ਦੇ ਨਿਚੇ ਅਧੁਰਾ ਸ਼ਬਦ ਲਿੱਖਿਆ ਹੇਇਆ ਹੈ ਇਸ ਸ਼ਬਦ ਨੂੰ ਪੁਰਾ ਕਰਨ ਲਈ ਗੁਮਿਆ ਅੱਖਰ ਲਭੋ ।

source: Fill in the missing letter
ar_tn: جد الحرف الناقص
pa: ਗੁਮਿਆ ਅੱਖਰ ਭਰੋ ।
ro: Completează litera lipsă

source: Missing Letter
ar_tn: الحرف الناقص
pa: ਗੁਮਿਆ ਅੱਖਰ ।
ro: Litera lipsă

source: Training reading skills
ar_tn: مهارات القراءة
pa: ਪਡਨ ਦਾ ਅਭਿਆਸ ।

source: Word reading
ar_tn: قراءة الكلمات
pa: ਅੱਖਰ ਪਡੋ ।
ro: Citirea cuvintelor

source: apple/_pple/a/i/o
ar_tn: تفاحة/_فاحة/ت/ب/ر
pa: ਸੈਬ /-ਬ/ਸੈ/ਲੈ/ਪੈ
ro: măr/_ăr/m/p/n

source: apple/app_e/l/h/n
ar_tn: تفاحة/ت_احة/ف/ر/ب
pa: ਸੈਬ /ਸੈ-/ਨ/ਕ/ਬ ।
ro: măr/mă_/r/p/n

source: apple/appl_/e/h/a
ar_tn: تفاحة/تفا_ة/ح/ج/ه
pa: ਸੈਬ /-ਬ/ਸੈ/ਲੈ/ਪੈ
ro: măr/m_r/ă/a/o

source: ball/_all/b/p/d
ar_tn: كرة/كر_/ة/ف/د
pa: ਗੈਂਦ /-ਦ/ਸ/ਗੈ/ਕ
ro: minge/_inge/m/n/d

source: ball/b_ll/a/u/o
ar_tn: كرة/ك_ة/ر/س/و
pa: ਸੈਬ /-ਗੈ/ਦ/ਡ/ਚ
ro: minge/m_nge/i/o/u

source: ball/bal_/l/h/s
ar_tn: كرة/كر_/ة/م/ض
pa: ਸੈਬ /-ਦ/ਸ/ਗੈ/ਕ
ro: minge/min_e/g/t/r

source: banana/_anana/b/p/d
ar_tn: موزة/_وزة/م/ف/ل
pa: ਕੇਲਾ/-ਲਾ/ਕੇ/ਲੇ/ਪ
ro: banană/_anană/b/p/d

source: banana/b_nana/a/o/i
ar_tn: موزة/مو_ة/ز/ب/ر
pa: ਕੇਲਾ/-ਕੇ/ਕ/ਸ/ਲਾ।
ro: banană/b_nană/a/o/i

source: banana/ba_ana/n/m/b
ar_tn: موزة/موز_/ة/ت/د
pa: ਕੇਲਾ/-ਲਾ/ਕੇ/ਲੇ/ਪ
ro: banană/ba_ană/n/m/b

source: bed/_ed/b/l/f
ar_tn: سرير/_رير/س/ح/ج
pa: ਪਲਂਗ /-ਲਂਗ/ਪ/ਮ/ਗਾ
ro: pat/_at/p/t/s

source: bed/b_d/e/a/i
ar_tn: سرير/س_ير/ر/ب/ؤ
pa: ਪਲਂਗ/ਪ-ਗ/ਲਂ/ਡ/ਪ
ro: pat/p_t/a/i/o

source: bed/be_/d/p/b
ar_tn: سرير/سر_ر/ي/د/ب
pa: ਪਲਂਗ/ਪਲ-/ਪ/ਮ/ਗ
ro: pat/pa_/t/d/p

source: bottle/_ottle/b/t/p
ar_tn: زجاجة/_جاجة/ز/د/ر
pa: ਬੋਤਲ/-ਤਲ/ਬੋ/ਕਾ/ਵਾ
ro: sticlă/_ticlă/s/t/p

source: bottle/b_ttle/o/u/d
ar_tn: زجاجة/ز_اجة/ج/ع/ب
pa: ਬੋਤਲ/ਬੋ-ਲ/ਤ/ਟ/ਪ
ro: sticlă/s_iclă/t/o/n

source: bottle/bott_e/l/y/r
ar_tn: زجاجة/زج_جة/ا/أ/ى
pa: ਬੋਤਲ/ ਬੋਤ-/ਪਸਲ
ro: sticlă/sti_lă/c/d/p

source: cake/_ake/c/p/d
ar_tn: كعكة/_عكة/ك/ر/ن
pa: ਕੈਕ/-ਕ/ਠੀ/ਕੇ/ਟ
ro: prăjitură/_răjitură/p/d/r

source: cake/c_ke/a/o/e
ar_tn: كعكة/ك_كة/ع/س/د
pa: ਕੈਕ/ਕੇ-/ਚਾ/ਕ/ਨ।
ro: prăjitură/pră_itură/j/ș/n

source: cake/ca_e/k/q/c
ar_tn: كعكة/كعك_/ة/ت/ص
pa: ਕੈਕ/-ਕ/ਠੀ/ਕੇ/ਟ
ro: prăjitură/prăjitu_ă/r/l/n

source: car/_ar/c/k/b
ar_tn: سيارة/_يارة/س/ط/ب
pa: ਮੋਟਰ /-ਟਾਰ/ਮੋ/ਗ/ਮ । मोटर/_टार/मो/ग/म
ro: mașină/_așină/m/n/r

source: car/c_r/a/k/o
ar_tn: سيارة/س_ارة/ي/ج/ر
pa: ਮੋਟਰ/ਮੋ-ਰ/ਟਾ/ਚਾ/ਦ
ro: mașină/ma_ină/ș/l/n

source: car/ca_/r/w/k
ar_tn: سيارة/سيا_ة/ر/ح/ص
pa: ਮੋਟਰ/ਮੋਟਾ/-/ਟ/ਦ/ਰ
ro: mașină/mași_ă/n/m/b

source: dog/_og/d/p/q
ar_tn: كلب/_لب/ك/ق/ج
pa: ਕੁੱਤਾ/-ਤਾ/ਕੁ/ਕ/ਜ
ro: câine/_âine/c/d/p

source: dog/d_g/o/g/a
ar_tn: كلب/ك_ب/ل/ت/ر
pa: ਕੁੱਤਾ/ਕੁ-/ਟਾ/ਪਾ/ਤਾ
ro: câine/câ_ne/i/p/o

source: dog/do_/g/p/q
ar_tn: كلب/كل_/ب/م/ت
pa: ਕੁੱਤਾ/-ਤਾ/ਕੁ/ਕ/ਜ
ro: câine/câin_/e/o/a

source: fish/_ish/f/h/l
ar_tn: سمكة/_مكة/س/ر/ن
pa: ਮਛਲੀ /-ਛਲੀ/ਮਾ/ਛ/ਸ
ro: pește/_ește/p/t/f

source: fish/f_sh/i/u/l
ar_tn: سمكة/س_كة/م/ر/غ
pa: ਮਛਲੀ/ਮ-ਲੀ/ਸ਼/ਛ/ਮ
ro: pește/pe_te/ș/p/s

source: fish/fis_/h/o/i
ar_tn: سمكة/سم_ة/ك/ر/ن
pa: ਮਛਲੀ/ਮਛ-/ਸਾ/ਮਾ/ਲੀ
ro: pește/peșt_/e/o/u

source: house/_ouse/h/e/j
ar_tn: منزل/_نزل/م/ع/خ
pa: ਘਰ/-ਰ/ਮਾ/ਜ/ਥ
ro: casă/_asă/c/m/r

source: house/h_use/o/f/u
ar_tn: منزل/م_زل/ن/ت/ق
pa: ਘਰ/-ਘ/ਸਾ/ਰ/ਨ
ro: casă/c_să/a/o/u

source: house/hous_/e/a/i
ar_tn: منزل/منز_/ل/ه/ر
pa: ਘਰ/-ਰ/ਮਾ/ਜ/ਧ
ro: casă/ca_ă/s/t/r

source: plane/_lane/p/g/d
ar_tn: طائرة/_ائرة/ط/ف/س
pa: ਹਵਾਈ ਜਹਾਜ /-ਵਾਈ-ਹਾਜ/ਹਾ/ਹ/ਜ
ro: avion/_vion/a/o/u

source: plane/p_ane/l/j/i
ar_tn: طائرة/طا_رة/ئ/ك/ن
pa: ਹਵਾਈ ਜਹਾਜ/ਹ-ਈ ਜ-ਜ/ਵਾ/ਹਾ/ਜ
ro: avion/a_ion/v/x/r

source: plane/pl_ne/a/o/s
ar_tn: طائرة/طائ_ة/ر/س/ش
pa: ਹਵਾਈ ਜਹਾਜ/ਹਵਾ-ਜਹਾ-/ਈ/ਹਾ/ਜ
ro: avion/avi_n/o/u/a

source: satchel/_atchel/s/c/l
ar_tn: محفظة/_حفظة/م/س/ل
pa: ਥੈਲਾ/ਥੈ-/ਸਾ/ਲਾ/ਵਿ
ro: geantă/_eantă/g/r/l

source: satchel/s_tchel/a/o/i
ar_tn: محفظة/م_فظة/ح/ج/خ
pa: ਥੈਲਾ/-ਲਾ/ਥੈ/ਲਾ/ਸਾ।
ro: geantă/gea_tă/n/m/l

source: satchel/sa_chel/t/p/c
ar_tn: محفظة/محف_ة/ظ/ض/ر
pa: ਥੈਲਾ/ਥੈ-/ਸਾ/ਲਾ/ਵਿ
ro: geantă/gean_ă/t/p/r

source: Can count
ar_tn: تعلم الحساب
pa: ਗਿਣਤੀ ਕਰ ਸਕਦੇ ਹਾਂ
ro: Pot număra

source: Click on the coins or paper money at the bottom of the screen to pay. If you want to remove a coin or note, click on it on the upper screen area.
ar_tn: انقر على القطع أو الأوراق النقدية الموجودة في أسفل الشاشة كي تدفع الثمن. إذا أردت إزالة قطعة أو ورقة نقدية انقر عليها في الجزء العلوي للشاشة.
pa: ਖੇਡ ਖੇਡਨ ਲਈ ਸਕਿ੍ਨ ਦੇ ਨਿਚੇ ਦਿੱਤੇ ਗਏ ਸਿੱਕਿਆ ਜਾਂ ਨੋਟਾਂ ਤੇ ਮਾਊਸ ਦਾ ਬਟਨ ਦਬਾਓ ,ਜੇਕਰ ਸਿੱਕਾ ਜਾਂ ਨੋਟ ਕਡਨਾ ਹੈ ਤਾਂ ਸਕਿ੍ਨ ਦੇ ਉੱਤੇ ਹਿਸੇ ਤੇ ਬਟਨ ਦਬੋ ।
ro: Faceți un click pe monede sau bancnote în partea de jos a ecranului, pentru a plăti. Dacă vreți să eliminați o monedă su o bancnotă, faceți un click în partea de sus a ecranului.

source: Money
ar_tn: نقود
pa: ਰੁਪਿਆ - ਪੈਸਾ
ro: Bani

source: Practice money usage
ar_tn: تعلم استعمال النقود
pa: ਪੈਸਾ ਵਰਤਨ ਦਾ ਅਭਿਆਸ
ro: Exersează folosirea banilor

source: You must buy the different items and give the exact price. At higher levels, several items are displayed, and you must first calculate the total price.
ar_tn: عليك أن تشتري السلع المعروضة و أن تدفع الثمن الصحيح كاملا. في المستويات المتقدمة, يتم عرض مجموعة من السلع في نفس الوقت و عليك أن تحسب الثمن الجملي لتدفعه.
pa: ਤੁਹਾਨੂੰ ਅਨੇਕ ਵਸਤੂਆ ਖਰਿਦਨੀਆਂ ਚਾਹਿਦਿਆਂ ਹਨ ਅਤੇ ਓਹਨਾਂ ਦਾ ਸਹੀ ਮੁੱਲ ਦੇਨਾ ਚਾਹਿਦਾ ਹੈ । । ਉੱਤੇ ਕੁਜ ਵਸਤੂਆ ਦਖਾਇਆਂ ਗਇਆ ਹਨ ਅਤੇ ਸਭ ਤੋਂ ਪਹਿਲਾਂ ਤੁਹਾਨੂੰ ਇਹਨਾਂ ਦੀ ਕੁਲ ਕਿਮਤ ਕਡਨੀ ਹੈ ।
ro: Trebuie să cumperi diverse obiecte și să plătești prețul exact. La nivele mai mari, câteva obiecte sunt afișate, iar tu trebuie să calculezi mai întâi prețul corect.

source: Practice money usage including cents
ar_tn: تعلم استعمال النقود بما في ذلك القطع المعدنية
pa: ਸਿੱਕਿਆ ਦੇ ਨਾਲ ਪੈਸਾ ਵਰਤਨ ਦਾ ਅਭਿਆਸ ਕਰੋ ।
ro: Exersează folosirea banilor incluzând cenți

source: Rebuild the mosaic
ar_tn: أعد تجميع الفسيفساء
pa: ਦੁਬਾਰਾ ਪਚੀਕਾਰੀ ਬਨਾਓ ।
ro: Reconstruiește mozaicul

source: Mouse-manipulation activities.
ar_tn: استعمال الفأرة
pa: ਮਾਓਸ ਵਰਤਨ ਕਿਰਿਆਵਾਂ ।
ro: Activități de manipulare a mausului.

source: Various mouse-based activities (clicking, moving)
ar_tn: أنشطة مختلفة لاستعمال الفأرة (نقر, تحريك)
pa: ਮਾਓਸ ਤੇ ਅਧਾਰਿਤ ਕਿਰਿਆਵਾਂ (ਦਬੋ,ਹਿਲਾਓ । )
ro: Activităti diferite cu șoricelul (click, mișcare).

source: Numeration
ar_tn: تدرب على الإحصاء
pa: ਸਖਿੱਆਤਮਕ
ro: Numărare

source: Numeration activities.
ar_tn: تدرب على الإحصاء
pa: ਸਖਿੱਆਤਮਕ ਕਿਰਿਆਵਾਂ ।
ro: Activități de numărare.

source: Assemble the puzzle
ar_tn: جمع اللغز
pa: ਬੁਝਾਰਤ ਨੂੰ ਕਠੇ ਕਰੋ ।
ro: Rezolvă puzzle-ul

source: Drag and Drop the items to rebuild the original paintings
ar_tn: أمسك و اسحب القطع لتعيد الرسم كاملا
pa: ਅਸਲੀ ਚਿੱਤਰਨੂੰ ਬਨਾਨ ਲਈ ਇਸ ਦਿਆ ਵਸਤੂਆਂ ਨੂੰ ਖਿੱਚ ਕੇ ਪਾਓ ।
ro: Trageți și plasați elementele pentru a reconstrui picturile originale

source: Drag the image parts from the box on the left to create a painting on the main board.
ar_tn: اسحب قطع الصورة من العلبة اليسرى إلى اللوحة الرئيسية لتكمل الصورة
pa: ਮੁੱਖ ਬੋਰਡ ਤੇ ਚਿੱਤਰ ਬਨਾਨ ਲਈ ਖੱਬੇ ਪਏ ਬਕਸੇ ਵਿੱਚੋ ਚਿੱਤਰ ਦੇ ਹਿਸਿਆ ਨੂੰ ਖਿੱਚੋ ।
ro: Trageți părțile imaginii din stânga, pentru a forma imaginea pe table principală.

source: Mouse-manipulation: movement, drag and drop
ar_tn: استعمال الفأرة: تحرك, أمسك و اسحب
pa: ਮਾਓਸ ਵਰਤੋ ਹਲਾਓ,ਖਿੱਚ ਕੇ ਪਾਓ ।
ro: Manipularea mausului: mișcare, trage și lasă

source: Spatial representation
ar_tn: التمثيل الفضائي
pa: ਸਥਲ ਵਰਨਨ ।
ro: Reprezentare spațială

source: Edgar Degas, The Dancing Class - 1873-75
pa: ਏਜਰ ਡਿਗਾਸ,ਨੱਚ ਵਿਭਾਗ 1873-75
ro: Copy text Edgar Degas, Clasa de dans - 1873-75

source: Pierre-Auguste Renoir, Le Moulin de la Galette - 1876
pa: ਪੈਰੀ ਆਗਸਟੀ ਰਿਨਾਇਰ , ਲੀ ਮੋਲਿਨ ਡੀ ਲਾ ਗੈਲੇਟ - 1876

source: Pierre-Auguste Renoir, Girls At The Piano - 1892
pa: ਪੈਰੀ ਆਗਸਟੀ ਰਿਨਾਇਰ , ਪਿਆਨੋ ਦੇ ਨੇੜੇ ਦੀ ਕੁੜੀ ।
ro: Pierre-Auguste Renoir, Fete la pian - 1892

source: Kandinsky, Wassily, Composition VIII - 1923
pa: ਕਨਡੀਨਸਕੀ , ਵੈਸਿਲੀ,ਕਮਪੋਜਿਸ਼ਨ 8-1923 ।
ro: Kandinsky, Wassily, Compunere VIII - 1923

source: Oil on canvas, 140 x 201 cm; Solomon R. Guggenheim Museum, New York
pa: ਕਨਵਾਸ ਤੇਲ , 140*201 ਸੇ ਮੀ.ਸੋਲੋਮਨ ਆਰ. ਗੁਗਨੇਇਨਿਮ ਸਗ੍ਹਾਲਯ,ਨਯੂ ਯਾਰਕ ।
ro: Ulei pe pânză, 140 x 201 cm; Solomon R. Guggenheim Museum, New York

source: Bazille, The Ramparts at Aigues-Mortes - 1867
pa: ਬਾਜਿਲੇ , ਆਗਯੁਸ - ਮੋਟ੍ਸ ਇੱਥੋ ਦਾ ਰੈਮਪਾਟਸ । -1867
ro: Bazille, The Ramparts la Aigues-Mortes - 1867

source: Cassatt, Mary - Summertime - 1894
pa: ਕੈਸੇਟ,ਮੇਰੀ ਗੀ੍ਸ਼ਮਕਾਲ - 1894 ।
ro: Cassatt, Mary - Vara anului - 1894

source: Vincent Van Gogh, Village Street in Auvers - 1890
pa: ਵਿਸੈਂਟ ਵੈਨ ਗੋ ,ਔਵਰਸ ਦੇ ਪਿੰਡ ਦਾ ਰਾਸਤਾ -1890 ।
ro: Vincent Van Gogh, Uliță de sat în Auvers - 1890

source: Help Tux the parachutist land safely
ar_tn: ساعد البطريق المظلي على الهبوط بأمان
pa: ਪੈਰਾਸ਼ੂਟਧਾਰੀ ਟਕਸ ਨੂੰ ਸਹੀ ਨੀਚੇ ਓਤਾਰਨ ਵਿੱਚ ਮਦਦ ਕਰੇ ।
ro: Ajutați parașutistului Tux să aterizeze

source: Hit any key or click on the plane to make Tux jump. Hit another key or click on Tux to open the parachute.
ar_tn: انقر زرا أو انقر على الطائرة ليقفز البطريق, انقر ثانية لتفتح المظلة
pa: ਟਕਸ ਨੂੰ ਭਜਾਨ ਲਈ ਕਿ ਬੋਰਡ ਦਾ ਕੋਈ ਵੀ ਬਟਨ ਦਬੋ ਅਤੇ ਹਵਾਈ ਜਹਾਜ ਤੇ ਮਾਓਸ ਦਬੋ ।ਪੈਰਾਸ਼ੂਟ ਖੇਡਨ ਲਈ ਕਿ ਬੋਰਡ ਦਾ ਦੁਸਰਾ ਬਟਨ ਦਬਾਓ ਯਾ ਟਕਸ ਤੇ ਮਾਓਸ ਦਾ ਬਟਨ ਦਬੋ ।
ro: Tastați orice tastă sau faceți un click pe avion pentru a-l face pe Tux să sară. Tastați altă tasta sau faceți un click pe Tux pentru a descide parașuta.

source: Parachutist
ar_tn: مظّليْ
pa: ਪੈਰਾਸ਼ੂਟ ਪਾਓ ।
ro: Parașutistul

source: This board is game-oriented. No specific skills are needed to play.
ar_tn: إن اللوح معد للعب. لا توجد هناك خبرات معينة ضرورية للعب
pa: ਇਹ ਬੋਰਡ ਖੇਡਨ ਲਈ ਬਨਾਇਆ ਹੈ । ਖੇਡਨ ਲਈ ਕੋਈ ਖਾਸ ਹੁਨਰ ਦੀ ਲੋੜ ਨਹੀ ।
ro: Tabla este orientată înspre jocuri. Nu este nevoie de abilități specifice pentru a juca.

source: Catch the numbers in increasing order, using the up, down, right and left arrows on the keyboard to move the helicopter.
ar_tn: أمسك اأرقام بالترتيب المتصاعد، مستخدماً الأسهم المتجهة للأعلى، و للأسفل، لليمين و لليسار من لوحة المفاتيح لكي تحرك طائرة الهليكوبتر
pa: ਹੈਲਿਕਾਪਟਰ ਚਲਾਨ ਲਈ ਕੀ ਬੋਰਡ ਦੀ ਓਪਰ,ਨੀਚੇ,ਸੱਜੇ , ਖੱਬੋ ਤੀਰਾਂ ਵਾਲੇ ਬਟਨਾਂ ਨਾਲ ਚੜਦੀ ਕ੍ਮ ਸਖਿਆ ਫੜੋ ।
ro: Prinde numerele în ordinea crescătoare, folosind săgețile sus, jos, stânga, dreapta pentru a mișca elicopterul.

source: Move the helicopter to catch the clouds in the correct order
ar_tn: حرك الطائرة العمودية لتمسك بالسحاب حسب الترتيب الصحيح
pa: ਬਦਲਾਂ ਨੂੰ ਸਹੀ ਕ੍ਮ ਵਿੱਚ ਫੜਨ ਲਈ ਹੈਲਿਕਾਪਟਰ ਨੂੰ ਚਲਾਓ ।
ro: Mutați elicopterul pentru a prinde norii în ordinea corectă

source: Number
ar_tn: عدد
pa: संख्या
ro: Număr

source: Numbers in Order
ar_tn: الأعداد مرتبة
pa: ਕ੍ਮ ਵਿੱਚ ਸੰਖਿਆ ।
ro: Numere în ordine

source: Puzzles
ar_tn: ألغاز
pa: ਪਹੇਲੀ
ro: Încurcături.

source: Various puzzles.
ar_tn: ألغاز متعددة
pa: ਵਿਵਿਧ ਪਹੇਲੀਆਂ ।
ro: Încurcături diferite.

source: Advanced Python Programmer :)
ar_tn: مبرمج بايثون متعمّق
pa: ਆਧੁਨਿਕ ਪਾਇਧਨ ਪੋ੍ਗਾ੍ਮਰ । :)
ro: Programator Avansat de Python :)

source: Thanks to Guido van Rossum and the python team for this powerful language!
ar_tn: شكراً لجيدو فان روسم فريق البايثون على هذه اللغة القويّة
pa: ਇਸ ਜਿਹੀ ਪ੍ਭਾਵਸ਼ਾਲੀ ਭਾਸ਼ਾ ਬਨਾਨਲਈ ਗੁਇਡੇ ਵੈਨ ਰੋਜਮ ਅਤੇ ਪਾਇਥਨ ਨੂੰ ਧੰਨਵਾਦ ।
ro: Mulțumiri lui Guido van Rossum și echipei python pentru acest limbaj remarcabil!

source: Python Test
ar_tn: اختبار البايثون
pa: ਪਾਇਧਨ ਦੀ ਿਪ੍ਖੀਆ ।
ro: Test Python

source: Test board for the python plugin
ar_tn: لوحة اختبار ملحق بايثون
pa: ਪਾਇਧਨ ਪਲਗਇਨ ਲਈ ਬੋਰਡ ਨੂੰ ਜਾਂਚ ਲਓ ।
ro: Tabela de test pentru plugin-urile python.

source: A memory game based on trains
ar_tn: لعبة ذاكرة تعتمد على القطارات
pa: ਰੇਲਗਡੀ ਤੇ ਅਧਾਰਿਤਭੋਤਿਕ ਖੇਡ ।
ro: Un joc de memorie cu trenuri

source: A train - a locomotive and carriage(s) - is displayed at the top of the main area for a few seconds. Rebuild it at the top of the screen by selecting the appropriate carriages and locomotive. Deselect an item by clicking on it again. Check your construction by clicking on the hand at the bottom.
pa: ਕੁੱਝ ਸੈਕਿੰਟਾਂ ਦੇ ਲਈ ਸਭ ਤੋ ਉੱਤੇ ਮੁੱਖ ਖੇਤਰ ਦੇ ਵਿੱਚ ਇੱਕ ਟੇ੍ਠ ਦਿਖਾਈ ਦਿੰਦੀ ਹੈ।ਢੁਕਵੇਂ ਕੈਰੀਏਜਸ ਅਤੇ ਲੋਕੋਮੋਟਿਵ ਨੂੰ ਚੁਣ ਕੇ ਸਕਰੀਨ ਦੇ ਸਡ ਤੌਂ ਉੱਪਰ ਇਸਠੂੰ ਦੁਬਾਰਾ ਬਣਾਉ।ਇਸਠੂੰ ਦੁਬਾਰਾ ਕਲਿੱਕ ਕਰਕੇ ਅਣ-ਚੁਣਵਾਂ ਕਰੌ।ਆਪਣੀ ਬਣਾਵਟ ਦੀ ਸਭ ਤੌ ਥੱਲੇ ਹੱਥ ਤੇ ਕਲਿੱਕ ਕਰਕੇ ਜਾਂਚ ਕਰੋ।
ro: Un tren - o locomotivă și vagoane - este afișat deasupra suprafeței principale pentru câteva secunte. Reconstruiește-l în partea de sus a ecranului selectând vagoanele și locomotiva potrivite. Deselectați un obiect făcând clic pe el din nou. Verifică stadiul construcției făcând clic pe mâna din partea de jos a ecranului.

source: Memory-training
ar_tn: تدريب الذاكرة
pa: ਯਾਦਾਸਤ ਸਿਖਲ਼ਾਈ
ro: Exercițiu pentru memorie

source: Railway
ar_tn: سكة حديدية
pa: ਟੇ੍ਠ ਰਤਸਾ
ro: Șină

source: Click on the correct colored object.
ar_tn: انقر على القطعة ذات اللون المناسب
pa: ਸਹੀ ਰੰਗੀ ਵਸਤੁ ਤੋ ਕਲਿਕ ਕਰੋ।
ro: Fă clic pe obiectul colorat corect.

source: Click on the matching color
ar_tn: أنقر على اللون المناسب
pa: ਮੋਲ ਖਾਂਦੇ ਰੰਗ ਤੇ ਕਲਿਕ ਕਰੋ।
ro: Fă clic pe culorea asemanătoare

source: Read the names of colors
ar_tn: اقرأ الألوان
pa: ਰੰਗਾਂ ਦੇ ਠਾਂ ਪੜੋ।
ro: Citește numele culorilor

source: This board teaches basic colors.
ar_tn: هذه اللوحة مخصصة لقراءة الألوان البسيطة
pa: ਇਹ ਫੱਟਾ ਮੁਢਲ਼ੇ ਰੰਗਾਂ ਬਾਰੇ ਦੱਸਦਾ ਹੈ।
ro: Această tablă predă culorile de bază.

source: black
ar_tn: أسود
pa: ਪਿੱਛੇ।
ro: negru

source: blue
ar_tn: أزرق
pa: ਠੀਲੇ।
ro: albastru

source: brown
ar_tn: أسمر
pa: ਭੂਰਾभूरा रंग
ro: maro

source: green
ar_tn: أخضر
pa: ਹਰਾ
ro: verde

source: grey
ar_tn: رمادي
pa: ਸਲੇਟੀ।
ro: gri

source: orange
ar_tn: برتقالي
pa: ਸੰਤਰੀ।
ro: portocaliu

source: pink
ar_tn: وردي
pa: ਗੁਲਾਬੀ।गुलाबी रंग
ro: roz

source: red
ar_tn: أحمر
pa: ਲਾਲ
ro: roșu

source: violet
ar_tn: بنفسجي
pa: ਬੈੰਗਣੀ

source: white
ar_tn: أبيض
pa: ਸਫੈਦ।
ro: alb

source: yellow
ar_tn: أصفر
pa: ਪੀਲਾ
ro: galben

source: Go to the Reading activities
ar_tn: أنشطة القراءة
pa: ਪੜਠ ਵਾਲੀ ਰਿ੍ਆਵਾਂ ਤੇ ਜਾਉ
ro: Mergeți la activitățile de citire

source: Reading activities.
ar_tn: أنشطة القراءة
pa: ਪੜਠ ਵਾਲੀ ਰਿ੍ਆਵਾਂ
ro: Activități pentru citit.

source: A word is shown at the top right of the board. A list of words will appear and disappear on the left. Does the given word belong to the list?
ar_tn: هناك كلمة ظاهرة أعلى اللوح، علىاليمين. قائمة من الكلمات سوف تظهر على اليسار و تختفي. هل هذه الكلمة تنتمي إلى القائمة ؟
pa: ਫੱਟੇ ਦੇ ਸਭ ਤੋਂ ਉਪਰ ਸੱਜੇ ਇੱਕ ਸ਼ਬਦ ਦਿਖਾਇਆ ਗਿਆ ਹੈ।ਖੱਬੇ ਪਾਸੇ ਇੱਕ ਸ਼ਬਦਾਂ ਦੀ ਸੂਚੀ ਦਿੱਸਦੀ ਤੇ ਅਦਿੱਖ ਹੋ ਜਾਂਦੀ ਹੈ।ਕੀ ਦਿੱਤੇ ਸ਼ਬਦ ਸੂਚੀ ਠਾਲ ਮੇਲ ਖਾਂਦੇ ਹਨ।
ro: Un cuvânt este arătat sus pe tablă. O listă de cuvinte va apare și va dispare în stânga. Cuvântul dat aparține listei din stânga ?

source: Horizontal reading practice
ar_tn: ممارسة القراءة الأفقية
pa: ਖੱਬੇ ਤੋ ਸੱਜੇ ਪੜਠ ਦਾ ਅਭਿਆਸ।
ro: Exersarea citirii pe orizontală

source: Read a list of words and work out if a given word is in it
ar_tn: اقرأ قائمة من الكلمات و حدد إذا كانت كلمة معينة ضمنها
pa: ਸ਼ਬਦਾਂ ਦੀ ਇੱਕ ਸੂਚੀ ਪੜੋ ਅਤੇ ਦੱਸੋ ਜੇ ਦਿੱਤਾ ਸ਼ਬਦ ਇਜ ਵਿੱਚ ਹੈ।
ro: Citește o listă de cuvinte și descoperă dacă un cuvânt dat aparține listei

source: Reading training in a limited time
ar_tn: تدرب على القراءة في وقت محدود
pa: ਸੀਮਿਤ ਸਮੇਂ ਵਿੱਚ ਪੜਠ ਦੀ ਸਿਖਲਾਈ।
ro: Perfecționarea cititului cu limită de timp

source: Read a vertical list of words and work out if a given word is in it
ar_tn: اقرأ قائمة من الكلمات العمودية و حدد إذا كانت كلمة معينة ضمنها
pa: ਖੜੇ ਦਾਅ ਤੇ ਪਏ ਸ਼ਬਦਾਂ ਦੀ ਇੱਕ ਸੂੱਖੀ ਪੜੋ ਅਤੇ ਦੱਸੋ ਜੇ ਦਿੱਤਾ ਸ਼ਬਦ ਇਸ ਵਿੱਚ ਹੈ।
ro: Citește o listă verticală de cuvinte și descoperă dacă un cuvânt dat aparține listei

source: Read training in a limited time
ar_tn: تدرب على القراءة في وقت محدود
pa: ਸੀਮਿਤ ਸਮੇਂ ਵਿੱਚ ਪੜਠ ਦਾ ਅਭਿਆਸ।
ro: Exersarea citirii într-un timp limitat

source: Vertical-reading practice
ar_tn: ممارسة القراءة العمودية
pa: ਖੜੇ ਦਾਅ ਪੜਠ ਦਾ ਅਭਿਆਸ।
ro: Exsersează cititul pe verticală

source: Copy a drawing from the box on the right into the box on the left.
ar_tn: انسخ الصورة من العلبة اليمنى إلى العلبة اليسرى
pa: ਸੱਜੇ ਪਾਸੇ ਵਾਲੇ ਵੋਂ ਤਸਵੀਰ ਠੂੰ ਕਾਪੀ ਕਰਕ ਖਬ ਪਾਸ ਵਾਲ ਡਬ ਚ ਪਾਉ।
ro: Copie imaginea din cutia din dreapta în cutia din stânga.
