Repository: MkPereira/gcompris
Catalog: po/*.po
Languages: ar_tn, pa, ro

source: Deutschland Bundesländer
ar_tn: مناطق ألمانية
pa: ਡਚਲੈਂਡ ਬੁਡੇਸਲੈਂਡਰ
ro: Landurile din Germania

source: Counties of Norway
pa: ਕੰਟਰੀਜ਼ ਆਫ ਨਾਰਵੇ
ro: Fylker-ele din Norvegia

source: Geometry
ar_tn: الهندسة
pa: ਰੇਖਾ ਗਣਿਤ
ro: Geometria

source: Geometry activities.
ar_tn: الأنشطة الهندسية
pa: ਰੇਖਾ ਗਣਿਤ ਕਿ੍ਆਵਾਂ
ro: Mergeți la activitățile de geometrie

source: Keyboard manipulation
ar_tn: استخدام لوحة المفاتيح
pa: ਕੀਬੋਰਡ ਜੋੜ-ਤੇੜ
ro: Folosirea tastaturii

source: Letter association between the screen and the keyboard
ar_tn: التعرف على الحروف بين الشاشة و لوحة المفاتيح
pa: ਸਕਰੀਨ ਅਤੇ ਕੀਬੋਰਡ ਵਿਚ ਅੱਖਰ ਸਹਿਚਾਰਤਾ

source: Simple Letters
ar_tn: الحروف البسيطة
pa: ਸਰਲ ਅੱਖਰ
ro: Litere simple

source: Type the falling letters before they reach the ground
ar_tn: أدخل الحروف المتساقطة قبل أن تصل إلى الأرض
pa: ਨੀਚੇ ਦਿੱਤੇ ਅੱਖਰਾਂ ਨੂੰ ਜਮੀਨ ਤੇ ਪਹੁੰਚਣ ਤੋਂ ਪਹਿਲਾਂ ਲਿੱਖੋ
ro: Tastați literele căzătoare înainte de a atinge pământul

source: Equality Number Munchers
ar_tn: قاضم الأرقام المتساوية
pa: ਸਮਾਨ ਨੰਬਰ ਮੰਚਰ

source: Guide the Number Muncher to the expressions that equal the number at the top of the screen.
ar_tn: وجه قاضم الأرقام إلى العبارات المعادلة للرقم في أعلى الشاشة.
pa: ਸਕਰੀਨ ਦੇ ਉਪਰਲੇ ਪਾਸੇ ਜਿਹੜਾ ਨੰਬਰ ਹੈ ਉਸਦੇ ਬਰਾਬਰ ਦਾ ਨੰਬਰ ਨੰਬਰ ਮੰਚਰ ਨੂੰ ਦੱਸੋ

source: Practice addition, multiplication, division and subtraction.
ar_tn: تدرب على عمليات الجمع ، و الضرب ،و القسمة ، و الطرح
pa: ਜੋੜ,ਗੁਣਾ,ਭਾਗ ਅਤੇ ਘਟਾਓ ਦਾ ਅਭਿਆਸ ਕਰੋ
ro: Exersați operațiile de adunare, înmulțire, împărțire și scădere

source: Use the arrow keys to navigate around the board and to avoid the Troggles. Press the spacebar to eat a number.
ar_tn: استخدم مفاتيح الأسهم للتجوال حول اللوح و لجتنب ال Troggles. اضغط مفتاح المساحة لالتهام رقم.
pa: ਬੋਰਡ ਦੇ ਆਲੈ-ਦੁਆਲੈ ਮਾਰਗ ਨਿਰਦੇਸ਼ ਕਰਨ ਲਈ ਅਤੇ ਟੋ੍ਗਲ ਤੋਂ ਬਚਣ ਲਈ ਤੀਰ ਬਟਨ ਦੱਬੋ।ਸਪੇਸਬਾਰ ਨੂੰ ਨੰਬਰ ਪਾਓਣ ਲਈ ਦਬਾਓ
ro: Folosiți săgețile pentru navigarea în jurul tablei și evitați-l pe Troggles. Tastați tasta 'spațiu' pentru a mânca un număr.

source: Factor Number Munchers
ar_tn: قاسم قاضم الأرقام
pa: ਗੁਣਕ ਨੰਬਰ ਮੰਚਰ

source: Guide the Number Muncher to all the factors of the number at the top of the screen.
ar_tn: وجه قاضم الأرقام إلى كل قواسم هذا الرقم في أعلى الشاشة
pa: ਸਕਰੀਨ ਦੇ ਉਪਰਲੇ ਪਾਸੇ ਜਿਹੜਾ ਨੰਬਰ ਹੈ ਉਸਦੇ ਸਾਰੇ ਗੁਣਕ ਨੰਬਰ ਮੰਚਰ ਨੂੰ ਦੱਸੋ

source: Learn about factors and multiples.
ar_tn: تعلم القواسم و المضاعفات.
pa: ਗੁਣਕ ਅਤੇ ਗੁਣਜ ਸਿੱਖੋ
ro: Învață despre factori și multiplii.

source: The factors of a number are all the numbers that divide that number evenly. For example, the factors of 6 are 1, 2, 3 and 6. 4 is not a factor of 6 because 6 cannot be divided into 4 equal pieces. If one number is a multiple of a second number, then the second number is a factor of the first number. You can think of multiples as families, and factors are the people in those families. So 1, 2, 3 and 6 all fit into the 6 family, but 4 belongs to another family. Use the arrow keys to navigate around the board and to avoid the Troggles. Press the spacebar to eat a number.
ar_tn: إن قواسم الرقم هي كل الأرقام التي تقسم ذلك الرقم . مثال، إن قواسم 6 هي 3،2،1 و 6. إن الرقم 4 ليس من قواسم 6. لأن 6 لا يمكن تقسيمها إلى أربعة أجزاء متساوية. إذا كان أحد الأرقام من مضاعفات رقم آخر فإن هذا الرقم الآخر هو قاسم للرقم الأول. يمكنك أن تشبّه المضاعفات بالعائلات و القواسم بالأفراد في هذه العائلات. فإذاً، 3،2،1 و 6 جميعها في عائلة ال6 لكن 4 تنتمي إلى عائلة أخرى. استخدم مفاتيح الأسهم للتجوال حول اللوح ولتجنّب ال Troggles. اضغط مفتاح المساحة لالتهام رقم.
pa: ਕਿਸੇ ਅੰਕ ਦੀ ਗੁਣਕ,ਉਹ ਸਾਰੇ ਅੰਕ ਹਨ ਜੋ ਉਸ ਅੰਕ ਨੂੰ ਜੋਟੇ ਵਿੱਚ ਭਾਗ ਕਰਦੇ ਹਨ।ਜਿਵੇਂ ਕਿ 6 ਦੇ ਗੁਣਕ ਹਨ 1,2,3 ਅਤੇ 6। 4 6 ਦਾ ਗੁਣਕ ਨਹੀਂ ਹੈ ਕਿਊਂਕਿ 6,4 ਬਰਾਬਰ ਭਾਗਾਂ ਵਿਚ ਨਹੀਂ ਵੰਡਿਆ ਜਾਂਦਾ । ਜੇਕਰ ਪਹਿਲਾ ਅੰਕ ਦੂਜੇ ਦਾ ਗੁਣਜ ਹੈ, ਫੇਰ ਦੂਜਾ ਅੰਕ ਪਹਿਲੇ ਦਾ ਗੁਣਕ ਹੋਵੇਗਾ । ਤੁਸੀ ਗੁਣਜ ਨੂੰ ਪਰਿਵਾਰ ਦੇ ਰੂਪ ਵਿਚ ਸੋਚ ਸਕਦੇ ਹੋ ਅਤੇ ਗੁਣਕ ਇਸ ਪਰਿਵਾਰ ਦੇ ਹਿੱਸੇ ਹਨ ਤਾਂ 1,2,3 ਅਤੇ 6,6 ਪਰਿਵਾਰ ਵਿਚ ਠੀਕ ਹਨ,ਪਰ 4 ਹੋਰ ਪਰਿਵਾਰ ਦਾ ਹੈ।ਬੋਰਡ ਦੇ ਆਲੈ-ਦੁਆਲੈ ਮਾਰਗ ਨਿਰਦੇਸ਼ ਕਰਨ ਲਈ ਅਤੇ ਟੋ੍ਗਲ ਤੋਂ ਬਚਣ ਲਈ ਤੀਰ ਬਟਨ ਦੱਬੋ। ਨੰਬਰ ਖਾਣ ਲਈ ਸਪੇਸਬਾਰ ਨੂੰ ਦੱਬੋ

source: Guide the Number Muncher to the all the expressions that do not equal the number at the top of the screen.
ar_tn: وجه قاضم الأرقام إلى العبارات التي لا تساوي الرقم في أعلى الشاشة.
pa: ਸਕਰੀਨ ਦੇ ਉਪਰਲੇ ਪਾਸੇ ਜਿਹੜਾ ਨੰਬਰ ਹੈ, ਉਸ ਨਾਲ ਨਾ ਰਲਣ ਵਾਲੇ ਨੰਬਰ, ਨੰਬਰ ਮੰਚਰ ਨੂੰ ਦੱਸੋ

source: Inequality Number Munchers
ar_tn: أرقام قاضم غير المتساوية
pa: ਨੰਬਰ ਮੰਚਰ ਦੀ ਅਸਮਾਨਤਾ

source: Practice addition, subtraction, multiplication and division.
ar_tn: تدرب على عملية الضرب و الطرح و القسمة
pa: ਜੋੜ,ਗੁਣਾ,ਭਾਗ ਅਤੇ ਘਟਾਓ ਦਾ ਅਭਿਆਸ ਕਰੋ
ro: Exersează adunarea, scaderea, înmulțirea și împărțirea.

source: Guide the Number Muncher to all the multiples of the number at the top of the screen.
ar_tn: وجه قاضم الأرقام إلى كل مضاعفات هذا الرقم في أعلى الشاشة.
pa: ਸਕਰੀਨ ਦੇ ਉਪਰਲੇ ਪਾਸੇ ਜਿਹੜਾ ਨੰਬਰ ਹੈ,ਉਸਦੇ ਗੁਣਜ ਨੰਬਰ ਮੰਚਰ ਨੂੰ ਦੱਸੋ

source: Learn about multiples and factors.
ar_tn: تعلم المضاعفات و القواسم.
pa: ਗੁਣਜ ਅਤੇ ਗੁਣਕ ਸਿੱਖੋ
ro: Învață despre multiplii și factori.

source: Multiple Number Munchers
ar_tn: مضاعف قاضم.
pa: ਗੁਣਜ ਨੰਬਰ ਮੰਚਰ

source: The multiples of a number are all the numbers that are equal to the original number times another number. For example, 24, 36, 48 and 60 are all multiples of 12. 25 is not a multiple of 12 because there isn't any number that can be multiplied by 12 to get 25. If one number is a factor of a second number, then the second number is a multiple of the first number. Again, you can think of multiples as families, and factors are the people who belong to those families. The factor 5, has parents 10, grandparents 15, great-grandparents 20, great-great-grandparents 25, and every extra step of 5 is another great- in front! But the number 5 does not belong in the 8 or 23 families. You can't fit any number of 5s into 8 or 23 with nothing left over. So '8 isn't a multiple of 5, nor is 23. Only 5, 10, 15, 20, 25 ... are multiples (or families or steps) of 5. Use the arrow keys to navigate around the board and to avoid the Troggles. Press the spacebar to eat a number.
ar_tn: مضاعفات رقم هي كل الأرقام التي تساوي للرقم الأصلي مضروباً برقمٍٍٍ آخر. مثال: 24،36،48،60 هي مضاعفات ل 12. بينما 25 ليس مضاعفاً ل12 لأنه لا يوجد أي رقم ينتج 25 عند ضربه ب12. إذا كان رقم ما قاسما لرقم ثانٍ فإن هذا الرقم الثاني هو مضاعف للرقم الأول. أيضاً بإمكانك تصور المضاعفات بالعائلات و القواسم بالأفراد الذين ينتمون لهذه العائلات. القاسم 5 لديه والدان هما 10 و جدان هما 15. والدا جديه هما 20 وجدا جديه هما 25، و كل خطوة إضافية من 5 هي سلف أقدم له قبل الأخير. لكن رقم 5 لا ينتمي لعائلة ال8 أو عائلة 23. لا يمكن لأي 5 أن تنتمي إلى 8 أو 23 من دون بواقٍٍٍ. و هكذا فإن 8 ليست من مضاعفات 5 ولا من مضاعفات 23. فقط 10،5، ،25،20 ... هي مضاعفات ل5. استخدم مفاتيح الأسهم للتجوال حول اللوح ولتجنّب ال Troggles. اضغط مفتاح المساحة لالتهام رقم.
pa: ਕਿਸੇ ਅੰਕ ਦੀ ਗੁਣਜ,ਉਹ ਸਾਰੇ ਅੰਕ ਹਨ ਜੋ ਅਸਲੀ ਅੰਕ ਨਾਲ ਗੁਣਾ ਕਰਨ ਤੇ ਆਉਂਦੇ ਹਨ ਅਤੇ ਉਸਨੂੰ ਭਾਗ ਕਰਨ ਤੇ ਅਸਲੀ ਅੰਕ ਮਿਲ ਜਾਵੇ। ਜਿਵੇਂ 12,24,36,48,60 ਗੁਣਜ ਹਨ 12 ਦੇ। 25 ,12 ਦਾ ਗੁਣਜ ਨਹੀਂ ਹੈ। ਕਿਉਂਕਿ ਇਹੋ ਜਿਹਾ ਕੋਈ ਅਂਕ ਨਹੀਂ ਹੈ ਜਿਸਨੂੰ 12 ਨਾਲ ਗੁਣਾ ਕਰਨ ਤੇ 25 ਮਿਲੇ। ਜੇਕਰ ਪਹਿਲਾ ਅੰਕ ਦੂਜੇ ਦਾ ਗੁਣਜ ਹੈ ਫੇਰ ਦੂਜਾ ਅੰਕ ਪਹਿਲੇ ਦਾ ਗੁਣਕ ਹੋਵੇਗਾ ।ਤੁਸੀ ਗੁਣਜ ਨੂੰ ਪਰਿਵਾਰ ਦੇ ਰੂਪ ਵਿਚ ਸੋਚ ਸਕਦੇ ਹੋ ਅਤੇ ਗੁਣਕ ਇਸ ਪਰਿਵਾਰ ਦੇ ਹਿੱਸੇ ਹਨ। ਗੁਣਕ 5 ਦੇ ਮਾਪੇ 10,ਦਾਦੇ 15, ਪੜਦਾਦੇ 20, ਪੜ ਪੜਦਾਦੇ 25 ਅਤੇ ਅੱਗੇ ਹੋਰ ਵਡੇ।ਪਰ ਅੰਕ 5, 8ਜਾਂ 23 ਦੇ ਪਰਿਵਾਰ ਵਿੱਚ ਨਹੀਂ ਆਉਂਦਾ, ਤਾਂ 8, 5ਦਾ ਗੁਣਜ ਨਹੀਂ ਹੈ। ਸਿਰਫ 5,10,15,20,25.......ਹੀ ਗੁਣਜ ਹਨ।ਬੋਰਡ ਦੇ ਆਲੈ-ਦੁਆਲੈ ਮਾਰਗ ਨਿਰਦੇਸ਼ ਕਰਨ ਲਈ ਅਤੇ ਟੋ੍ਗਲ ਤੋਂ ਬਚਣ ਲਈ ਤੀਰ ਬਟਨ ਦੱਬੋ। ਨੰਬਰ ਖਾਣ ਲਈ ਸਪੇਸਬਾਰ ਨੂੰ ਦੱਬੋ।

source: Guide the Number Muncher to all the prime numbers.
ar_tn: وجه قاضم الأرقام إلى كل الأعداد الأولية.
pa: ਸਾਰੇ ਅਭਾਜਿਤ ਅੰਕ ਨੰਬਰ ਮੰਚਰ ਨੂੰ ਦੱਸੋ
ro: Ghidează Mestecătorii de Numere către toate numerele prime.

source: Learn about prime numbers
ar_tn: تعلم الأعداد الأولية.
pa: ਅਭਾਜਿਤ ਅੰਕ ਬਾਰੇ ਸਿੱਖੋ
ro: Învață despre numere prime

source: Prime Number Munchers
ar_tn: قاضم العدد الأولي .
pa: ਅਭਾਜਿਤ ਨੰਬਰ ਮੰਚਰ
ro: Mestecătorii de Numere Prime

source: Prime numbers are numbers that are only divisible by themselves and 1. For example, 3 is a prime number, but 4 isn't (because 4 is divisible by 2). You can think of prime numbers as very small families: they only ever have two people in them! Only themselves and 1. You can't fit any other numbers into them with nothing left over. 5 is one of these lonely numbers (only 5 × 1 = 5), but you can see that 6 has 2 and 3 in its family as well (6 × 1 = 6, 2 × 3 = 6). So 6 is not a prime number. Use the arrow keys to navigate around the board and to avoid the Troggles. Press the spacebar to eat a number.
ar_tn: الأعداد الأولية هي الأعداد القابلة للقسمة على نفسها و على الرقم 1 فقط. مثلاً: 3 هو عددأولي لكن 4 ليس عددا أوليا ( لأن 4 قابل للقسمة على 2). بامكانك تخيل الأعداد الأولية بأنها عائلات مكونة من اثنان من نفسها والرقم 1. لا يمكن لأي رقم أن ينتمي إليها دون أن يكون لها باقٍٍ. هي مكونة من اثنان فقط. 5 هو واحد من هذه الأعداد الوحيدة (فقط 1×5 = 5) بينما 6 لديه 3 و 2 في عائلته (6 ×1=6، 2 ×3=6 ) إذاً 6 ليس عدداً أولياً. استخدم مفاتيح الأسهم للتجوال حول اللوح ولتجنّب ال Troggles. اضغط مفتاح المساحة لالتهام رقم.
pa: ਅਭਾਜਿਤ ਨੰਬਰ ਉਹ ਨੰਬਰ ਹੈ ਜਿਹੜੇ ਸਿਰਫ ਆਪਣੇ ਤੇ ਜਾਂ 1 ਤੇ ਭਾਗ ਹੋਣ । ਜਿਵੇਂ 3 ਅਭਾਜਿਤ ਨੰਬਰ ਹੈ ਪਰ 4 ਅਭਾਜਿਤ ਨੰਬਰ ਨਹੀਂ ਹੈ ਕਿਉਂਕਿ 4,2 ਤੇ ਭਾਗ ਹੁੰਦਾ ਹੈ। ਤੁਸੀ ਸੋਚ ਸਕਦੇ ਹੋ ਅਭਾਜਿਤ ਨੰਬਰ ਦਾ ਪਰਿਵਾਰ ਛੋਟਾ ਹੁੰਦਾ ਹੈ। ਪਰਿਵਾਰ ਵਿੱਚ ਦੋ ਹੀ ਜਨ ਹੁੰਦੇ ਹਨ ਜਿਹੜੇ ਸਿਰਫ ਆਪਣੇ ਤੇ ਜਾਂ 1 ਤੇ ਭਾਗ ਹੋਣ।5 ਇਕ ਕੱਲਾ ਅੰਕ ਹੈ ਪਰ 6 ਦੇ ਪਰਿਵਾਰ ਵਿੱਚ 2,3 ਹਨ ਤਾਂ 6 ਅਭਾਜਿਤ ਨੰਬਰ ਨਹੀਂ ਹੈ।ਬੋਰਡ ਦੇ ਆਲੈ-ਦੁਆਲੈ ਮਾਰਗ ਨਿਰਦੇਸ਼ ਕਰਨ ਲਈ ਅਤੇ ਟੋ੍ਗਲ ਤੋਂ ਬਚਣ ਲਈ ਤੀਰ ਬਟਨ ਦੱਬੋ। ਨੰਬਰ ਖਾਣ ਲਈ ਸਪੇਸਬਾਰ ਨੂੰ ਦੱਬੋ।

source: Go to Number Munchers activities
ar_tn: اذهب إلى أنشطة قاضم الأرقام
pa: ਨੰਬਰ ਮੰਚਰ ਕਿ੍ਰੀਆ ਤੇ ਜਾਓ
ro: Mergi la activitățile Mestecătorilor de Numere

source: Number Munchers are games to play with arithmetic.
ar_tn: قاضم الأرقام هي ألعاب لممارسة الحساب.
pa: ਗਣਿਤ ਖੇਡਣ ਲਈ ਨੰਬਰ ਮੰਚਰ ਇਕ ਖੇਡ ਹੈ
ro: Mestecătorii de Numere sunt jocuri în care te distrezi cu aritmetica.

source: Guess a number
ar_tn: خمن رقم.
pa: ਅੰਕ ਪਛਾਣੋ
ro: Giciți un număr

source: Help Tux escape the cave. Tux hides a number for you to find.
ar_tn: ساعد البطريق على الخروج من الكهف. البطريق يخبأ لك رقماً لتجده.
pa: ਗੁਫਾ ਵਿਚੇਂ ਨਿਕਲਣ ਲਈ ਟੱਕਸ ਦੀ ਸਹਾਇਤਾ ਕਰੋ।ਤੁਹਾਡੇ ਲੱਭਣ ਲਈ ਟੱਕਸ ਨੇ ਇਕ ਅੰਕ ਲਕੋਇਆ ਹੈ।
ro: Ajută-l pe Tux să scape din peșteră. Tux ascunde un număr, ca să-l găsești.

source: Numbers from 1 to 1000 for the last level.
ar_tn: الأرقام من 1 إلى 1000 للمستوى الأخير.
pa: ਅੰਕ 1 ਤੋਂ 1000 ਤਕ ਅਖੀਰਲੇ ਪੱਧਰ ਲਈ
ro: Numere de la 1 la 1000 pentru ultimul nivel.

source: Read the instructions that give you the range of the number to find. Enter a number in the top right blue entry box. Tux will tell you if your number is higher or lower. Then enter another number. The distance between Tux and the escape area on the right represents how far you are from the correct number. If Tux is over or under the escape area, it means your number is over or under the correct number.
ar_tn: اقرأ التعليمات التي تعطيك المجال الذي يمكنك إيجاد الرقم فيه. أدخل رقما في أعلى يمين علبة الإدخال الزرقاء. سيقول لك البطريق إذا كان رقمك أعلى أو أدنى. ثم أدخل رقماً آخراً. المسافة بين البطريق و منطقة الخروج على اليمين تمثّل بعدك عن الرقم الصحيح. إذا كان البطريق أعلى أو أسفل منطقة الخروج فهذا يعني أن رقمك هو أعلى أو أسفل الرقم الصحيح.
pa: ਉਹਨਾਂ ਹਦਾਇਤਾਂ ਨੂੰ ਪੜੋ ਜਿਹੜਿਆਂ ਤੁਹਾਨੂੰ ਲੱਭੇ ਜਾਣ ਵਾਲੇ ਅੰਕ ਦੀ ਹੱਦ ਦਸ ਰਹੀਆਂ ਹਨ।ਉੱਪਰ ਸੱਜੇ ਪਾਸੇ ਨੀਲੇ ਡੱਬੇ ਵਿੱਚ ਇੱਕ ਅੰਕ ਭਰੋ। ਟਕਸ ਦੱਸੇਗਾ ਕਿ ਤੁਹਾਡਾ ਅੰਕ ਵੱਡਾ ਹੈ ਯਾ ਛੋਟਾ। ਫੇਰ ਇੱਕ ਹੋਰ ਅੰਕ ਭਰੋ। ਟਕਸ ਅਤੇ ਗੁਫਾ ਵਿਚੋਂ ਨਿਕਲਣ ਦੇ ਰਾਹ ਦੀ ਦੂਰੀ ਦਰਸਾਊਂਦੀ ਹੈ ਕਿ ਤੁਸੀ ਸਹੀ ਅੰਕ ਤੋਂ ਕਿੱਨੀ ਦੂਰ ਹੋ।ਟਕਸ ਦਾ ਗੁਫਾ ਵਿਚੋਂ ਨਿਕਲਣ ਦੇ ਰਾਹ ਤੋਂ ਅੱਗੇ ਜਾਂ ਪਿੱਛੇ ਹੋਣਾ ਦਰਸਾਊਂਦਾ ਹੈ ਕਿ ਤੁਸੀ ਸਹੀ ਅੰਕ ਤੋਂ ਕਿੱਨੀ ਅੱਗੇ ਜਾਂ ਪਿੱਛੇ ਹੋ।

source: Concept taken from EPI games.
ar_tn: الفكرة مستوحاة من ألعاب EPI
pa: ਸੰਕਲ ਈ.ਪੀ.ਆਈ. ਖੇਡਾਂ ਤੋਂ ਲਿਆ ਗਿਆ ਹੈ।
ro: Concept luat de la jocurile EPI

source: Drag and Drop one top piece at a time, from one peg to another, to reproduce the tower on the right in the empty space on the left.
ar_tn: اسحب و أسقط قطعة علوية واحدة كل مرة. من وتد إلى آخر على اليمين لإعادة إنشاء البرج في المساحة الفارغة على اليسار.
pa: ਸੱਜੇ ਪਾਸੇ ਦਿੱਤੇ ਟਾਵਰ ਨੂੰ ਖੱਬੇ ਪਾਸੇ ਵਾਲੀ ਖਾਲੀ ਥਾਂ ਤੇ ਦੁਬਾਰਾ ਉਤਪੰਨ ਕਰਨ ਲਈ ,ਇੱਕ ਵਾਰ ਵਿੱਚ ਇੱਕ ਟੁੱਕੜੇ ਨੂੰ ਖਿੱਚੋ ਅਤੇ ਦੂਜੇ ਪਾਸੇ ਰੱਖੋ।
ro: Trageți și plasați câte un element de sus de pe un țăruș pe altul pentru a reproduce turnul din dreapta în stânga.

source: Reproduce the given tower
ar_tn: أعد تكوين البرج
pa: ਦਿੱਤੇ ਹੋਏ ਟਾਵਰ ਨੂੰ ਦੁਬਾਰਾ ਉਤਪੰਨ ਕਰੋ।
ro: Reporduceți turnul

source: Reproduce the tower on the right in the empty space on the left
ar_tn: أعد إنشاء البرج الذي على اليمين في المساحة الفارغة على اليسار.
pa: ਟਾਵਰ ਨੂੰ ਖੱਬੇ ਪਾਸੇ ਵਾਲੀ ਖਾਲੀ ਥਾਂ ਤੇ ਦੁਬਾਰਾ ਉਤਪੰਨ ਕਰੋ
ro: Reproduceți turnul din dreaptă în spațiul gol din stînga

source: Simplified Tower of Hanoi
ar_tn: أبراج هانوي مبسطة
pa: ਹਨੋਈ ਦਾ ਸਰਲ ਟਾਵਰ
ro: Turnul simplificat din Hanoi

source: Drag and Drop the top pieces only from one peg to another, to reproduce the tower on the right in the empty space on the left.
ar_tn: اسحب و أسقط القطع العلوية من وتد إلى آخرفقط لإعادة إنشاء البرج الذي على اليمين في المساحة الفارغة على اليسار.
pa: ਸੱਜੇ ਪਾਸੇ ਦਿੱਤੇ ਟਾਵਰ ਨੂੰ ਖੱਬੇ ਪਾਸੇ ਵਾਲੀ ਖਾਲੀ ਥਾਂ ਤੇ ਦੁਬਾਰਾ ਉਤਪੰਨ ਕਰਨ ਲਈ ,ਕੇਵਲ ਉੱਪਰ ਵਾਲੇ ਟੁੱਕੜਿਆਂ ਨੂੰ ਇੱਕ ਕਿੱਲੇ ਤੋਂ ਖਿੱਚ ਕੇ ਦੂਜੇ ਕਿੱਲੇ ਤੇ ਰੱਖੋ।
ro: Trageți și plasați piesele de sus de pe un țăruș pe altul, pentru a reproduce turnul din dreapta în cel gol din stânga.

source: Reproduce the tower on the right side
ar_tn: أعد تكوين البرج في الجانب الأيمن
pa: ਟਾਵਰ ਨੂੰ ਸੱਜੇ ਪਾਸੇ ਤੇ ਦੁਬਾਰਾ ਉਤਪੰਨ ਕਰੋ।
ro: Reproduceți turnul din dreaptă

source: The Tower of Hanoi
ar_tn: أبراج هانوي
pa: ਹਨੋਈ ਟਾਵਰ
ro: Turnul din Hanoi

source: The object of the game is to move the entire stack to another peg, obeying the following rules: * only one disc may be moved at a time * no disc may be placed atop a smaller disc
pa: ਖੇਡ ਦਾ ਮੰਤਵ ਪੂਰੇ ਢੇਰ ਨੂੰ ਇੱਕ ਕਿੱਲੇ ਤੋਂ ਦੂਜੇ ਕਿੱਲੇ ਤਕ ਹੇਠ ਲਿਖੇ ਨਿਯਮਾਂ ਦਾ ਪਾਲਨ ਕਰਦੇ ਹੋਏ ਪਹੁੰਚਣਾ ਹੈ।: *ਇਕ ਵਾਰ ਵਿੱਚ ਸਿਰਫ ਇਕ ਤਵੀ ਨੂੰ ਇੱਕ ਕਿੱਲੇ ਤੋਂ ਦੂਜੇ ਕਿੱਲੇ ਤਕ ਪਹੁੰਚਾਓ।: *ਕੋਈ ਵੀ ਤਵੀ ਅਪਣੇ ਤੋਂ ਛੋਟੀ ਤਵੀ ਦੇ ਉੱਪਰ ਨਹੀਂ ਰੱਖੀ ਜਾ ਸਕਦੀ
ro: Obiectivul jocului e intregii piramide de pe un țăruș pe altul, conform urătoarelor reguli: * numai un disk poate fi mișcat odată * pe un disk mai mic nu se poate pune altul

source: The puzzle was invented by the French mathematician Edouard Lucas in 1883. There is a legend about a Hindu temple whose priests were constantly engaged in moving a set of 64 discs according to the rules of the Tower of Hanoi puzzle. According to the legend, the world would end when the priests finished their work. The puzzle is therefore also known as the Tower of Brahma puzzle. It is not clear whether Lucas invented this legend or was inspired by it. (source Wikipedia &lt;http://en.wikipedia.org/wiki/Tower_of_hanoi&gt;)
ar_tn: اخترع اللغز عالم الرياضيات الفرنسي ادوارد لوكسفي عام 1883. هنالك اسطورة عن معبد هندي حيث كان قسسة المعبد في عمل دائم بتحريك مجموعة من 64 قرص وفقاً لقوانين لغز برج هانوي. وفقاً للاسطورة سينتهي العالم عندما ينتهي القسسة من عملهم. إن هذا اللغز معروف أيضاً بلغز برج براهما. ليس واضحاً تماماً فيما إذا كان لوكس قد اخترع هذه الإسطورة أم أنه قد استوحى منها. (source Wikipedia &lt;http://en.wikipedia.org/wiki/Tower_of_hanoi&gt;)
pa: ਇਹ ਬੁਝਾਰਤ ਫਰਾਂਸ ਦੇ ਹਿਸਾਬ ਦਾਨ ਐਡੁਅਰਡ ਲੁਕਾਸ ਨੇ ਸੰਨ 1883 ਵਿੱਚ ਬਣਾਈ ਸੀ।ਇੱਕ ਹਿੰਦੂ ਮੰਦਰ ਦੀ ਰਿਵਾਇਤ ਅਨੁਸਾਰ ,ਓਥੋਂ ਦੇ ਪੁਜਾਰੀ ਲਗਾਤਾਰ 64 ਤਵੀਆਂ ਹਨੋਈ ਦੇ ਟਾਵਰ ਦੀ ਬੁਝਾਰਤ ਦੇ ਨਿਯਮਾਂ ਅਨੁਸਾਰ ਇਕ ਥਾਂ ਤੋਂ ਦੂਜੀ ਥਾਂ ਤੇ ਰੱਖ ਰਹੇ ਸੰਨ ।ਇਸ ਰਿਵਾਇਤ ਅਨੁਸਾਰ ਪੁਜਾਰਿਆਂ ਦਾ ਕੰਮ ਖਤਮ ਹੁੰਦੇ ਸਾਰ ਧਰਤੀ ਦਾ ਅੰਤ ਹੋ ਜਾਵੇਗਾ।ਇਸ ਲਈ ਇਸ ਬੁਝਾਰਤ ਨੂੰ ਬ੍ਹਹਮਾ ਦੇ ਟਾਵਰ ਦੀ ਬੁਝਾਰਤ ਵੀ ਕਿਹਾ ਜਾਂਦਾ ਹੈ। ਇਸ ਗੱਲ ਦੀ ਪੁਸ਼ਟੀ ਨਹੀਂ ਕੀਤੀ ਜਾ ਸਕਦੀ ਕਿ ਇਹ ਬੁਝਾਰਤ ਲੁਕਾਸ ਨੇ ਬਣਾਈ ਹੈ ਜਾਂ ਇਹ ਉਸ ਰਿਵਾਇਤ ਤੋਂ ਪ੍ਭਾਵਿਤ ਹੈ।
ro: Puzzle-ul a fost inventat de matematicianul francez Edouard Lucas în 1883. Există o legendă despre un templu Hindus în care preoții mutau continuu un set de 64 de discuri respectând regulile puzzle-ului Turnurile din Hanoi. Potrivit legendei, sfârșitul lumii va venii când preoții vor termina de mutat piesele. Puzzle-ul este de asemenea cunoscut și sub numele de Turnul lui Brahma. Nu se știe dacă Lucas a inventat legenda sau s-a inspirat din aceasta. (sursă Wikipedia &lt;http://en.wikipedia.org/wiki/Tower_of_hanoi&gt;)

source: Find the strawberry by clicking on the blue fields
ar_tn: جد الفراولة بالنقر على المجالات الزرقاء
pa: ਨੀਲੇ ਰੰਗ ਦੇ ਖੇਤਰ ਵਿਚ ਕਲਿਕ ਕਰਕੇ ਸਟ੍ਰਾਬੈਰੀ ਲੱਭੋ
ro: Găsește căpșuna făcînd click pe cîmpurile albastre

source: Try to find the strawberry under the blue fields. The fields become redder as you get closer.
ar_tn: جد الفراولة تحت المجالات الزرقاء. المجالات تحمر كلما اقتربت
pa: ਨੀਲੇ ਰੰਗ ਦੇ ਖੇਤਰ ਵਿਚ ਕਲਿਕ ਕਰਕੇ ਸਟ੍ਰਾਬੈਰੀ ਲੱਭਣ ਦੀ ਕੋਸ਼ਿਸ਼ ਕਰੋ।ਜਿਨਾੰ ਤੁਸੀ ਨਜ਼ਦੀਕ ਜਾਓਗੇ ,ਖੇਤਰ ਹੋਰ ਲਾਲ ਹੁੰਦਾ ਜਾਇਗਾ।
ro: Încearcă să găsești căpșuna sub cîmpurile albastre. Cîmpurile devin mai roșii cînd ești mai aproape.

source: hexagon
ar_tn: سداسي الأضلاع
pa: ਛੇਭੁਜੀ

source: Click on the word corresponding to the printed image.
ar_tn: انقر على الكلمة المناسبة للصورة المعروضة
pa: ਛਪੀ ਹੋਈ ਤਸਵੀਰ ਦੇ ਨਾਲ ਮਿਲਦਾ ਹੋਇਆ ਅੱਖਰ ਲੱਭੋ
ro: Făceți clic pe cuvîntul ce corespunde imaginii.

source: Practice reading by finding the word matching an image
ar_tn: تعلم القراءة بالعثور على الكلمة المناسبة لصورة
pa: ਤਸਵੀਰ ਦੇ ਨਾਲ ਮਿਲਦਾ ਹੋਇਆ ਅੱਖਰ ਲੱਭ ਕੇ ਪੜਨ ਦਾ ਅਭਿਆਸ ਕਰੋ।
ro: Exersați citirea găsind cuvântul corespunzător imaginii

source: Reading
ar_tn: القراءة
pa: ਪੜਨਾ
ro: Citire

source: Reading practice
ar_tn: تعلم القراءة
pa: ਪੜਨ ਦਾ ਅਭਿਆਸ
ro: Exersează cititul

source: apple
ar_tn: تفاحة
pa: ਸੇਬ
ro: măr

source: back
ar_tn: ظهر
pa: ਪਿੱਛੇ
ro: înapoi

source: bag
ar_tn: حقيبة
pa: ਥੈਲਾ
ro: geantă

source: ball
ar_tn: كرة
pa: ਗੇਂਦ
ro: minge

source: banana
ar_tn: موزة
pa: ਕੇਲਾकेला
ro: banană

source: bed
ar_tn: سرير
pa: ਬਿਸਤਰकेला
ro: pat

source: boat
ar_tn: زورق
pa: ਕਿਸ਼ਤੀनाव
ro: barcă

source: book
ar_tn: كتاب
pa: ਕਿਤਾਬ
ro: carte

source: bottle
ar_tn: زجاجة
pa: ਬੋਤਲ
ro: sticlă

source: cake
ar_tn: كعكة
pa: ਕੇਕ
ro: prăjitură

source: camel
ar_tn: جمل
pa: ਉੱਠउॅंट
ro: cămilă

source: car
ar_tn: سيارة
pa: ਕਾਰ
ro: mașină

source: cat
ar_tn: قط
pa: ਬਿੱਲੀबिल्ली
ro: pisică

source: catch
ar_tn: أمسك
pa: ਪਕੜ
ro: încuietoare

source: cheese
ar_tn: جبنة
pa: ਪਨੀਰ
ro: brânză

source: cow
ar_tn: بقرة
pa: ਗਾਂ
ro: vacă

source: dog
ar_tn: كلب
pa: ਕੁੱਤਾ
ro: câine

source: finish
ar_tn: إنهاء
pa: ਖਤਮ
ro: sfârșit

source: fish
ar_tn: سمكة
pa: ਮੱਛੀ
ro: pește

source: house
ar_tn: منزل
pa: ਘਰ
ro: casă

source: pear
ar_tn: إجاصة
pa: ਨਾਸ਼ਪਾਤੀ
ro: pară

source: plane
ar_tn: طائرة
pa: ਹਵਾਈ ਜਹਾਜ਼
ro: avion

source: satchel
ar_tn: محفظة
pa: ਬਸਤਾ
ro: geantă

source: Drag and Drop each item onto its name
ar_tn: أمسك و اسحب القطع فوق أسمائها
pa: ਹਰੇਕ ਚੀਜ਼ ਨੂੰ ਉਸਦੇ ਨਾਮ ਨਾਲ ਖਿੱਚੋ ਅਤੇ ਛੱਡੋ।
ro: Trage și Lasă fiecare obiect pe numele său

source: Drag each image from the (vertical) box on the left to its (corresponding) name on the right. Click the OK button to check your answer.
ar_tn: اسحب كل صورة من الصندوق العمودي في اليسار إلى الاسم الموافق له في اليمين. أنقر زر موافق للتأكد من إجابتك
pa: ਹਰੇਕ ਤਸਵੀਰ ਨੂੰ ਇਸਦੇ ਖੱਬੇ ਪਾਸੇ ਦੇ ਡੱਬੇ ਤੋਂ ਨਾਮ ਦੇ ਮੁਤਾਬਕ ਸੱਜੇ ਪਾਸੇ ਖਿੱਚੇ।ਆਪਣਾ ਜਵਾਬ ਚੈੱਕ ਕਰਨ ਲਈ ਓ ਕੇ ਬਟਨ ਨੂੰ ਦਬਾਓ।
ro: Trageți fiecare imagine de pe cutia verticală din stânga pe numele corespunzător din dreapta. Tastați OK pentru control.

source: Image Name
ar_tn: اسم الصورة
pa: ਤਸਵੀਰ ਦਾ ਨਾਂ
ro: Numele imaginii

source: Vocabulary and reading
ar_tn: مفردات و قراءة
pa: ਸ਼ਬਦਾਵਲੀ ਅਤੇ ਪੜਨਾ
ro: Vocabular și citire

source: bulb
ar_tn: مصباح
pa: ਬਲਬ
ro: bec

source: fishing boat
ar_tn: قارب صيد
pa: ਮਛਲੀ ਫੜਨ ਵਾਲੀ ਕਿਸ਼ਤੀ
ro: vapor de pescuit

source: lamp
ar_tn: فانوس
pa: ਬੱਤੀ
ro: veioză

source: mail box
ar_tn: صندوق البريد
pa: ਮੇਲ ਬਾਕਸ
ro: cutie poștală

source: postcard
ar_tn: بطاقة بريدية
pa: ਚਿੱਠੀ
ro: vedere

source: sailing boat
ar_tn: قارب نزهة
pa: ਪਾਲ ਕਿਸ਼ਤੀ
ro: barcă pentru navigat

source: egg
ar_tn: بيضة
pa: ਅੰਡਾ
ro: ou

source: eggcup
ar_tn: تاجر بيض و دجاج
pa: ਅੰਡੇ ਵਰਗਾ ਕੱਪ
ro: ceașcă pentru ou

source: flower
ar_tn: زهرة
pa: ਫੁੱਲ
ro: floare

source: glass
ar_tn: كأس
pa: ਗਿਲਾਸ
ro: pahar

source: vase
ar_tn: مزهرية
pa: ਫੁਲਦਾਨ
ro: vază

source: light house
ar_tn: منارة
pa: ਰੋਸ਼ਨੀ ਘਰ
ro: far

source: rocket
ar_tn: صاروخ
pa: ਰਾਕੇਟ
ro: rachetă

source: sofa
ar_tn: أريكة
pa: ਗੱਦੇਦਾਰ ਕੁਰਸੀ
ro: canapea

source: star
ar_tn: نجمة
pa: ਤਾਰਾ
ro: stea

source: bicycle
ar_tn: دراجة
pa: ਸਾਈਕਲ
ro: biciletă

source: carrot
ar_tn: جزرة
pa: ਗਾਜਰ
ro: morcov

source: grater
ar_tn: مبشرة
pa: ਕੱਦੂ ਕਸ਼
ro: răzătoare

source: tree
ar_tn: شجرة
pa: ਰੁੱਖ਼
ro: copac

source: pencil
ar_tn: قلم
pa: ਪੈਨਸਲ
ro: creion

source: truck
ar_tn: شاحنة
pa: ਟਰੱਕ
ro: camion

source: van
ar_tn: عربة
pa: ਵੈਨ
ro: dubiță

source: castle
ar_tn: قصر
pa: ਮਹਿਲ
ro: castel

source: crown
ar_tn: تاج
pa: ਤਾਜ
ro: coroană

source: flag
ar_tn: علم
pa: ਝੰਡਾ
ro: steag

source: racket
ar_tn: مضرب تنس
pa: ਰਾਕੇਟ
ro: rachetă

source: Discover the keyboard.
ar_tn: اكتشف الحاسوب
pa: ਕਿਬੋਰਡ ਨੂੰ ਲੱਭੋ
ro: Descoperă tastatura.

source: Keyboard-manipulation boards
ar_tn: استخدام لوحة المفاتيح
pa: ਕਿਬੋਰਡ ਜੋੜ-ਤੋੜ ਫੱਟਾ
ro: Table pentru manipularea tastaturii

source: Determine if a hand is a right or a left hand
ar_tn: احكم إن كانت اليد يمنى أو يسرى
pa: ਹੱਥ ਸੱਜਾ ਹੈ ਯਾ ਖੱਬਾ , ਪਛਾਣੋ
ro: Determină dacă mâna e stânga sau dreapta

source: Distinguish right and left hands from different points of view. Spatial representation
ar_tn: ميز اليد اليمنى و اليسرى من جهات مختلفة.التصوير المكاني
pa: ਵੱਖ-ਵੱਖ ਦਿ੍ਸ਼ਟੀਕੋਣ ਤੋਂ ਖੱਬੇ ਅਤੇ ਸੱਜੇ ਹੱਥ ਨੂੰ ਪਛਾਣੋ
ro: Deosebește mâna dreaptă și mâna stângă din diferite perspective. Reprezentare spațială

source: Find your left and right hands
ar_tn: تعرف على يدك اليمنى و يدك اليسرى
pa: ਅਪਣੇ ਖੱਬੇ ਅਤੇ ਸੱਜੇ ਹੱਥ ਨੂੰ ਲੱਭੋ
ro: Găsiți mâna stângă sau dreaptă

source: None
ar_tn: لا شيء
pa: ਕੁੱਝ ਨਹੀਂ
ro: Nimic

source: You can see a hand: is it a left hand or a right hand? Click on the red button on the left, or the green button on the right.
ar_tn: ترى يدا ,هل هي يمنى أم يسرى؟ انقر الزر الأيمن الأخضر أو الزر الأيسر الأحمر
pa: ਤੁਸੀ ਇੱਕ ਹੱਥ ਦੇਖ ਰਹੇ ਹੋ,ਜੇਕਰ ਇਹ ਖੱਬਾ ਹੱਥ ਹੈ ਤਾਂ ਖੱਬੇ ਪਾਸੇ ਲਾਲ ਰੰਗ ਦਾ ਬਟਨ ਦੱਬੋ ਅਤੇ ਜੇ ਇਹ ਸੱਜਾ ਹੱਥ ਹੈ ਤਾਂ ਸੱਜੇ ਪਾਸੇ ਹਰਾ ਬਟਨ ਦੱਬੋ
ro: Poți vedea o mână: este mâna stângă sau mâna dreaptă? Fă clic pe butonul roșu din stânga, sau pe butonul verde din dreapta.

source: GCompris identifies each child, so we can provide child-specific reports.
ar_tn: جكومبري يتعرف على كل طفل مما يمكنكم من تقارير خاصة بكل طفل
pa: ਜੀਕੰਪਾ੍ਇਸ ਹਰ ਇਕ ਬੱਚੇ ਨੂੰ ਪਹਚਾਣਦੀ ਹੈ,ਤਾਂ ਕਿ ਉਹ ਖਾਸ ਤੋਰ ਤੇ ਬੱਚਿਆਂ ਦੀ ਰਿਪੋਰਟ ਉਪਲਬਦ ਕਰਵਾ ਸਕੇ
ro: GCompris identifică fiecare copil, deci vă putem oferi dări de seamă pe fiecare copil în parte.

source: GCompris login screen
ar_tn: شاشة تسجيل الدخول لجكومبري
pa: ਜੀਕੰਪਾ੍ਇਸ ਲਾਗਿਨ ਸਕੀ੍ਨ
ro: Ecranul de autentificare GCompris

source: In order to activate the login screen, you must first add users in the administration part of GCompris. You access Administration by running 'gcompris -a'. In Administration, you can create different profiles. In each profile, you can have a different set of users and select which activities are available to them. To run GCompris for a specific profile, you use 'gcompris -p profile' where 'profile' is the name of a profile as you created it in Administration.
ar_tn: لتفعيل شاشة الدخول عليك أولا أن ت
pa: ਲਾਗਿਨ ਸਕੀ੍ਨ ਨੂੰ ਚਾਲੂ ਕਰਨ ਲਈ ਪਹਿਲਾਂ ਜੀਕੰਪਾ੍ਇਸ ਦੇ ਪਰਬੰਧਕੀ ਹਿੱਸੇ ਵਿੱਚ ਖਿਡਾਰੀ ਜੋੜੋ ।gcompris-a ਕਮਾਂਡ ਨਾਲ ਤੁਸੀ ਪਰਬੰਧਕ ਨੂੰ ਚਲਾ ਸਕਦੇ ਹੋ।ਇੱਥੇ ਤੁਸੀ ਵੱਖ-ਵੱਖ ਪੋ੍ਫਾਈਲ ਬਣਾ ਸਕਦੇ ਹੋ।ਹਰ ਪੋ੍ਫਾਈਲ ਵਿੱਚ ਤੁਸੀ ਵੱਖ-ਵੱਖ ਖਿਡਾਰਿਆਂ ਦੇ ਸਮੂਹ ਬਣਾ ਸਕਦੇ ਹੋ ਅਤੇ ਚੁਣ ਸਕਦੇ ਹੋ ਕਿ ਉਹਨਾਂ ਨੂੰ ਕਿਹੜੀਆੰ ਕਿਹੜੀਆੰ ਕਿ੍ਆਵਾਂ ਉਪਲਬਧ ਹਨ।ਇੱਕ ਖਾਸ ਪੋ੍ਫਾਈਲ ਵਿੱਚ ਜੀਕੰਪਾ੍ਇਸ ਚਲਾਉਣ ਲਈ ਤੁਸੀ gcompris -p ਕਮਾਂਡ ਦੀ ਵਰਤੋ ਕਰ ਸਕਦੇ ਹੋ ਜਿੱਥੇ ਪੋ੍ਫਾਈਲ ਉਸੇ ਪੋ੍ਫਾਈਲ ਦਾ ਨਾਮ ਹੈ ਜੋ ਤੁਸੀ ਪਰਬੰਧਕ ਵਿੱਚ ਬਣਾਈ ਹੈ।

source: Select or enter your name to log in to GCompris
ar_tn: اختر أو اكتب اسمك للدخول لجكومبري
pa: ਜੀਕੰਪਾ੍ਇਸ ਤੇ ਲਾਗਿਨ ਕਰਨ ਲਈ ਆਪਣਾ ਨਾਮ ਚੁਣੋ ਯਾ ਭਰੋ
ro: Selectați sau întroduce-ți numele tău pentru a intra in Gompris

source: Addition
ar_tn: جمع
pa: ਜੋੜ
ro: Adăugare
