Repository: MkPereira/gcompris
Catalog: po/*.po
Languages: ar_tn, pa, ro

source: <i>Use Gcompris administration module to filter boards</i>
ar_tn: استخدم ودة الإدارة لاختيار اللوحات
pa: <i> ਬੋਰਡ ਫਿਲਟਰ ਕਰਨ ਲਈ ਜੀਕੰਪਿ੍ਸ ਪ੍ਸ਼ਾਸਨ ਹਿਸਾ ਵਰਤੋ<i>
ro: <i>Utilizați modulul de administrare al lui GCompris pentru a filtra tablele</i>

source: GCompris Configuration
ar_tn: إعدادات جكومبري
pa: ਜੀਕੰਪਿ੍ਸ ਰੂਪਰੇਖਾ
ro: Configurația GCompris

source: Fullscreen
ar_tn: استخدام جميع الشاشة
pa: ਪੂਰੀ ਸਕਰੀਨ
ro: Pe tot ecranul

source: Music
ar_tn: موسيقى
pa: ਸੰਗੀਤसंगीत
ro: Muzică

source: Effect
ar_tn: التأثير
pa: ਸਿੱਟਾ
ro: Efect

source: Couldn't open skin dir: %s
ar_tn: تعذر فتح مجلد الأشكال : %s
pa: ਸਕਿਨ % ਡਰੈਕਟਰੀ ਨਹੀ ਖੁਲ ਸਕਦੀ
ro: Dosarul cu fațete nu a putut fi deschis: %s

source: Skin : %s
ar_tn: الشكل : %s
pa: ਸਕਿਨ %
ro: Fațetă: %s

source: SKINS NOT FOUND
ar_tn: الأشكال غير موجودة
pa: ਸਕਿਨ ਨਹੀ ਮਿਲ ਰਹੀ
ro: NU S-AU GĂSIT FAȚETE

source: English (United State)
ar_tn: انجليزي (الولايات المتحدة)
pa: ਇੰਗਲਿਸ਼(ਯੁਨਾਇਟਡ ਸਟੇਟਸ)
ro: Engleză (Statele Unite)

source: CANCEL
ar_tn: ألغ
pa: ਰੱਦ
ro: ABANDON

source: LOAD
ar_tn: حمّل
pa: ਭਾਰ
ro: ÎNCARC

source: SAVE
ar_tn: احفظ
pa: ਸੇਵ
ro: PĂSTREZ

source: Couldn't find or load the file
ar_tn: لم أستطع العثور على الملف %s !
pa: ਫਾਇਲ ਨਹੀ ਮਿਲੀ ਯਾ ਫਾਇਲ ਲੋਡ ਨਹੀ ਹੋ ਰਹੀ
ro: Fișierul nu a putut fi găsit sau încărcat

source: This activity is incomplete.
ar_tn: هذا النشاط ناقص
pa: ਇਹ ਕਿ੍ਆ ਅਧੂਰੀ ਹੈ
ro: Activitatea este incompletă.

source: Exit it and report the problem to the authors.
ar_tn: اخرج و أرسل تقريرا بالمشكلة إلى المؤلفين
pa: ਬਾਹਰ ਆਓ ਅਤੇ ਲੇਖਕ ਨੂੰ ਮੁਸ਼ਕਿਲ ਬਾਰੇ ਸੂਚਿਤ ਕਰੋ
ro: Părăsește și raportează problema autorilor.

source: display only activities with this difficulty level.
ar_tn: عرض الأنشطة التي تتناسب فقط مع هذا المستوى
pa: ਕੇਵਲ ਕਿ੍ਆਵਾਂ ਨੂੰ ਇਸ ਕਠਿਨ ਪੱਧਰ ਤੇ ਦਿਖਾਓ
ro: afișează doar activitățile cu acest nivel de dificultate.

source: display debug informations on the console.
ar_tn: اعرض التصحيح على لوحة التحكم
pa: ਗਲਤਿਆਂ ਦੀ ਸੂਚਨਾ ਸਕਰੀਨ ਤੇ ਦਿਖਾਓ
ro: afișează informații pentru depanare în consolă

source: Print the version of
ar_tn: اطبع رقم نسخة
pa: ਤਰਜਮਾ ਛਾਪੋ
ro: Listează versiunea

source: Use the antialiased canvas (slower).
ar_tn: استعمال المساحات المنعمة (أبطأ)
pa: ਐਂਟੀਅਲਾਇਜ਼ ਕੈਨਵਸ ਦੀ ਵਰਤੋ ਕਰੋ(ਹੋਲੀ)
ro: Folosește canava cu anti-alias ( mai încet ).

source: Disable XF86VidMode (No screen resolution change).
pa: XF86VidMode ਬੰਦ ਕਰੋ (ਸਕਰੀਨ ਦਾ ਰੈਜ਼ੂਲੂਸ਼ਨ ਨਾ ਬਦਲੋ)
ro: Dezactiveaza XF86VidMode (Fără modificarea rezoluției ecranului).

source: Run GCompris with local activity directory added to menu
pa: ਜੀਕੰਪਿ੍ਸ ਨੂੰ ਲੋਕਲ ਕਿ੍ਆਵਾਂ ਵਾਲੀ ਡਰੈਕਟਰੀ ਨੂੰ ਮੀਨੂ ਵਿੱਚ ਪਾ ਕੇ ਚਲਾਓ
ro: Rulează GCompris cu dosarul de activități locale adăugat în meniu

source: Run GCompris in administration and user-management mode
pa: ਜੀਕੰਪਿ੍ਸ ਨੂੰ ਪ੍ਸ਼ਾਸਨ ਅਤੇ ਯੂਜ਼ਰ ਮੋਡ ਵਿੱਚ ਚਲਾਓ
ro: Rulează GCompris in modul administrator și gestiune-utilizator

source: Use alternate database for profiles [$HOME/.config/gcompris/gcompris_sqlite.db]
pa: ਪੋ੍ਫਾਇਲਾਂ ਲਈ ਹੋਰ ਡਾਟਾਬੇਸ ਵਰਤੋ [$HOME/.config/gcompris/gcompris_sqlite.db]
ro: Folosiți o bază de date alternativă pentru profiluri [$HOME/.config/gcompris/gcompris_sqlite.db]

source: Create the alternate database for profiles
pa: ਪੋ੍ਫਾਇਲਾਂ ਲਈ ਹੋਰ ਡਾਟਾਬੇਸ ਬਣਾਓ
ro: Creați o bază de date alternativă pentru profiluri

source: Re-read XML Menus and store them in the database
pa: ਦੁਬਾਰਾ XML ਮੀਨੂ ਪੜਕੇ ਡਾਟਾਬੇਸ ਵਿੱਚ ਸੁਰਕਸ਼ਿਤ ਕਰੋ
ro: Recitește meniurile XML și stochează-le într-o bază de date

source: Set the profile to use. Use 'gcompris -a' to create profiles
pa: ਪੋ੍ਫਾਇਲ ਨੂੰ ਵਰਤਨ ਲਈ ਤਿਆਰ ਕਰੋ।`gcompris - a' ਨੂੰ ਪੋ੍ਫਾਇਲ ਬਨਾਉਣ ਲਈ ਵਰਤੋ
ro: Desemnați profilul de utilizare. Folosiți 'gcompris -a' pentru a crea profiluri

source: List all available profiles. Use 'gcompris -a' to create profiles
pa: ਸਾਰੇ ਪੋ੍ਫਾਇਲਾਂ ਦੀ ਸੂਚੀ ਹਾਜਰ ਕਰੋ।`gcompris - a' ਨੂੰ ਪੋ੍ਫਾਇਲ ਬਨਾਉਣ ਲਈ ਵਰਤੋ
ro: Lista profilelor disponibile. Folosiți 'gcompris -a' pentru a crea profiluri

source: Config directory location: [$HOME/.config/gcompris]. Alternate is to set $XDG_CONFIG_HOME.
pa: ਕੌਨਫਿਗ ਡਰੈਕਟਰੀ ਦਾ ਸਥਾਨ [$HOME/.config/gcompris]ਦੂਸਰਾ ਸੈੱਟ $XDG_CONFIG_HOME.
ro: Locația dosarului de configurare: [$HOME/.config/gcompris]. Alternativ puteți defini $XDG_CONFIG_HOME.

source: The location of user directories: [$HOME/My GCompris]
pa: ਯੂਜ਼ਰ ਡਰੈਕਟਰੀ ਦਾ ਸਥਾਨ : [$HOME/My GCompris]
ro: Locația dosarelor utilizatorului: [$HOME/My GCompris]

source: Run the experimental activities
ar_tn: أنشطة ااتجارب
pa: ਪ੍ਤਾਵੀ ਕਿ੍ਆਵਾਂ ਨੂੰ ਚਲਾਓ
ro: Mergeți la activitățile experimentale

source: Disable the quit button
pa: ਕਵਿੱਟ ਬਟਨ ਨੂੰ ਅਦਿ੍ਸ਼ ਕਰੋ
ro: Inactivează butonul de ieșire

source: Disable the config button
pa: ਕੌਨਫਿਗ ਬਟਨ ਨੂੰ ਬੰਦ ਕਰੋ
ro: Incativează butonul de configurare

source: Display the resources on stdout based on the selected activities
pa: ਚੁਣੀ ਹੋਈ ਕਿ੍ਆ ਦੇ ਅਧਾਰ ਤੇ stdout ਦੇ ਸਾਧਨ ਦਿਖਾਓ
ro: Afișează resursele pe ieșirea standard în funcție de activitățile selectate

source: GCompris will get images, sounds and activity data from this server if not found locally.
pa: ਜੀਕੰਪਿ੍ਸ ਇਸ ਸਰਵਰ ਤੇ ਤਸਵੀਰ ,ਅਵਾਜ਼ ਅਤੇ ਕਿ੍ਆ ਆੰਕੜੇ ਲਵੇਗਾ ਜੇਕਰ ਘਰੇਲੂ ਨਾ ਮਿੱਲਿਆ
ro: GCompris va lua imaginile, sunetele și activitățile de pe un server dacă acestea nu sunt găsite local.

source: Only when --server is provided, disable check for local resource first. Data are always taken from the web server.
pa: ਜੇਕਰ ਸਰਵਰ ਹੈ ਤਾਂ ਪਹਿਲਾਂ ਘਰੇਲੂ ਸਾਧਨ ਚੈਕ ਬੰਦ ਕੀਤਾ ਜਾਵੇ।ਆੰਕੜੇ ਹਮੇਸ਼ਾ ਸਰਵਰ ਤੋਂ ਹੀ ਲਏ ਜਾਂਦੇ ਹਨ
ro: Doar când --server este utilizat, dezactivează mai întâi verificarea pentru resurse locale. Datele sunt întotdeauna luate de pe server

source: In server mode, specify the cache directory used to avoid useless downloads.
pa: ਸਰਵਰ ਮੋਡ ਵਿੱਚ ਕੈਸ਼ ਡਰੈਕਟਰੀ ਦੱਸੋ ਤਾਂਕੀ ਬੇਕਾਰ ਡਾਊਨਲੋਡ ਰੋਕੇ ਜਾਣ
ro: În modul server, specifică dosarul de prestocare pentru a evita descărcarea inutilă.

source: Global drag and drop mode: normal, 2clicks, both. Default mode is normal.
pa: ਗਲੋਬਲ ਚੱਕ ਰੱਖ : ਸਧਾਰਣ,2 ਕਲਿਕਸ,ਦੋਵੇਂ ਮੋਡ।ਸ਼ੁਰੂਆਤੀ ਮੋਡ ਸਧਾਰਣ ਹੈ।
ro: Modul global trage și lasă: normal, 2clicuri, amândouă. Modul implicit este normal.

source: Do not display the background images of activities.
pa: ਕਿ੍ਆਵਾਂ ਦੀ ਪਿਛੋਕੜ ਤਸਵੀਰ ਨਾ ਦਿਖਾਓ
ro: Nu afișa imaginea de fundal a activităților

source: GCompris is free software released under the GPL License. In order to support its development, the Windows version provides only %d of the %d activities. You can get the full version for a small fee at <http://gcompris.net> The GNU/Linux version does not have this restriction. Note that GCompris is being developed to free schools from monopolistic software vendors. If you also believe that we should teach freedom to children, please consider using GNU/Linux. Get more information at FSF: <http://www.fsf.org/philosophy>
pa: ਜੀਕੰਪਿ੍ਸ ਸਾਫਟਵੇਅਰ ਜੀ ਪੀ ਐਲ ਲਾਇਸੈਂਸ ਦੇ ਅਧੀਨ ਪ੍ਕਾਸ਼ਿਤ ਕੀਤਾ ਗਿਆ ਹੈ। ਇਸ ਦੀ ਤਰੱਕੀ ਲਈ ਵਿੰਡੋ ਨੇ %d ਤੇ %d ਕਿ੍ਆਵਾਂ ਦਿੱਤੀਆਂ ਹਨ।ਤੁਸੀ ਪੂਰਾ ਵਰਜ਼ਨ ਥੋੜੇ ਮੁੱਲ ਤੇ ਲੈ ਸਕਦੇ ਹੋ <http://gcompris.net>। GNU/Linux ਰੁਪਾਂਤਰ ਵਿੱਚ ਇਹ ਰੋਕ ਨਹੀ ਹੈ।ਜੀਕੰਪਿ੍ਸ ਸਕੂਲਾਂ ਨੂੰ ਮਨੋਪਲੀ ਸਾਫਟਵੇਅਰ ਵਿਕਰੇਤਾ ਤੋਂ ਬਚਾਉਣ ਲਈ ਬਨਾਇਆ ਗਿਆ ਹੈ।ਜੇ ਤੁਸੀ ਚਾਹੁੰਦੇ ਹੋ ਕਿ ਬੱਚਿਆਂ ਨੂੰ ਅਜ਼ਾਦੀ ਨਾਲ ਪੜਾਇਆ ਜਾਵੇ ਤਾਂ GNU/Linux ਦੀ ਵਰਤੋ ਕਰੋ। ਵਧੇਰੇ ਜਾਣਕਾਰੀ ਲਈ FSF:<http://www.fsf.org/philosophy>

source: GCompris Version: %s Licence: GPL More info at http://gcompris.net
pa: ਜੀਕੰਪਿ੍ਸ %s ਤਰਜਮਾ %s ਲਾਈਸੈਂਸ: ਜੀ ਪੀ ਐਲ ਵਧੇਰੇ ਜਾਣਕਾਰੀ ਲਈ http://gcompris.net खेलगंमत %s
ro: GCompris Versiune: %s Licență: GPL Mai multe informații la http://gcompris.net

source: Use -l to access an activity directly.
ar_tn: استعمل -l للوصول للنشاط مباشرة
pa: ਕਿ੍ਆ ਡਰੈਕਟਰੀ ਨੂੰ ਚਲਾਉਣ ਲਈ -l ਵਰਤੋकोई भी उपक्रम शुरू करने के लिये -l पर्याय का उपयोग करें.
ro: Folosiți -l pentru a accesa activitatea direct.

source: The list of available activities is :
ar_tn: قائمة الأنشطة المتوفرة
pa: ਹਾਜ਼ਰ ਕਿ੍ਆਵਾਂ ਦੀ ਸੂਚੀ :
ro: Lista activităților disponibile:

source: The list of available profiles is:
ar_tn: قائمة الشخوص المتوفرة
pa: ਹਾਜ਼ਰ ਪੋ੍ਫਾਇਲ ਦੀ ਸੂਚੀ :
ro: Lista profilurilor disponibile:

source: Unaffected
ar_tn: التأثير
pa: ਅਛੂਤੀ
ro: Neafectat

source: Users without a class
ar_tn: المسخدمون غير المصنفون
pa: ਯੂਜ਼ਰ ਬੀਨਾ ਜਮਾਤ
ro: Utilizatori în afara clasei

source: Prerequisite
ar_tn: المتطلبات
pa: ਸ਼ੁਰੂਆਤੀ ਜਰੂਰਤਾਂ
ro: Cunoștințe necesare

source: Goal
ar_tn: الهدف
pa: ਟੀਚਾ
ro: Scop

source: Manual
ar_tn: دليل المستخدم
pa: ਗਾਇਡ

source: Credit
ar_tn: الديباجة
pa: ਸਿਹਰਾ
ro: Echipa

source: readme
pa: ਮੈਨੂੰ ਪੜੋ
ro: citește-mă

source: This directory contains the files you create with the GCompris educational suite
pa: ਇਸ ਡਰੈਕਟਰੀ ਵਿੱਚ ਉਹ ਫਾਇਲਾਂ ਨੇ ਜੀਹੜਿਆਂ ਤੁਸੀ ਜੀਕੰਪਿ੍ਸ ਵਿੱਦਿਅਕ ਜੋੜੇ ਨਾਲ ਬਣਾਇਆਂ ਨੇ
ro: Acest directoriu conține fișierele create de setul educațional GCompris

source: Time Elapsed
ar_tn: انتهى الوقت
pa: ਬੀਤਾ ਹੋਇਆ ਸਮਾਂ
ro: Timp Scurs

source: Remaining Time = %d
ar_tn: الوقت المتبقي = %d
pa: ਬਚਿੱਆ ਹੋਇਆ ਸਮਾਂ = %d
ro: Timp rămas = %d

source: Point the mouse and click on the ball, to set the speed and direction of the ball. The closer you click to the centre, the slower the ball moves.
ar_tn: وجّه الفأرة و أنقر على الكرة لتحدد سرعتها و اتجاهها، كلما نقرت أقرب إلى المركز، كلما بطأت سرعة الكرة
ro: Direcționeză șoricelul și fă un click pe minge, pentru a setarea viteza și direcția ei. Cu cât mai aproape de mijloc e click-ul, cu atât mai mică e viteza mingii.

source: Place each image in the order and on the date it was invented. If not sure, research online at wikipedia: http://www.wikipedia.org
ro: Plasează fiecare imagine in ordineă și data când a fost efectuată invenția. Dacă nu ești sigur, cosultă wikipedia on-line: http://www.wikipedia.org.

source: Click and draw
ro: Făceți clic și desenați.

source: Draw the picture by clicking on each blue point in sequence.
ro: Desenează imaginea făcând un click pe fiecare punct albastru consecutiv.

source: Draw the picture by clicking on the blue points.
ro: Desenați imaginea făcând clic pe punctele albastre.

source: Create a line of 4 pieces either horizontally (lying down), vertically (standing up) or diagonally.
ro: Creați o linie din 4 piese orizontală, verticală sau diagonală.

source: Move the items in the bottom left frame to copy their position in the top right model. Below the crane itself, you will find four arrows that let you move items. To select the item to move, just click on it.
ar_tn: حرك الوحدات في الإطار الأسفل اليساري لنسخ مواقعها في النموذج الأعلى اليميني. أسفل الرافعة، سوف تجد أربعة أسهم تستطيع من خلالها تحريك الوحدات. لتأهل الوحدة للتحرك، أنقر عليها فقط
ro: Mutați elementele în cadrul din stânga jos pentru a copia poziția lor în modelul corespunzător de sus. Sub robinet, ve-ți gasi patru săgeți care vă va permite să mutați elementele. Pentru a selecta elemteul pentru mișcare faceți un click pe el.

source: Can count from 1 to 50.
ro: Puteți socoti de la 1 la 50.

source: Draw Number
ro: Desenați numarul

source: Draw the picture by clicking on each numbers in the right order.
ro: Desenați imaginea facând click pe fiecare număr in ordinea corectă.

source: Draw the picture by following numbers
ro: Desenează imaginea urmând numerele

source: svg drawing
ar_tn: الرسم المتجه
ro: desen svg

source: Provincias Argentinas
ro: Provincile din Argentina

source: Polish Voivodship
ro: Voievodatele din Polonia

source: Districts of Turkey
ro: Districtele din Turcia

source: Eastern Districts of Turkey
ro: Districtele Estice ale Turciei

source: Counties of Brazil
ro: Statele federale ale Braziliei

source: In this game, Tux the parachutist needs help to land safely on the fishing boat. He needs to allow for the wind direction and speed.
ar_tn: في هذه اللعبة ' البطريق المظّلي' بحاجة للمساعدة لكي يهبط بسلام على قارب الصيد. عليه أن يأخذ بعين الاعتبار اتجاه الريح و سرعته
ro: În acest joc, Tux parașutistul trebuie ajutat să aterizeze în siguranța pe vasul de pescuit. El trebuie să țină seama de direcția și viteza vântului.

source: Add a language-binding to GCompris.
ro: Adaugă la GCompris o legătură-limbaj

source: An empty python activity to use as a starting point
ro: O activitate python goală pentru a servi ca punct de pornire

source: Python Template
ro: Șablon Python

source: Click on different active elements : engine, rudders and air tanks, in order to navigate to the required depth. There is a close gate on the right. Catch the jewel to open it, then pass through it to reach the next level.
ro: Faceți click pe diferite elemente active: motor, cârme și rezervoarele de apă pentru a naviga la adâncimea necesară. Este o poartă aproape în dreapta. Prinde bijuteria pentru a o deschide și a trece la nivelul următor.

source: The installer is already running.
ro: Instalator este deja pornit.

source: abcdefghijklmnopqrstuvwxyz
ar_tn: أبتثجحخدذرزسشصضطظعغفقكلمنهوي
ro: âăabcdefghiîjklmnopqrsștțuvwxyz

source: Enable sounds
ro: Activați sunetul

source: Warning: the following images cannot be accessed on your system.
ar_tn: تحذير: لا يمكن للصور التالية من الدخول إلى نظامك
ro: Atenție: următoarele imagini nu pot fi accesate pe sistemul dumneavoastra.

source: This is the first plugin in GCompris coded in the Python Programming language.
ro: Acesta este primul modul în GCompris scris în limbajul de programare Python

source: It is now possible to develop GCompris activities in C or in Python. Thanks to Olivier Samys who makes this possible.
ro: Acum este posibil să dezvoltați activități GCompris în C sau Python. Mulțumiri lui Olivier Samys care a făcut acest lucru posibil.

source: Error: We can't find a list of words to play this game.
ar_tn: خطأ : لا يمكنني إيجاد قائمة الكلمات لأشغل هذه اللعبة
ro: Eroare: Nu a fost găsită o listă de cuvinte pentru a putea juca acest joc.

source: Author: Bruno Coudoin Contribution: Pascal Georges, Jose Jorge, Yves Combe Graphics: Renaud Blanchard, Franck Doucet Intro Music: Djilali Sebihi Background Music: Rico Da Halvarez
ro: Autor: Bruno Coudoin Contribuitori: Pascal Georges, Jose Jorge, Yves Combe Grafică: Renaud Blanchard, Franck Doucet Muzică intro: Djilali Sebihi Muzica fundal: Rico Da Halvarez

source: Dynamic module loading is not supported. GCompris cannot load.
ro: Încărcarea dinamică a modulelor nu este suportată. GCompris nu poate încărca.

source: Afrikaans
ro: Africană

source: Breton
ro: Bretonă

source: 800x600 (Default for GCompris)
ro: 800x600 (Implicit pentru GCompris)

source: run GCompris in fullscreen mode.
ro: Lansează GCompris pe tot ecranul

source: run GCompris in window mode.
ro: Lansează GCompris în fereastră.

source: run GCompris with sound enabled.
ro: Lansează GCompris cu sunete

source: run GCompris without sound.
ro: Lansează GCompris fără sunete

source: run GCompris with the default gnome cursor.
ro: rulați GCompris folosind cursorul gnome implicit

source: Do not avoid the execution of multiple instances of GCompris.
ro: Nu evitați folosirea mai multor instanțe de GCompris.

source: GCompris won't start because the lock file is less than %d seconds old.
ro: GCompris nu v-a starta, pentru că fișierul de blocaj are o vechime mai puțin de %d secunde.

source: The lock file is: %s
ro: Fișierul de blocaj este: %s

source: Put any number of images in this directory. You can include these images in your drawings and animations. The image formats supported are jpeg, png and svg.
ro: Pune orice număr de imagini in acest directoriu. Pute-ți include aceste imagini in desenele și animațiile voastre. Imaginile pot fi de tip jpeg, png și svg.

source: Place each image in the order and on the date it was invented. If not sure, research online at wikipedia: &lt;http://www.wikipedia.org&gt;
ar_tn: ضع كل صورة بالترتيب و حسب تاريخ اختراعها. إن لم تكن متأكدا، ابحث في الموقع http://www.wikipedia.org

source: Fish are taken from the Unix utility xfishtank. Images are taken from the National Undersea Research Program (NURP) Collection at &lt;http://www.photolib.noaa.gov&gt; All image credits belong to the OAR/National Undersea Research Program (NURP), except for the first image, which is property of the University of North Carolina at Wilmington. The images used in each level are: Location: Tropical Atlantic Ocean, Florida Keys (image nur00523) Photographer: D. Kesling Location: Florida Keys (image nur03006) Location: Unknown (image nur03505) Location: Unknown (image nur03010) Location: Unknown (image nur03011) Location: Unknown (image nur03013)
ar_tn: أخذت صور السمك من برنامج xfishtank. أخذت صور قاع البحر من مجموعة البرنامج الوطني للبحث في عالم ما تحت البحار الموجودة على الرابط http://www.photolib.noaa.gov. جميع الصور ملك للبرنامج الوطني للبحث في عالم ما تحت البحار ما عدى الصورة الأولى التي تملكها جامعة كارولينا الشمالية بمدينة ولمنغتن الصور المستعملة في كل مستوى هي: الموقع: المحيط الأطلسي. فلوريدا كيز (صورة nur00523) المصور: د. كيسلنغ الموقع: فلوريدا كيز (صورة nur03006) الموقع: غير معروف (صورة nur03505) الموقع: غير معروف (صورة nur03010) الموقع: غير معروف (صورة nur03011) الموقع: غير معروف (صورة nur03013)

source: Click anywhere in the line where you want to drop a piece
ar_tn: أنقر على الخط في المكان الذي تريد اسقاط القطعة فيه

source: Double-Click the mouse to erase the area and discover the background
ar_tn: انقر الفأرة نقرة مضاعفة لمحو الشاشة و اكتشاف الخلفية

source: Double-click the mouse
ar_tn: انقر الفأرة نقرة مضاعفة

source: Double-click the mouse on rectangles until all the blocks disappear.
ar_tn: انقر المستطيلات نقرة مضاعفة حتى تختفي جميع العوائق

source: Soudan
ar_tn: السودان

source: spruce
ar_tn: صنوبر

source: The goal of gcompris is to provide a free alternative to popular proprietary edutainment software
ar_tn: الهدف من تصميم جكومبري هو إيجاد بديل حر و مجاني للبرامج التربوية

source: Improve reading skill and the ability to understand what is read.
ar_tn: تحسين مهارات القراءة و القدرة على فهم ما يقرأ

source: Read and play with the story
ar_tn: اقرأ و العب مع القصة

source: The story of Oscar and friend
ar_tn: قصة أوسكار و صديقه

source: reading
ar_tn: القراءة

source: Add a language-binding to gcompris.
ar_tn: أضف رابط لغوي لجكومبري

source: To balance the scales, move the masses on the left side. The masses can be arranged in any order.
ar_tn: للتوصل إلى توازن بين كفتي الميزان, حرك الكتل الموجودة على الكفة اليمنى. تستطيع أن ترتب الكتل كما تشاء.

source: Error: this activity requires that you first install the packages with gcompris voices for the locale '%s' or '%s'
ar_tn: خطأ: هذا التمرين يتطلب أولاً تحميل <br> الرزم التي مع أصوات جكومبري من أجل موقع%s أو%s

source: Special board that embeds python into gcompris.
ar_tn: لوحة خاصة لتضمن python في جكومبري

source: You have entered Edit mode Move the puzzle items; type 's' to save, and 'd' to display all the shapes
ar_tn: لقد دخلت إلى صيغة التحرير.حرك وحدات اللغز ثم اكتب س للحفظ و ي لتعرض كل الأشكال.

source: The data from this activity are saved under /tmp/gcompris-board.xml
ar_tn: معطيات هاته اللوحة محفوظة في /tmp/gcompris-board.xml

source: Submarine
ar_tn: غواصة

source: Control the depth of a submarine
ar_tn: تحكم في العمق الذي توجد به الغواصة

source: Author: Bruno Coudoin Contribution: Pascal Georges, Jose Jorge Graphics: Renaud Blanchard, Franck Doucet Intro Music: Djilali Sebihi Background Music: Rico Da Halvarez
ar_tn: الديباجة: المصمم: برينو كودوان إسهام: باسكال جورج رسوم: رينو بلانشار موسيقى: جيلالي صبيحي موسيقى خلفية : ريكو داهلفاراز

source: 800x600 (Default for gcompris)
ar_tn: 800x600 (الحجم الإفتراضي)

source: run gcompris in fullscreen mode.
ar_tn: شغل جكومبري مستعملا جميع الشاشة

source: run gcompris in window mode.
ar_tn: شغل جكومبري في نافذة

source: run gcompris with sound enabled.
ar_tn: شغل جكومبري مع تخويل الصوت

source: run gcompris without sound.
ar_tn: شغل جكومبري بدون صوت

source: run gcompris with the default gnome cursor.
ar_tn: شغل جكومبري باستعمال المؤشر الإفتراضي لجنوم
