Repository: MkPereira/gcompris
Catalog: po/*.po
Languages: ar_tn, pa, ro

source: At the beginning of the game four seeds are placed in each house. Players take turns moving the seeds. In each turn, a player chooses one of the six houses under his or her control. The player removes all seeds from this house, and distributes them, dropping one in each house counter-clockwise from the original house, in a process called sowing. Seeds are not distributed into the end scoring houses, nor into the house drawn from. That is, the starting house is left empty; if it contained 12 seeds, it is skipped, and the twelfth seed is placed in the next house. After a turn, if the last seed was placed into an opponent's house and brought its total to two or three, all the seeds in that house are captured and placed in the player's scoring house (or set aside if the board has no scoring houses). If the previous-to-last seed also brought the total seeds in an opponent's house to two or three, these are captured as well, and so on. However, if a move would capture all an opponent's seeds, the capture is forfeited, and the seeds are instead left on the board, since this would prevent the opponent from continuing the game. The proscription against capturing all an opponent's seeds is related to a more general idea, that one ought to make a move that allows the opponent to continue playing. If an opponent's houses are all empty, the current player must make a move that gives the opponent seeds. If no such move is possible, the current player captures all seeds in his/her own territory, ending the game. (Source Wikipedia &lt;http://en.wikipedia.org/wiki/Oware&gt;)
ar_tn: عند بدأ اللعبة ، هنالك أربعة بذور موضوعة في كل منزل. يتناوب اللاعبون في تحريك البذور. في كل دور، يختار لاعب منزلا من المنازل الست. يزيل اللاعب جميع البذور من هذا المنزل و يوزعها على بقية المنازل ، واحدة في كل منزل بعكس اتجاه عقارب الساعة ابتداء من المنزل الأول في عملية تدعى البذر. لا تتوزع البذور في المنازل الأخيرة ولا فى المنزل الصادرة عنه. هذا يعني أن المنزل الأول يبقى فارغاً إذا احتوى على 12 بذرة، فيتم تجاوزه و البذرة الثانية عشرة توضع في المنزل الذي يليه. بعد دورة، إذا وضعت البذرة الأخيرة في المنزل المقابل و أصبح مجموع البذور اثنين أو ثلاثة فإن جميع البذور في ذلك المنزل ستلتقط و توضع في منزل تسجيل نقاط اللاعب (أو توضع جانباً إذا اللاعب ليس لديه منزل تسجيل نقاط). إذا جعلت البذرة ما قبل الأخيرة مجموع بذور منزل الند أن يصبح انين أو ثلاثة فإن هذه البذور ستلتقط أيضاً، و هكذا. و لكن إذا لتقتطت حركة ما جميع بذور المقابل فإن هذا الالتقاط مُصادر و بدلاً ستكون البذور على اليسار في اللوح لأن هذا سيمنع الند من الاستمرار باللعبة. إن هذا الإبعاد نتيجة التقاط جميع بذور الند متعلّق بفكرة عامة و هي أنه على اللاعب القيام بحركة تسمح للند الستمرار باللعب. إذا كانت جميع بيوت الند فارغة فعلى اللاعب الحالي القيام بحركة تعطي بذوراً للند. إذا لم تتواجد إمكانية لحركة كهذه فإن اللاعب الحالي سيلتقط كل البذور الموجودة في منطقته ناهياً اللعبة. (source wikipedia &lt; http://en.wikipedia.org/wikiOware&gt;)
pa: ਖੇਡ ਦੀ ਸ਼ੁਰੂਆਤ ਵਿੱਚ ਹਰ ਘਰ ਵਿੱਚ ਚਾਰ ਬੀਜ ਰੱਖੇ ਹੋਏ ਹਨ। ਖਿਡਾਰੀ ਬੀਜਾਂ ਨੂੰ ਚਲਾ ਕੇ ਆਪਣੀ ਵਾਰੀ ਲੈਂਦੇ ਹਨ।ਹਰ ਖਿਡਾਰੀ ਛੇ ਘਰਾਂ ਵਿੱਚੋਂ ਇੱਕ ਘਰ ਚੁਣਦਾ ਹੈ ਜੋ ਕਿ ਉਸਦੇ ਅਧੀਨ ਹੈ। ਖਿਡਾਰੀ ਉਸ ਚੁਣੇ ਹੋਏ ਘਰ ਵਿੱਚੋਂ ਸਾਰੇ ਬੀਜ ਚੁੱਕ ਲੈਂਦਾ ਹੈ ਅਤੇ ਉਸ ਵਿੱਚੋਂ ਇੱਕ ਬੀਜ ਹਰ ਘਰ ਵਿੱਚ ਕਲਾੱਕ ਵਾਇਜ਼ ਦਿਸ਼ਾ ਵਿੱਚ ਸੁੱਟਦਾ ਜਾਂਦਾ ਹੈ। ਇਸ ਕੰਮ ਨੂੰ ਬੀਜਣਾ ਕਹਿੰਦੇ ਹਨ।ਇਹਨਾਂ ਵਿੱਚੋਂ ਖਿਡਾਰੀ ਇੱਕ ਤਾਂ ਜਿਸ ਘਰ ਵਿੱਚੋਂ ਬੀਜ ਚੁੱਕੇ ਨੇ ਅਤੇ ਜਿਸ ਘਰ ਵਿੱਚੋਂ ਅੰਕ ਮਿਲੇ ਨੇ ਉੱਥੇ ਬੀਜ ਨਹੀਂ ਸੁੱਟ ਸਕਦਾ।ਇਸਦਾ ਮਤਲਬ ਪਹਿਲਾ ਘਰ ਖਾਲੀ ਰਹੇਗਾ। ਜੇ ਇਸ ਘਰ ਵਿੱਚ ਬਾਰਾਂ ਬੀਜ ਨੇ ਤਾਂ ਇਸ ਘਰ ਨੂੰ ਛੱਡ ਦਿੱਤਾ ਜਾਵੇਗਾ ਅਤੇ ਬਾਰਾਂ ਬੀਜ ਅਗਲੇ ਘਰ ਵਿੱਚ ਰੱਖ ਦਿੱਤੇ ਜਾਣਗੇ। ਆਪਣੀ ਵਾਰੀ ਤੋਂ ਬਾਦ ਜੇ ਅਖੀਰਲਾ ਬੀਜ ਵਿਰੋਧੀ ਦੇ ਘਰ ਵਿੱਚ ਰੱਖਦੇ ਹਾਂ ਤਾਂ ਉਸ ਘਰ ਵਿੱਚ ਜਿੱਨੇ ਵੀ ਦੋ ਜਾਂ ਤਿੰਨ ਬੀਜ ਹਨ, ਉਹ ਸਾਰੇ ਬੀਜ ਖਿਡਾਰੀ ਦੇ ਨੰਬਰਾਂ ਵਾਲੇ ਘਰ ਵਿੱਚ ਆ ਜਾਣਗੇ। ਜੇਕਰ ਆਖਰੀ ਤੋਂ ਪਹਿਲਾਂ ਵਾਲਾ ਬੀਜ ਵੀ ਵੀਰੋਧੀ ਦੇ ਦੂਸਰੇ ਜਾਂ ਤੀਸਰੇ ਘਰ ਵਿੱਚ ਰੱਖਿਆ ਜਾਂਦਾ ਹੈ ਤਾਂ ਇਹ ਵੀ ਚੁੱਕ ਲਿੱਤੇ ਜਾਣਗੇ ਅਤੇ ਇਹ ਇਸ ਤਰਾਂ ਹੀ ਚਲਦਾ ਰਹੇਗਾ। ਜੇਕਰ ਇਸ ਚਾਲ ਨਾਲ ਵਿਰੋਧੀ ਦੇ ਸਾਰੇ ਬੀਜ ਚੁੱਕ ਲਏ ਜਾਂਦੇ ਹਨ ਤਾਂ ਇਹ ਸਾਰੇ ਬੀਜ ਫੱਟੇ ਉੱਤੇ ਰੱਖ ਦਿੱਤੇ ਜਾਂਣਗੇ ਅਤੇ ਵਿਰੋਧੀ ਨੂੱ ਅੱਗੇ ਖੇਡਣ ਤੋਂ ਰੋਕ ਦਏਗਾ। ਜੇਕਰ ਵਿਰੋਧੀ ਦੇ ਸਾਰੇ ਘਰ ਖਾਲੀ ਹਨ ਤਾਂ ਖਿਡਾਰੀ ਅਗਲੀ ਚਾਲ ਚੱਲੇਗਾ ਅਤੇ ਵਿਰੋਧੀ ਨੂੰ ਬੀਜ ਦੇਵੇਗਾ। ਜੇਕਰ ਕੋਈ ਅਜਿਹੀ ਚਾਲ ਨਹੀਂ ਹੇ ਤਾਂ ਖਿਡਾਰੀ ਸਾਰੇ ਬੀਜ ਆਪਣੇ ਥੇਤਰ ਵਿੱਚ ਲੈ ਜਾਵੇਗਾ ਅਤੇ ਖੇਡ ਖਤਮ ਕਰ ਦੇਵੇਗਾ।

source: Oware
ar_tn: الوعي
pa: ਓਵੇਅਰ

source: Play the Oware strategy game against Tux
ar_tn: العب ضد البطريق لعبة الوعي الاستراتيجية
pa: ਚਿੰਟੂ ਦੇ ਵਿਰੋਧ ਵਿੱਚ ਓਵੇਅਰ ਸਟਰੈਟਜੀ ਦੀ ਖੇਡ ਖੇਡੋ।
ro: Joacă împotriva lui Tux jocul de strategie Oware

source: The object of the game is to capture more seeds than one's opponent. Since the game has only 48 seeds, capturing 25 is sufficient to accomplish this. Since there are an even number of seeds, it is possible for the game to end in a draw, where each player has captured 24. The game is over when one player has captured 25 or more stones, or both players have taken 24 stones each (draw). If both players agree that the game has been reduced to an endless cycle, each player captures the stones on their side of the board.
ar_tn: إن هدف اللعبة هو التقاط بذور أكثر من بذور المنافس. بما أن في هذه اللعبة 48 بذرة فقط فإن التقاط 25 يكفي للفوز. بما أن هنالك عدد زوجي من البذور يمكن انهاء اللعبة من خلال رسمة حيث كل لاعب يكون قد التقط 24. تنتهي اللعبة عندما يكون أحد اللاعبين قد التقط 25 حجر أو أكثر. أو كلا اللاعبين لديه 24 حجر في كل (رسمة). إذا اتفق اللاعبان أن اللعبة قد تآلت إلى دورة غير منتهية يلتقط كل لاعب الأحجار إلى جانبه من اللوح.
pa: ਇਸ ਖੇਡ ਦਾ ਮੰਤਵ ਵਿਰੋਧੀ ਤੋਂ ਜ਼ਿਆਦਾ ਬੀਜ ਇਕੱਠੇ ਕਰਨਾ ਹੈ।ਇਸ ਖੇਡ ਵਿੱਚ ਪੂਰੇ 48 ਬੀਜ ਹਨ ਜਿਸ ਵਿੱਚੋਂ 25 ਬੀਜ ਲੈਣ ਵਾਲਾ ਖਿਡਾਰੀ ਜਿੱਤ ਜਾਵੇਗਾ। ਜੇਕਰ ਦੋਵਾਂ ਖਿਡਾਰੀਆਂ ਨੇ 24-24 ਬੀਜ ਲੈ ਲਏ ਹਨ ਤਾਂ ਖੇਡ ਬਰਾਬਰੀ ਤੇ ਖਤਮ ਹੋ ਸਕਦੀ ਹੈ। ਜੇਕਰ ਦੋਵੇਂ ਖਿਡਾਰੀ ਚਾਹੁੰਦੇ ਹਨ ਕਿ ਖੇਡ ਅਨੰਤ ਤੱਕ ਚੱਲੇ ਤਾਂ ਉਹ ਆਪਣੇ ਵੱਲ ਫੱਟੇ ਤੇ ਬੀਜ ਰੱਖ ਲੈਂਦੇ ਹਨ।
ro: Scopul jocului este să capturați mai multe semințe decât oponentul dumneavoastră. Deoarece jocul are doar 48 de semințe, capturarea a 25 dintre ele este suficientă pentru a câștiga. Este posibilă de asemenea remiza, în cazul în care fiecare jucator capturează 24 de semințe. Jocul se termină atunci când un jucător capturează 25 sau mai multe semințe, ori in cazul in care amândoi jucătorii au câte 24 fiecare (remiză). Dacă ambii jucători hotărăsc că jocul a ajuns într-o buclă infinită, fiecare jucător capturează semințele de pe partea lui de tablă.

source: Drag and Drop the items to make them match
ar_tn: أمسك و اسحب القطع لجعلها تتناسب
pa: ਚੀਜ਼ਾਂ ਇਕੱਠੀਆਂ ਕਰਨ ਲਈ ਉਹਨਾਂ ਨੂੰ ਮਾਊਸ ਨਾਲ ਘਸੀਟੋ ਅਤੇ ਸਹੀ ਥਾਂ ਤੇ ਰੱਖੋ।
ro: Trageți și plasați elementele pentru a le face să se potrivească

source: In the main board area, a set of objects is displayed. In the vertical box (at the left of the main board) another set of objects is shown, each object in the group on the left matching exactly one object in the main board area. This game challenges you to find the logical link between these objects. How do they fit together? Drag each object to the correct red space in the main area.
ar_tn: في المساحة الأساسية للوحة هناك مجموعة معروضة من الأشياء.في العلبة العمودية (على يسار الوحة الأساسية) تظهر هناك مجموعة أخرى. كل شيء في المجموعة على اليسار مطابق تماماً لأحد الأشياء في المساحة الأساسية للوحة. إن هذه اللعبة تتحداك في إيجاد إلصلة المنطقية بين هذه الأشياء. وكيف تتناسب مع بعضها? اسحب كل شيء منها إلى المنطقة الحمراء الصحيحة.
pa: ਮੁੱਖ ਬੋਰਡ ਦੇ ਖੇਤਰ ਵਿੱਚ , ਵਸਤੂਆਂ ਦਾ ਇੱਕ ਸਮੂਹ ਦਿਖਾਇਆ ਹੋਇਆ ਹੈ। ਸਿੱਧੇ ਖੜੇ ਡੱਬੇ ਵਿੱਚ(ਮੁੱਖ ਬੋਰਡ ਦੇ ਖੱਬੇ ਪਾਸੇ)ਇੱਕ ਹੋਰ ਵਸਤੂਆਂ ਦਾ ਇੱਕ ਸਮੂਹ ਦਿਖਾਇਆ ਹੋਇਆ ਹੈ। ਸਮੂਹ ਦੇ ਖੱਬੇ ਪਾਸੇ ਹਰ ਇੱਕ ਵਸਤੂ ਮੁੱਖ ਬੋਰਡ ਖੇਤਰ ਦੀ ਕਿਸੇ ਇੱਕ ਵਸਤੂ ਨਾਲ ਪੂਰੀ ਮੇਲ ਖਾਂਦੀ ਹੈ।ਇਹ ਖੇਡ ਤੁਹਾਨੂੰ ਇਹਨਾਂ ਵਸਤੂਆਂ ਦੇ ਵਿੱਚ ਲੌਜਿਕਲ ਲਿੰਕ ਲੱਭਣ ਲਈ ਚੈਲੇਂਜ ਕਰਦੀ ਹੈ।ਇਹ ਕਿਵੇਂ ਇੱਕ ਦੂਜੇ ਨਾਲ ਫਿੱਟ ਹੋਣਗੇ ? ਹਰ ਇੱਕ ਵਸਤੂ ਨੂੰ ਚੁੱਕੋ ਅਤੇ ਮੁੱਖ ਬੋਰਡ ਖੇਤਰ ਦੇ ਸਹੀ ਲਾਲ ਜਗਾ ਤੇ ਪਹੁੰਚਾਓ।

source: Matching Items
ar_tn: القطع المتناسبة
pa: ਮੇਲ ਖਾਂਦੀਆਂ ਚੀਜ਼ਾਂ
ro: Potrivirea elementelor

source: Motor coordination. Conceptual matching.
ar_tn: تنسيق الحركات: تطابق حسب المفاهيم
pa: ਮੋਟਰ ਤਾਲ-ਮੇਲ,ਕਨਸੈਪਚੁਅਲ ਮੇਲ-ਜੋਲ
ro: Coordonare motorie. Potrivire de obiecte abstracte.

source: Mouse manipulation: movement, drag and drop. Cultural references.
ar_tn: استعمال الفأرة: تحرك, امسك و اسحب. إشارات ثقافية
pa: ਮਾਊਸ ਦਾ ਇਸਤੇਮਾਲ:ਹਿਲਾਉਣਾ,ਚੁੱਕਣਾ-ਸੁੱਟਣਾ,ਸ਼ਿਸ਼ਟਾਚਾਰ ਸੰਬੰਧੀ
ro: Manipularea mausului: mișcare, trage și lasă. Referințe culturale.

source: Complete the puzzle
ar_tn: أكمل اللغز
pa: ਪਹੇਲੀ ਸੁਲਝਾਉ
ro: Completați puzzle-ul

source: Complete the puzzle by dragging each piece from the set of pieces on the left, to the matching space in the puzzle.
ar_tn: أكمل اللغز بجر كل قطعة من القطع الموضوعة في اليسار إلى الفراغ المطابق في اللغز
pa: ਪਹੇਲੀ ਨੂੰ ਪੂਰਾ ਕਰਨ ਲਈ ਖੱਬੇ ਪਏ ਟੁੱਕੜਿਆਂ ਦੇ ਸਮੂਹ ਵਿੱਚੋਂ ਹਰ ਇੱਕ ਟੁੱਕੜਾ ਚੁੱਕ ਕੇ ਪਹੇਲੀ ਵਿੱਚ ਉਸਦੇ ਨਾਲ ਮੇਲ ਖਾਂਦੀ ਥਾਂ ਤੇ ਰੱਖੋ।
ro: Faceți puzzle-ul tragând fiecare piesă din setul pieselor din stînga în spațiul potrivit din puzzle.

source: Drag and Drop the shapes on their respective targets
ar_tn: امسك و اسحب الأشكال إلى أمكنتها المناسبة
pa: ਆਕਿ੍ਤੀ ਨੂੰ ਚੁੱਕ ਕੇ ਉਸ ਨਾਲ ਸੰਬੰਧਤ ਥਾਂ ਤੇ ਰੱਖੋ।
ro: Trage și Lasă formele în locația adecvată

source: Good mouse-control
ar_tn: تحكم جيد في الفأرة
pa: ਵਧੀਆ ਮਾਊਸ ਸੰਤੁਲਨ
ro: Control bun al șoricelului

source: Hello ! My name is Lock.
ar_tn: السلام عليكم ! اسمي قفل
pa: ਹੈਲੋ ਮੇਰਾ ਨਾਮ ਜਿੰਦਰਾ ਹੈ।
ro: Salut ! Numele meu este Azorel.

source: Lock on the grass.
ar_tn: قفل على العشب
pa: ਜਿੰਦਰਾ ਘਾਹ ਉੱਤੇ ਹੈ

source: Lock with colored shapes.
ar_tn: قفل مع أشكال ملونة
pa: ਜਿੰਦਰਾ ਰੰਗੀਨ ਆਕਿ੍ਤੀ ਨਾਲ
ro: Azorel cu forme colorate.

source: Make the ball go to Tux
ar_tn: اجعل الكرة تذهب الى البطريق
pa: ਗੇਂਦ ਨੂੰ ਚਿੰਟੂ ਵੱਲ ਜਾਣ ਦਿਓ।
ro: Faceți ca mingea să pornească spre Tux.

source: Press the two shift keys at the same time, to make the ball go in a straight line.
ar_tn: اضغط في نفس الوقت على مفتاحي التغيير ، لتجعل الكرة تسير في خط مستقيم
pa: ਗੇਂਦ ਨੂੰ ਸਿੱਧਾ ਭੇਜਣ ਲਈ ਦੋਵੇਂ ਸ਼ਿਫਟ ਬਟਨ ਇਕੱਠੇ ਦਬਾਉ
ro: Tastați shift de două ori pentru a face mingea să meargă în linie dreaptă.

source: Brain
ar_tn: ذكاء
pa: ਦਿਮਾਗ
ro: Creier

source: Don't use the last ball
ar_tn: لا تستخدم الكرة الأخيرة
pa: ਅਖੀਰਲੀ ਗੇਂਦ ਦੀ ਵਰਤੋਂ ਨਾ ਕਰੋ
ro: Nu folosi ultima minge.

source: Logic-training activity
ar_tn: نشاط التدريب المنطقي
pa: ਲੌਜਿਕ ਸਿੱਖੀਆ ਕਿਰਿਆ
ro: Activitate de logică și antrenament.

source: Place balls in the holes. You win if the computer has to place the last ball. If you want Tux to begin, just click on him.
ar_tn: ضع كرات في الحفر. إذا أدخل الحاسوب الكرة الأخيرة، فأنت الرابح. إن أردت أن يبدأ البطريق، فأنقر عليه
pa: ਗੇਂਦ ਨੂੰ ਮੌਰਿਆਂ ਵਿੱਚ ਪਾਓ । ਜੇ ਕੰਮਪਿਓਟਰ ਅਖੀਰਲੀ ਗੇਂਦ ਪਾਂਦਾਂ ਹੈ ਤਾਂ ਤੂਸੀ ਜਿੱਤ ਜਾਓਗੇਂ ।ਜੇ ਤੁਸੀ ਚਾਹੁੰਦੇ ਹੌ ਕਿ ਟਕਸ ਖੇਡ ਸ਼ੁਰੂ ਕਰੇ ਤਾਂ ਉਸ ਤੇ ਕਲਿਕ ਕਰੋ ।
ro: Plasează mingile în găuri. Vei câștiga, dacă calculatorul va fi nevoit să facă ultima mișcare. Dacă dorești ca Tux să inceapă, fă un click pe el.

source: bar game
ar_tn: تعادل
pa: ਬਾਰ ਗੇਮ ।
ro: joc de bar

source: Kick the ball into the black hole on the right
ar_tn: ارم الكرة إلى داخل الحفرة السوداء في اليمين
pa: ਗੇਂਦ ਨੂੰ ਸਜੇ ਕਾਲੇ ਮੋਹਰੇ ਵਿੱਚ ਪਾਓ ।
ro: Împinge mingea spre gaura neagră din dreapta.

source: Kick the ball into the goal
ar_tn: ارم الكرة في المرمى
pa: ਗੇਂਦ ਨੂੰ ਗੋਲ ਵਲ ਮਾਰੋ ।
ro: Împinge mingea spre gol.

source: Mouse-manipulation
ar_tn: استعمال الفأرة
pa: ਮਾਓਸ ਮੈਨਿਪੁਲੇਸ਼ਨ ।
ro: Manipularea-mausului

source: The football game
ar_tn: لعبة كرة القدم
pa: ਫੁੱਟਬਾਲ ਗੈਂਮ ।
ro: Joc de fotbal.

source: Operate a canal lock
ar_tn: شغل قفل القناة
pa: ਇੱਕ ਸੂਏ ਦੇ ਤਾਲਾ ਤੇ ਕਮ ਕਰੋ ।
ro: Operați barajul unui canal

source: Tux is in trouble, and needs to take his boat through a lock. Help Tux and find out how a canal lock works.
ar_tn: البطريق في مشكلة و يريد أن يعبر القناة بقاربه ساعده
pa: ਟਕਸ ਮੂਸ਼ਕਿਲ ਵਿੱਚ ਹੈ । ਅਤੇ ਓਸ ਨੂੰ ਆਪਣੀ ਕਿਸ਼ਤੀ ਨੂੰ ਲੋਕ ਵਿੱਚੌ ਲ਼ਜਾਨ ਦੀ ਲੌੜ ਹੈ ।ਟਕਸ ਦੀ ਮਦਦ ਕਰੋ ।
ro: Tux este în necaz pe vaporul său, trebuie să treacă printr-un baraj. Ajutați-l pe Tux și înțelegeți cum funcționează un baraj.

source: You are in charge of the canal lock. Open the gates and the locks in the right order, so Tux can travel through the gates in both directions.
ar_tn: أنت مسؤول عن قفل القناة افتح البوابات و الأقفال في الترتيب الصحيح ليتمكن البطريق من الترحال عبر البوابات في كلا الاتجاهين.
pa: ਤੁਸੀ ਸੁਏ ਦੇ ਤਾਲੇ ਦੇ ਮੁੱਖੀ ਹੌ । ਦਰਵਾਜੇ ਅਤੇ ਤਾਲੇ ਸਹੀ ਕ੍ਮ ਵਿੱਚ ਖੋਲੋ ਤਾਕਿ ਟਕਸ ਦੋਵੇਂ ਦਿਸ਼ਾਂਵਾਂ ਵਲੌ ਸਫਰ ਕਰ ਸਕੇ ।

source: Chat with your friends
pa: ਆਪਣੇ ਮਿੱਤਰਨਾਲ ਗੱਲ ਬਾਤ ਕਰੋ ।.
ro: Vorbește cu prietenii tăi.

source: This chat activity only works on the local network
pa: ਇਹ ਗੱਲ ਬਾਤ ਕੇਵਲ ਘਰੇਲੂ ਨੇਟਵਰਕ ਲਈ ਹੈ ।
ro: Acest chat va fi disponibil numai în rețeaua locală.

source: This chat activity will only work with other GCompris users on your local network, not on the Internet. To use it, just type in your message and hit Enter. Your message is then broadcast on the local network, and any GCompris program running the chat activity on that local network will receive and display your message.
pa: ਇਹ ਗੱਲ ਬਾਤ ਕਿਰਿਆ ਕੇਵਲ ਜੀਕਮਪਰਾਇਸ ਯੂਜਰ ਤੁਹਾਡੇ ਘਰੇਲੂ ਨੈਟਵਰਕ ਲਈ ਹੈ ਇਨਟਰਨੇਟ ਲਈ ਨਹੀ ।ਇਸਨੂੰ ਵਰਤਨ ਲਈ ਬਸ ਆਪਨਾ ਮੈਸੇਜ ਲਿੱਖੋ ਤੇ ਏੰਟਰ ਦਬੇ ।ਤੂਹਾਡਾ ਮੈਸੇਜ ਫਿਰ ਘਰੇਲੂ ਨੈਟਵਰਕ ਤੇ ਪ੍ਸਾਰਿਤ ਕਿੱਤਾ ਜਾਓਗਾ । ਅਤੇ ਕੌਈ ਵੀ ਘਰੇਲੂ ਨੈਟਵਰਕ ਤੇ ਜਾਰੀ ਜੀਕਮਪਰਾਇਸ ਪੌ੍ਗਰਾਮ ਤੇ ਗੱਲ ਬਾਤ ਕਰ ਰਿਹਾ ਹੋਵੇਗਾ ਤਾਂ ਓਸ ਨੂੰ ਤੁਹਾਡਾ ਮੈਸੇਜ ਵਿੱਖਾ ਦੇਵੇਗਾ ।
ro: Această activitate va fi disponibilă pentru alți utilitori GCompris numai în rețeaua locală, și nu Internet. Pentru a transmite un mesaj, tipărește-l și apasă Enter. Mesajul va fi transmis in rețeaua locală, și fiecare program GCompris lansat în rețea va primi mesajul.

source: Play chess against the computer in a learning mode
ar_tn: العب الشطرنج ضد الحاسوب في صيغة التعلم
pa: ਸਿਖਨ ਲਈ ਕੰਮਪਿਓਟਰ ਨਾਲ ਸ਼ਤੰਰਜ ਖੇਡੋ ।
ro: Jucați șah contra calculatorului într-un mod de învățare

source: Practice chess
ar_tn: تدرب على الشطرنج
pa: ਸ਼ਤੰਰਜ ਖੇਡ ਦਾ ਅਭਿਆਸ ਕਰੋ ।
ro: Exersați șahul

source: Learning chess
ar_tn: تعلم الشطرنج
pa: ਸ਼ਤੰਰਜ ਸਿਖੌ ।
ro: Învățați șah

source: The chess engine is from gnuchess.
ar_tn: محرك الشطرنج هو شطرنج جنو
pa: ਸ਼ਤੰਰਜ ਦਾ ਚਾਲਕ ਗਨੂਸ਼ਤੰਰਜ ਹੈ।
ro: Motorul jocului de șah este cel din gnuchess

source: Chess training. Catch the computer's pawns.
ar_tn: تمارين الشطرنج. استول على بيدق الحاسوب
pa: ਸ਼ਤੰਰਜ ਦਾ ਅਭਿਆਸ ਕੰਮਪਿਓਟਰ ਪਿਆਦਿਆਂ ਨੂੰ ਫਡੋ ।
ro: Antrenament șah. Capturați pionii calculatorului.

source: Play the end of the chess game against the computer
ar_tn: العب نهاية مباراة الشطرنج ضد الحاسوب
pa: ਸ਼ਤੰਰਜ ਦਾ ਅੰਤ ਕੰਮਪਿਓਟਰ ਦੇ ਵਿਰੁਧ ਖੈਡੋ ।
ro: Jucați finalul meciului de șah împotriva calculatorului

source: Chronos
ar_tn: توقيت
pa: ਕਰੋਨਸ

source: Drag and Drop the items to organize the story
ar_tn: امسك و اسحب القطع لتكوين قصة
pa: ਕਹਾਣੀ ਨੂੰ ਇਕੱਠਾ ਕਰਨ ਲਈ ਚੀਜਾਂ ਨੂੰ ਖਿਚੋ ਤੇ ਛਡੇ ।
ro: Trage și Lasă obiecte pentru a aranja povestea

source: Moon photo is copyright NASA. The space sounds come from Tuxpaint and Vegastrike which are released under the GPL license. The transportation images are copyright Franck Doucet. Dates of Transportation are based on those found in &lt;http://www.wikipedia.org&gt;.
pa: ਚੰਨ ਦੀ ਤਸਵੀਰ ਪ੍ਕਾਸ਼ਨ ਨਾਸਾ ।ਪੁਲਾੜ ਅਵਾਜਾਂ ਟਕਸਪੇਂਟ ਅਤੇ ਵੇਗਾਸਟਾ੍ਈਕ ਤੋਂ ਆਇਆ ਜਿਹੜੀਆਂ ਕਿ ਜਿ ਪੀ ਐਲ ਲਾਈਸੈਂਸ ਦੇ ਅਧੀਨ ਪ੍ਕਾਸ਼ਤ ਹੋਇਆ । ਤਸਵੀਰਾਂ ਨੂੰ ਇਕ ਥਾਂ ਤੌ ਦੂਜੀ ਥਾਂ ਤੇ ਲਿਜਾਨ ਦਾ ਅਧਿਕਾਰ ਫਰੈਂਕ ਡਕੇਟ ਕੌਲ ਹੈ । ਢੋਲਾ ਢੁਲਾਈ ਦੀ ਤਾਰੀਖਾਂ ਉਹਨਾਂ ਫੰਡ ਤੇ ਅਧਾਰਿਤ ਹਨ ।
ro: Imaginea Lunii este prezentată cu amabilitate de NASA. Sunetele cosmice vin de la Tux și Vegastrike, care sunt sub licența GPL. Imaginile de transport aparțin Franck Doucet. Datele de transport se bazează pe celel găsite în &lt;http://www.wikipedia.org&gt;

source: Pick from the pictures on the left and put them on the red dots
ar_tn: انتقي من الرسوم الموضوعة على اليسار و ضعها على النقاط الحمراء
pa: ਖੱਬੇ ਪਾਸਿਓ ਤਸਵੀਰਾਂ ਤੋਂ ਚੂਕੋ ਅਤੇ ਓਹਨਾਂ ਨੂੰ ਲਾਲ ਨਿਸ਼ਾਨਾਂ ਤੇ ਰਖੋ ।
ro: Alege din imaginile din dreapta și punele în punctele roșii.

source: Sort the pictures into the order that tells the story
ar_tn: رتب الصور حسب تسلسل القصة
pa: ਕਹਾਣੀ ਦੇ ਮੁਤਾਬੀਕ ਤਸਵੀਰ ਨੂੰ ਤਰਤੀਬ ਦੇ ਵਿੱਚ ਲਾਓ ।
ro: Aranjează imaginile în așa ordine, ca să-ti spună o istorie.

source: Tell a short story
ar_tn: قص قصة قصيرة
pa: ਇੱਕ ਛੋਟੀ ਕਹਾਣੀ ਸੁਨਾਓ ।
ro: Spune o istorioară scurtă.

source: Moonwalker
ar_tn: المشي على القمر
pa: ਚੰਨ ਓੱਤੇ ਚਲਣ ਵਾਲਾ ।

source: Autumn
ar_tn: الخريف
pa: ਪੱਤਝੜ
ro: Toamna.

source: Spring
ar_tn: الربيع
pa: ਬੰਸਤ
ro: Primăvara.

source: Summer
ar_tn: الصيف
pa: ਗਰਮੀ
ro: Vara.

source: The 4 Seasons
ar_tn: الفصول الأربعة
pa: 4 ਰੁਤਾਂ ऋतु
ro: Cele 4 anotimpuri.

source: Winter
ar_tn: الشتاء
pa: ਸਰਦੀ
ro: Iarna.

source: Gardening
ar_tn: الزراعة
pa: ਬਾਗਬਾਨੀ
ro: Grădinărit

source: Tux and the apple tree
ar_tn: البطريق و شجرة التفاح
pa: ਟਕਸ ਅਤੇ ਸਬ ਦਾ ਰੁੱਖ ।
ro: Tux și copacul de mere

source: 1769 Cugnot's fardier
ar_tn: 1769 كوغنوت في فارديير
pa: 1769 ਫਾਰਡੀਅਰ ਕਗਨੋਟ

source: 1829 Stephenson's Rocket Steam locomotive
ar_tn: 1829 ستيفنسن القاطرة البخارية
pa: 1829 ਸਟੈਫੇਸ ਕਗਨੋਟ 1829स्टिफन्स का रॉकेट ਭਾਫ ਇੰਜਨ ।भाप का इंजन
ro: 1829 locomotiva cu aburi a lui Stephenson

source: Transportation
ar_tn: المواصلات
pa: ਆਵਾਜਾਈ परिवहन
ro: Transport

source: 1783 Montgolfier brothers' hot air balloon
ar_tn: 1783 منطاد الأخوين مونجولفير
pa: सन 1783 ਮੋਟਗੋਲਫਾਈਰ ਭਰਾ । ਗਰਮ ਹਵਾ ਦਾ ਫਵਾਰਾ
ro: 1783 balonul cu aer cald al fraților Montgolfier

source: 1880 Clement Ader's Eole
ar_tn: 1880 هوائية كليمونت أدر
pa: सन 1880 ਕਲੇਮੇਂਟ ਐਡਰ ਦਾ ਔਲੇ ।

source: 1906 Paul Cornu First helicopter flight
ar_tn: 1906 أول رحلة على طائرة هليكوبتر لبول كورنو
pa: 1906 ਪੌਲ ਕੋਰਨ 1906 1906 ਪਹਿਲੀ ਹੈਲਿਕਾਪਟਰ ਉਡਾਨ
ro: 1906 Primul zbor al elicopterului al lui Paul Cornu

source: 1791 Comte de Sivrac's Celerifere
pa: 1791 ਕੋਮਟੇ ਡੀ ਸਿਵਾਰਸ ਕਲੈਰਿਫਰ

source: 1903 The Wright brothers' Flyer III
ar_tn: 1903 الطائرة 3 للأخوين رايت
pa: 1903 ਰਾਇਟ ਭਰਾਵਾਂ ਦਾ ਫਲਾਈਅਰ III
ro: 1903 Flyer III al fraților Wright

source: 1909 Louis Bleriot crosses the English Channel
ar_tn: 1909 لويس بليروات يعبر القناة الانقليزية
pa: 1909 ਵਿੱਚ ਲੋਇਸ ਬਲੈਰਾਇਟ ਨੇ ਇਗੰਲਿਸ਼ ਨਹਰ ਪਾਰ ਕਿੱਤੀ ।
ro: 1909 Louis Bleriot traversează canalul Englez

source: Aviation
ar_tn: الطيران
pa: ਹਵਾਈ ਜਹਾਜ ਚਲਾਨ ਦੀ ਕਿਰਿਆ ।
ro: Aviație

source: 1927 Charles Lindbergh crosses the Atlantic Ocean
ar_tn: 1927 شالرز ليندبيرغ يعبر المحيط الأطلسي
pa: 1927ਚਾਰਲਸ ਲਿਡਬ੍ਗ ਨੇ ਅਟਲਾਂਟਿਕ ਸਮੁੰਦਰ ਪਾਰ ਕਿੱਤਾ ।
ro: 1927 Charles Lindbergh traversează Oceanul Atlantic

source: 1934 Hélène Boucher's speed record of 444km/h
ar_tn: 1934 رقم السرعة القياسي 444 كم/ساعة لهيلن بوشر
pa: 1934ਹੈਲਿਨ ਬੋਚਰ ਗਤੀ ਦਾ ਰਿਕਾਰਡ 444ਕਿ.ਮੀ ਪ੍ਤੀ ਘੰਟਾ ।
ro: 1934 Hélène Boucher recordul de viteză de 444km/oră

source: 1947 Chuck Yeager breaks the sound-barrier
ar_tn: 1947 تشك ييغر يخترق جدار الصوت
pa: 1947 ਚੱਕ ਏਗਰ 1947 ਆਵਾਜ ਰੋਕ ਨੂੰ ਤੋੜੀਆ ।
ro: 1947 Chuck Yeager străpunge bariera sunetului

source: 1878 Léon Bollé's "La Mancelle"
pa: 1878 ਲਿਔਨ ਬੈਲੇਜ "ਲਾ ਮਨਸੇਲੇ "

source: 1885 The first petrol car by Benz
ar_tn: 1885 أول سيارة بترول لبنز
pa: 1885ਵਿੱਚ ਪਹਿਲੀ ਪੈਟਰੋਲ ਕਾਰ ਬੇਂਜ ਨੇ ਬਨਾਈ ।
ro: 1885 Prima mașină cu benzină de Benz

source: The car
ar_tn: السيارة
pa: ਕਾਰ
ro: Mașina

source: 1899 Renault "voiturette"
ar_tn: سيارة رينو 1899
pa: 1899 ਰੀਨਾਲਟ " ਟਵੋਈਚੁਰੇਟ"

source: 1923 Lancia Lambda
ar_tn: 1923 لانشيا لامبدا
pa: 1923 ਲੈਂਸਿਆ ਲਾੰਬੜਾ

source: 1955 Citroën ds 19
ar_tn: سيترون 1955
pa: 1955ਸੀਟਰੋਇਨ ਡੀਏਸ 19

source: Cars
ar_tn: سيارات
pa: ਕਾਰਾਂ
ro: Mașini

source: A letter is spoken. Click on the matching letter in the main area. You can listen to the letter again, by clicking on the mouth icon in the bottom box.
ar_tn: قد نطق حرف. انقر على الحرف المطابق في المنطقة الأساسية. بامكانك الإستماع إلى الحرف مجدداً بالنقر على أيقونة الفم في العلبة السفلى
pa: ਇੱਕ ਅਖੱਰ ਬੋਲਿਆ ਜਾਵੇਗਾ । ਨੀਚੇ ਦਿੱਤੇ ਹੋਏ ਡਬੇ ਵੱਚ ਮੁਹ ਬਟਨ ਤੇ ਕਲਿਕ ਕਰ ਕੇ ਤੁਸੀ ਉਸ ਅੱਖਰ ਨੂੰ ਦੁਬਾਰਾ ਸੁਣ ਸਕਦੇ ਹੋ । ਭਾਗ ਵਿੱਚੋਂ
ro: Este pronunțată o literă. Clic pe litera corespunzătoare sunetului din zona principală. Puteți reasculta litera prin clic pe pictograma gurii din chenarul de jos.

source: Click on a letter
ar_tn: انقر على حرف
pa: अक्षर पर बटण दबायें
ro: Făceți clic pe o literă

source: Letter-name recognition
ar_tn: التعرف على الحروف
pa: ਅੱਖਹ ਦੀ ਪਹਿਚਾਨ
ro: Recunoașterea numelor literelor

source: Listen to a letter and click on the right one
ar_tn: استمع إلى نطق حرف ثم انقر على الحرف المناسب
pa: ਅੱਖਹ ਸੁਣੌ ਅਤੇ ਸਹੀ ਥਾਂ ਤੇ ਕਲਿਕ ਕਰੋ ।
ro: Ascultă o scrisoare și faceți clic pe cea corectă

source: Visual letter-recognition. Can move the mouse.
ar_tn: تمييز بصري للأحرف. بتحريك الفأرة
pa: ਵਿਜੁਅਲ ਅੱਖਹ ਦੀ ਪਹਿਚਾਨ । ਮਾਉਸ ਹਿਲਾ ਸਕਦੇ ਹੋ ।
ro: Recunoașterea vizuală a literelor. Se poate mișca șoricelul.

source: Click On Me
ar_tn: انقرني
pa: ਮੇਰੇ ਤੇ ਕਲਿਕ ਕਰੋ ।
ro: Făceți clic pe mine

source: Fish are taken from the Unix utility xfishtank. All image credits belong to Guillaume Rousse.
pa: ਐਕਸਫੀਸ਼ ਟੈਂਕ ਨਾਂ ਦੇ ਯੁਨਿਕਸ ਓਪਭੋਗਤਾ ਵਿੱਚੋ ਮਛੱਲਿਆਂ ਦਿਆ ਤਸਵੀਰਾਂ ਲਿੱਤੀਅ ਗਇਆ ਹਨ । ਸਾਰੇ ਚਿੱਤਰ ਕੈ੍ਡਿਟ ਗੁਇਲਮ ਰਾਓਸ ਦੇ ਹਨ ।
ro: Peștii au fost extrași cu ajutorul programului Unix xfishtank. Imaginile aparțin lui Guillaume Rousse.

source: Left-Click with the mouse on all the swimming fish before they leave the fishtank
ar_tn: انقر على جميع الأسماك قبل أن تغادر الحوض
pa: ਸਾਰਿਆ ਤੈਰਦਿਆਂ ਮਛੱਲਿਆਂ ਦੇ ਮੱਛੀ ਭਾਡੇਂ ਵਿੱਚੋ ਬਾਹਰ ਨਿਕਲਨ ਲਈ ਮਾਓਸ ਨਾਲ ਖਬਾ ਕਲਿਕ ਕਰੋ ।
ro: Faceți clic stânga pe toți peștii care înoată înainte să părăsească acvariul

source: Motor coordination: moving and clicking the mouse.
ar_tn: تنسيق الحركات: تحريك و نقر الفأرة
pa: ਮੋਟਰ ਤਾਲਮੈਲ - ਮਾਉਸ ਨੂੰ ਹਿਲਾਨਾ ਅਤੇ ਕਲਿਕ ਕਰਨਾ ।
ro: Coordonare motorie: mișcare și clic de la maus

source: Use the left mouse button to click on the moving fish.
ar_tn: استخدم زر الفأرة الأيسر للنقر على السمكة المتحركة
pa: ਤੈਰਦਿਆਂ ਮਛੱਲਿਆਂ ਤੇ ਮਾਉਸ ਦਾ ਖਬਾ ਬਟਨ ਦਬੋ ।
ro: Folosiți butonul stâng al șoricelului pentru un click pe peștele ce se mișcă.

source: Distinguish between time-units (hour, minute and second). Set and display time on a clock.
ar_tn: ميز بين الساعات, الدقائق و الثواني. شكل وقتا معينا على الساعة
pa: ਸਮਾਂ ਇਕਾਈ ਵਿੱਚ ਫਰਕ ਕਰੋ (ਘੰਟੇ,ਮਿੰਟ ਅਤੇ ਸੈਕਿੰਟ)ਘੜੀ ਉੱਤੇ ਸਹੀ ਸਮਾਂ ਸੈਟ ਕਰੋ ਅਤੇ ਦਿਖਾਓ ।
ro: Fă diferența între unitățile de măsurat timpul (ora, minutul și secunda). Setează și afișează timpul la un ceas.

source: Learn how to tell the time
ar_tn: تعلم كيف تقرأ الساعة
pa: ਸਮਾਂ ਦਸਨਾ ਸਿੱਖੋ ।
ro: Învață cum să citești ceasul

source: Learning Clock
ar_tn: معرفة الساعة
pa: ਘੜੀ ਸਿੱਖੋ ।
ro: Învățați ceasul

source: Set the clock to the time given, in the time-units shown (hours:minutes or hours:minutes:seconds). Click on the different arrows, and move the mouse, to make the numbers go up or down.
ar_tn: اضبط الساعة على الوقت المعطى، وفقاً لوحدات الوقت الظاهرة لديك: (ساعات:دقائق أو ساعات:دقائق:ثواني). أنقر على الأسهم المختلفة و حرك الكرة، لتجعل الأرقام تذهب إلى الأعلى أو الأسفل
pa: ਦਿੱਤੀਆ ਹੋਇਆ ਸਮਾਂ ਇਕਾਈ ਦੇ ਅਨੁਸਾਰ (ਘੰਟੇ ਮਿੰਟ ਯਾਂ ਘੰਟੇ ਮਿੰਟ ਅਤੇ ਸੈਕਿੰਟ)ਦਿੱਤੇ ਹੋਏ ਸਮੇ ਅਤੇ ਘੜੀ ਨੂੰ ਸੈਟ ਕਰੋ । ਸੰਖਿਆ ਨੂੰ ਵਧਾਨ ਘਟਾਨ ਲਈ ਵਖਰੇ ਨਿਸ਼ਾਨਾ ਤੇ ਕਲਿਕ ਕਰੋ ।ਮਾਓਸ ਨੂੰ ਹਿਲਾਓ ।
ro: Seteaza ceasul la timpul dat, în unitățile arătate (ore:minute sau ore:minute:secunde). Faceți click pe săgeți diferite și mișcați șoricelul pentru a face numerele să se miște în sus sau jos.

source: The concept of time. Reading the time.
ar_tn: مفهوم الوقت قراءة الساعة
pa: ਸਮੇ ਦੀ ਸਂਕਲ । ਸਮਾ ਪੜੋ ।
ro: Conceptul de timp. Citirea timpului.

source: Can move the mouse.
ar_tn: تحريك الفأرة
pa: ਕਿ ਮਾਓਸ ਨੂੰ ਹਿਲਾਇਆ ਜਾ ਸਕਦਾ ਹੈ ।
ro: Poate mișca șoricelul

source: Click on the right color
ar_tn: أنقر على اللون المناسب
pa: ਮਹੀ ਰੰਗ ਤੇ ਕਲਿਕ ਕਰੋ ।
ro: Făceți clic pe culoarea corectă

source: Colors
ar_tn: ألوان
pa: ਰੰਗ
ro: Culori

source: Listen to the color and click on the matching duck.
ar_tn: استمع إلى اسم اللون ثم انقر على البطة المناسبة.
pa: ਰੰਗ ਨੂੰ ਸੁਨੋ ਅਤੇ ਓਸ ਨਾਲ ਮੈਲ ਖਾਂਦੀ ਬੱਤਕ ਤੇ ਕਲਿਕ ਕਰੋ ।
ro: Ascultați numele culorii și faceți clic pe rața asortată.

source: This board teaches you to recognize different colors. When you hear the name of the color, click on the duck wearing it.
ar_tn: هذا اللوح يعلمك تمييز الألوان المختلفة، عندما تسمع اسم اللون، أنقر على البطة التي ترتدي هذا اللون
pa: ਇਹ ਬੋਰਡ ਤੁਹਾਨੂੰ ਵੱਖ ਵੱਖ ਰੰਗਾਂ ਬਾ ਨੂੰ ਚਲਾਓ । ਰੇ ਸਿਖਾਏਗਾ ।ਜਦੋਂ ਤੁਸੀ ਰੰਗ ਦਾ ਨਾਂ ਸੁਨਦੇ ਹੋ ਤਾਂ ਓਸ ਨਾਲ ਮੈਲ ਖਾਂਦੀ ਬੱਤਕ ਤੇ ਕਲਿਕ ਕਰੋ ।
ro: Această tablă te învață să recunoști diferite culori. Când auzi denumirea culorii, faceți un click pe rața corespunzătoare.

source: Colors based activities.
ar_tn: الأنشطة المعتمدة على الألوان
pa: ਰੰਗਾਂ ਤੇ ਅਧਾਰਿਤ ਕਿਰਿਆਵਾਂ ।
ro: Activitățile bazate pe culori.

source: Go to Color activities
ar_tn: اذهب إلى أنشطة الألوان
pa: ਰੰਗਾਂ ਤੇ ਅਧਾਰਿਤ ਕਿਰਿਆਵਾਂ ਵਲ ਜਾਓ ।
ro: Mergi la activitatea Culori

source: Discover the Computer
ar_tn: اكتشف الحاسوب
pa: ਕੰਮਪਿਊਟਰ ਲਭੋ ।
ro: Descoperiți calculatorul
