Repository: MkPereira/gcompris
Catalog: po/*.po
Languages: ar_tn, pa, ro

source: Play with computer peripherals.
ar_tn: العب مع ملحقات الحاسوب
pa: ਕੰਮਪਿਊਟਰ ਦੇ ਅਗਾਂ ਨੂੰ ਚਲਾਓ ।
ro: Jucați-vă cu sistemele periferice a calculatorului.

source: Arrange four coins in a row
ar_tn: رتب أربع قطع نقدية بالتسلسل
pa: ਚਾਰੇ ਸਿਕਿਆਂ ਨੂੰ ਸੀਧ ਵਿੱਚ ਰੱਖੋ।
ro: Arangează monetele în rând.

source: Click the position in the line where you want to drop a piece. You can also use the arrow keys to move the piece left or right, and the down or space key to drop a piece.
pa: ਲਕੀਰ ਦੇ ਓਸ ਥਾਂ ਤੇ ਕਲਿਕ ਕਰੋ ਜਿਥੇ ਤੁਸੀ ਟੁਕੜਾ ਸੂਟਨਾ ਚਾਹੁੰਦੇ ਹੋਂ ।ਤੁਸੀ ਟੁਕੜੇ ਨੂੰ ਸੱਜੇ ਯਾ ਖੱਬੇ ਕਰਨ ਲਈ ਦਿਸ਼ਾਵਾਂ ਵਾਲੇ ਅਤੇ ਟੁਕੜੇ ਨੂੰ ਥਲੇ ਸੁੱਟਣ ਲਈ ਡਾਓਨ ਯਾ ਸਪੈਸ ਬਟਨ ਦੀ ਵਰਤੋ ਕਰ ਸਕਦੇ ਹੋ।
ro: Faceți un click pe pozițila unde doriți să puneți o piesă. De asemenea puteți folosi tastele cu săgeți în stânga și dreapta pentru a misca piesele, și cu săgeata în jos sau spațiu pentru a pune o piesă.

source: Connect 4
ar_tn: اربط 4
pa: 4 ਜੋੜੋ।
ro: Conectați 4

source: Laurent Lacheny. Images and Artificial Intelligence taken from project 4stattack by Jeroen Vloothuis. The original project can be found on &lt;http://forcedattack.sourceforge.net&gt;
ar_tn: إن الصور و الذكاء الصناعي مأخوذة من مشروع 4stattack لجيرون فلوثويس . النسخة الأصلية للمشروع موجودة في &lt, http://forcedattack.sourceforge.net&gt;
pa: ਲੋਣੇਂਟ ਲਚੇਰੀ ।ਚਿੱਤਰ ਅਤੇ ਆਰਟਿਫਿਸ਼ਲ ਇਂਟੈਲੀਜੈਂਸ ,ਜਿਰੋਇਨ ਵਲੂਥੁਇਸ ਦੇ ਪ੍ਰੋਜੈਕਟ 4ਸਟਟੈਟਕ ਤੋਂ ਲਏ ਗਏ ਹਨ ।ਅਸਲੀ ਪ੍ਰੋਜੈਕਟ ਤੁਸੀ ਇੱਥੋ ਲੈ ਸਕਦੇ ਹੋਂ http://forcdattack.sourceforge.net।

source: Connect 4 (2 Players)
pa: ਕਨੈਕੱਟ 4(2 ਖਿਡਾਰੀ)।
ro: Conectați 4 (2 Jucători)

source: Create a line of 4 pieces either horizontally (lying down) or vertically (standing up) or diagonally.
pa: 4 ਟੁਕੜਿਆਂ ਦੀ ਲਕੀਰ ਬਨਾਓ ਭਾਵੇਂ ਲੰਬੀ ਪਈ ਪਈ ਹੋਵੇ , ਸਿੱਧੀ ਖੜੀਯਾ ਤਿਰਛੀ ।
ro: Creați o linie din 4 piese orizontală, verticală sau diagonală.

source: The original code was written in 2005 by Laurent Lacheny. In 2006, Miguel de Izarra made the two players game. Images and Artificial Intelligence taken from project 4stattack by Jeroen Vloothuis. The original project can be found on &lt;http://forcedattack.sourceforge.net&gt;
pa: ਅਸਲੀ ਕੋਡ ਲੋਣੇਂਟ ਲਚੇਰੀ ਨੇ 2004 ਵਿੱਚ ਲਿੱਖਿਆ ਸੀ । 2006 ਵਿੱਚ ਮਿਗੁਲ ਦੇ ਇਜਾਰੇ ਨੇ 2 ਖਿਡਾਰਿਆਂ ਦੀ ਖੇਡ ਬਣਾਈ ।ਚਿੱਤਰ ਅਤੇ ਆਰਟਿਫਿਸ਼ਲ ਇਂਟੈਲੀਜੈਂਸ ,ਜਿਰੋਇਨ ਵਲੂਥੁਇਸ ਦੇ ਪ੍ਰੋਜੈਕਟ 4ਸਟਟੈਟਕ ਤੋਂ ਲਏ ਗਏ ਹਨ ।ਅਸਲੀ ਪ੍ਰੋਜੈਕਟ ਤੁਸੀ ਇੱਥੋ ਲੈ ਸਕਦੇ ਹੋਂ http://forcdattack.sourceforge.net।

source: Build the same model
ar_tn: ابن النموذج نفسه
pa: ਇੱਕ ਸਮਾਨ ਮਾਡਲ ਬਨਾਓ ।
ro: Construiește același model.

source: Drive the crane and copy the model
ar_tn: قد الرافعة و انسخ النموذج
pa: ਕਰੈਨ ਨੂੰ ਚਲਾਓ ਅਤੇ ਮਾਡਲ ਨੂੰ ਕਾਪੀ ਕਰੋ ।
ro: Condu macaraua și copie modelul

source: Motor-coordination
ar_tn: تنسيق الحركات
pa: ਮੋਟਰ ਤਾਲਮੈਲ ।
ro: Coordonare motorie

source: Mouse manipulation
ar_tn: استعمال الفأرة
pa: ਮਾਓਸ ਪਰਿਵਰਤਨ ।
ro: Folosirea șoricelului

source: Colors, sounds, memory...
ar_tn: ألوان و ألحان و ذاكرة ...
pa: ਰੰਗ,ਅਵਾਜ , ਯਾਦ ਸ਼ਕਤੀ ......
ro: Culori, sunete, memorie...

source: Go to discovery activities
ar_tn: اذهب إلى أنشطة الاكتشاف
pa: ਖੋਜ ਕਿ੍ਆਵਾਂ ਵਲ ਜਾਓ ।
ro: Mergi la activitățile de descoperire

source: Basic counting skills
ar_tn: خبرات عد أساسية
pa: ਸਧਾਰਨ ਗਣਨਾ ਹੁਨਰ ।
ro: Îndemânări de numărare

source: Double-entry table
ar_tn: جدول ثنائي
pa: ਡਬਲ ਐਂਟੀ੍ ਸੁਚੀ ।
ro: Tablă cu doua intrări

source: Drag and Drop each proposed item on its destination
ar_tn: امسك و اسحب القطع المقترحة إلى أمكنتها المناسبة
pa: ਹਰੇਕ ਪ੍ਸਤਾਵਿਤ ਚੀਜ ਨੂੰ ਖਿੱਚ ਕੇ ਓਸਦੀ ਮਜਿੰਲ ਤਕ ਪਹੁੰਚਾਓ ।
ro: Trage și Lasă fiecare obiect propus pe destinația sa

source: Drag and Drop the items in the double-entry table
ar_tn: امسك و اسحب القطع في الجدول الثنائي
pa: ਚੀਜ ਨੂੰ ਖਿੱਚ ਕੇ ਡਬਲ ਐਂਟੀ੍ ਸੁਚੀ ਵਿੱਚ ਲੈ ਕੇ ਆਓ ।
ro: Trage și Lasă obiectele în tabla cu două intrări

source: Move the items on the left to their proper position in the double-entry table.
ar_tn: حرك القطع الموجودة فى اليسار إلى أمكنتها المناسبة في الجدول الثنائي
pa: ਖੱਬੇ ਪਾਸੇ ਦਿਆ ਚੀਜ਼ਾਂ ਨੂੰ ਚੱਕ ਕੇ ਡਬਲ ਐਂਟੀ੍ ਸੁਚੀ ਵਿੱਚ ਓਹਨਾਂ ਦੀ ਸਹੀ ਥਾਂ ਤੇ ਰਖੋ ।
ro: Mută elementele din stânga în poziția lor corectă în tabelul cu două-intrări.

source: Click on an item and listen to its target position
ar_tn: انقر على وحدة و اسمع موقعها النهائي
pa: ਚੀਜ ਤੇ ਕਲਿਕ ਕਰੇ ਅਤੇ ਉਹਦੇ ਲਕਸ਼ ਸਥਾਨ ਬਾਰੇ ਸੁਣੋ ।
ro: Faceți click pe un element și ascultati-i poziția inițială

source: A creative board where you can draw freely
ar_tn: لوحة إنشائية لترسم بحرية
pa: ਇੱਕ ਰਚਨਾਤਮਕ ਬੋਰਡ ਜਿਥੇ ਤੁਸੀ ਅਜਾਦੀ ਨਾਲ ਵਾਹ ਸਕਦੇ ਹੋ ।
ro: O tablă creativă unde poți desena liber

source: A simple vector-drawing tool
ar_tn: أداة رسم بسيطة
pa: ਇੱਕ ਅਸਾਨ ਇੱਛਿਤ ਨਕਸ਼ਾਕਸ਼ੀ ਸੰਦ ।
ro: Instrument simplu pentru desen vectorial

source: In this game, children can draw freely. The goal is to discover how to create attractive drawings based on basic shapes: rectangles, ellipses and lines.
ar_tn: في هذه اللعبة يمكن للأطفال الرسم بحرية. الهدف هو تعلم إنشاء لوحة جذابة بناءً على الأشكال الأساسية. مستطيلات، أشكال بيضويّة، و خطوط
pa: ਇਸ ਖੇਡ ਵਿੱਚ ਬੱਚੇ ਅਸਾਨੀ ਨਾਲ ਚਿੱਤਰ ਵਾਹੀ ਕਰ ਸਕਦੇ ਹਨ। ਇਸਦਾ ਟਿਚਾ ਇਹ ਹੈ ਕਿ ਸਾਧਾਰਨ ਆਕਾਰ ਰੈਕਟੈਂਗਲ , ਐਲਿਪਸ , ਅਤੇ ਲਕਿਰਾਂ ਓਤੇ ਅਧਾਰਿਤ ਆਕਰਸ਼ਕ ਚਿੱਤਰਾਂ ਦੀ ਖੋਜ ਕਿੱਦਾਂ ਕਰਿਏ ।
ro: În acest joc, copiii pot desena liber. Scopul jocului este să descopere cum pot crea desene atractive folosind forme fundamentale: dreptunghiuri, elipse si linii.

source: Select a drawing tool on the left, and a color down the bottom, then click and drag in the white area to create a new shape. To save time, you can click with the middle mouse button to delete an object.
ar_tn: اختر أداة رسم من اليسار و لونا من الأسفل ثم انقر و اسحب في المساحة البيضاء. لاختصار الوقت يمكنك النقر بواسطة الزر الأوسط للفأرة لتمحو شيء ما
pa: ਖੱਬੇ ਪਾਸੇ ਨਕਸ਼ਾਕਸ਼ੀ ਸੰਦ ਦੀ ਚੋਨ ਕਰੋ ਅਤੇ ਨਿਚਲੇ ਪਾਸੇ ਰੰਗ ਦੀ ਫੇਰ ਓਸਨੂੰ ਚਿੱਤੇ ਖੇਤਰ ਵਿੱਚ ਖਿੱਚ ਕੇ ਲਿਆਓ ਅਤੇ ਨਵਾਂ ਅਕਾਰ ਬਨਾਓ । ਸਮਾਂ ਬਚਾਓਨ ਲਈ ਲਈ ਤੁਸੀ ਮਾਓਸ ਦੇ ਵਿਚਾਲੇ ਬਟਨ ਦੀ ਵਰਤੋ ਕਰਕੇ ਕਿਸੇ ਚੀਜ ਨੂੰ ਰੱਦ ਕਰ ਸਕਦੋ ਹੋ ।
ro: Selectați un instrument de desenat din stânga, și o culoare de jos, apoi in zona albă faceți clic și trageți pentru a crea o formă nouă. Pentru a economisi timp, puteți face clic pe butonul din mijloc al mausului pentru a șterge un obiect.

source: Create and simulate an electric schema
ar_tn: أنجز و حاكي مخططا الكرونيا
pa: ਇਲੈਕਟਿਕ੍ ਸਕਿਮਾ ਬਨਾਓ ਅਤੇ ਸਿਮੂਲੇਟ ਕਰਕਰੋ ।
ro: Creați și simulați schema electrică

source: Drag electrical components from the selector and drop them in the working area. Create wires by clicking on a connection spot, dragging the mouse to the next connection spot, and letting go. You can also move components by dragging them. You can delete wires by clicking on them. To delete a component, select the deletion tool on top of the component selector. You can click on the switch to open and close it. You can change the rheostat value by dragging its wiper. In order to simulate what happens when a bulb is blown, you can blown it by right-clicking on it. The simulation is updated in real time by any user action.
ar_tn: اسحب المكونات الكهربائية من منتقي المكونات و أسقطها في مساحة العمل. أنشئ أسلاكا من خلال النقر على بقعة الوصل و سحب الفأرة إلى بقعة الوصل التالية ثم افلاتها. يمكنك أيضاً أن تخرك المكوناتبسحبها. يمكنك محو أسلاك بالنقر عليها. لمحو أحد المكونات اختر أداة المحو في أعلى منتقي المكونات.يمكنك النقر على التحويل لفتحه و إغلاقه. يمكنك تغيير قيمة المقاوم المتغير بواسطة سحب ممسحته. من أجل محاكاة ما يجري عند إضاءة المصباح يمكنك أن تشغله من خلال النقر عليه بزر الفأرة الأيمن. يتم تحديث عملية المحاكاة في الوقت الحقيقي لكل حركة.
pa: ਬਿਜਲੀ ਯਤਰਾਂ ਨੂੰ ਸਲੈਕਟਰ ਤੌਂ ਖਿੱਚ ਕੇ ਕੰਮ ਕਰਨ ਦੇ ਖੇਤਰ ਵਿੱਚ ਲਿਆਓ । ਤਾਰਾਂ ਬਨਾਓਣ ਲਈ ਮਾਉਸ ਨੂੰ ਇੱਕ ਜੋੜ ਬਿੰਦੂ ਤੋਂ ਖਿੱਚ ਕੇ ਦੂਜੇ ਜੋੜ ਬਿੰਦੂ ਤਕ ਲਿਆਓ । ਤੁਸੀ ਹੋਰ ਪੁਰਜਿਆਂ ਨੂੰ ਵਿ ਖਿੱਚ ਕੇ ਹਿਲਾ ਸਕਦੇ ਹੋ । ਤੁਸੀ ਤਾਰਾਂ ਨੂੰ ਕਲਿਕ ਕਰ ਕੇ ਰੱਦ ਕਰ ਸਕਦੇ ਹੋ । ਕਿਸੇ ਯੰਤ੍ ਨੂੰ ਰਥ ਕਰਨ ਲਈ ਯੰਤ੍ ਸਲੈਕਟ ਦੇ ਓਪਰੋਂ ਰੱਧ ਕਰਨ ਵਾਲੇ ਸੰਦ ਦੀ ਚੋਣ ਕਰੋ । ਕਿਸੇ ਸਵਿਚ ਨੂੰ ਖੋਲਨ ਅਤੇ ਬੰਦ ਕਰਨ ਲਈ ਉਸ ਤੇ ਕਲਿਕ ਕਰ ਸਕਦੇ ਹੋ । ਤੁਸੀ ਵਾਇਪਰ ਨੂੰ ਖਿੱਚ ਕੇ ਰਿਓਸਟੈਟ ਦੀ ਦਰ ਬਦਲ ਸਕਦੇ ਹੋ । ਬਲਬ ਜਲਨ ਤੇ ਜੋ ਹੁੰਦਾ ਹੈ,ਓਸ ਚੀਜਦੀ ਸਮਾਂਤਰਤਾ ਬਣਾਓਣ ਲਈ ਤੁਸੀ ਉਸ ਤੇ ਸਜਾ ਕਲਿਕ ਕਰਕੇ ਜਗਾ ਸਕਦੇ ਹੋ । ਮੌਕੇ ਤੇ ਖਿਡਾਰੀ ਦੀ ਕਿਸੇ ਹਰਕਤ ਨਾਲ ਸਮਾਂਤਰਤਾ ਸਹੀ ਹੋ ਜਾਵੇਗੀ ।

source: Electricity
ar_tn: الكهرباء
pa: ਬਿਜਲੀ
ro: Electricitate.

source: Freely create an electric schema with a real time simulation of it.
ar_tn: أنشا مخططا الكترونيا بحرية مع محاكاة حقيقية
pa: ਮੌਕੇ ਤੇ ਸਮਾਂਤਰਤਾ ਨਾਲ ਤੁਸੀ ਇਲੈਕਟਿ੍ਕ ਸਕੀਮਾ ਨੂੰ ਅਸਾਨੀ ਨਾਲ ਬਨਾਓ ।
ro: Creați o schemă electrică cu o simulare în timp real a ei.

source: GCompris uses the Gnucap electric simulator as a backend. You can get more information on gnucap at &lt;http://geda.seul.org/tools/gnucap/&gt;.
ar_tn: جكومبري يستخدم المحاكي جنوكب
pa: ਜੀਕੰਮਪਿ੍ਸ ਜਿਐਨਯੂਕੈਪ ਇਲੈਕਟਿ੍ਕ ਸਿਮੁਲੈਟਰ ਨੂੰ ਪਿਛੋਕੜ ਵਰਤਦਾ ਹੈ । ਜਿਐਨਯੂਕੈਪ ਬਾਰੇ ਹੋਰ ਜਾਨਕਾਰੀ http://geda.seul.org/tools/gnucap/ ਲੈ ਸਕਦੇ ਹੋ ।
ro: GCompris folosește simulatorul electric Gnucap. Puteți afla mai mut despre gnucap pe adresa &lt;http://geda.seul.org/tools/gnucap/&gt;.

source: Requires some basic understanding of the concept of electricity.
ar_tn: تتطلب فهما أساسيا للكهرباء
pa: ਬਿਜਲੀ ਬਾਰੇ ਮੁਡਲੀ ਜਾਨਕਾਰੀ ਲੌੜੀਦੀਂ ਹੈ ।
ro: Necesită înțelegere de bază al concepției de electricitate.

source: Basic enumeration
ar_tn: إحصاء أولي
pa: ਮੁਡਲੀ ਗਣੰਨਾ मूलभूत
ro: Enumerare de bază

source: Count the items
ar_tn: عد القطع
pa: ਚੀਾਂ ਨੂੰ ਗਿਣੋ ।
ro: Numărați elementele

source: First, properly organize the items so that you can count them. Then, select the item you want to answer in the bottom right area. Enter the answer with the keyboard and press the OK button or the 'Enter' key.
ar_tn: أولاً، نظم الوحدات لتستطيع عدها. ثم اختر الوحدة التي تريد الإجابة عليها من المساحة اليمنى السفلى. أدخل الإجابة بواسطة لوحة المفاتيح و اضغط زر موافق أو مفتاح إدخال.
pa: ਪਹਿਲਾਂ ਚੀਜਾਂ ਨੂੰ ਸਹੀ ਤਰਾ ਰਖੋ ਤਾ ਕਿ ਓਹਨਾਂ ਦੀ ਗਿਨਤੀ ਕਰ ਸਕੋਂ ।ਫਿਰ ਜਿਸਦਾ ਜਵਾਬ ਦੇਣਾਂ ਹੈ , ਓਸ ਚੀਜ ਦੀ ਸੱਜੇ ਨਨੱਚੋਂ ਤੋ ਚੋਣ ਕਰੋ । ਕਿਬੋਰਡ ਰਾਹੀਂ ਜਵਾਬ ਬਰੋ ਅਤੇ ਓਕੇ ਬਟਨ ਦਬਾਓ ਯਾ ਐਂਟਰ ਬਟਨ ਦਬਾਓ ।
ro: În primul rând organizați elementele pentru să le puteți număra. Apoi selectați elementul la care ve-ți răspunde în partea dreapta de jos. Întroduce-ți răspunsul și tatați OK sau 'Enter'.

source: Numeration training
ar_tn: تدريب قراءة الأعداد
pa: ਸੰਧਿਆਤਮਕ ਅਭਿਆਸ
ro: Exersarea numărării

source: Place the items in the best way to count them
ar_tn: ضع الوحدات بالمكان المناسب لعدها
pa: ਚਿਜ਼ਾਂ ਨੂੰ ਗਿਣਨ ਲਈ ਠੀਕ ਥਾਂ ਤੇ ਰਖੋ ।
ro: Plasați elementele în cea mai bună poziție pentru a fi numărate

source: Animal pictures are taken from the Animal Photography Page of Ralf Schmode (&lt;http://schmode.net/&gt;) and from LE BERRE Daniel. These people kindly gave GCompris the authorization to include their pictures. Thanks a lot, both of you.
ar_tn: رسوم الحيوانات مأخوذة من صفحة صور الحيوانات لرالف شمود )http://schmode.net( أعطى رالف جكومبري الإذن لاستعمال رسومه
pa: ਜਾਨਵਰਾਂ ਦਿਆ ਤਸਵੀਰਾਂ ਰਾਲਫਸ਼ ਮੋਡ (&lt;http://schmode.net/&gt;)ਅਤੇ ਲੀ ਬੈਰੇ ਡੇਨਿਅਲ ਦੇ ਜਾਨਵਰਾਂ ਦਿਆਂ ਤਸਵੀਰਾਂ ਵਾਲੇ ਪੰਨੇ ਤੋਂ ਲਇਆਂ ਗਇਆਂ ਹਨ । ਇਹਨਾਂ ਨੇ ਜੀਕੰਮਪਿ੍ਸ ਨੂੰ ਆਪਣੀਆਂ ਤਸਵੀਰਾਂ ਦੀ ਵਰਤੋ ਦੀ ਇਜਾਜਤ ਦਿੱਤੀ ਹੈ ।ਦੋਨਾਂ ਲਈ ਧੰਨਵਾਦ ।
ro: Imaginile animalelor au fost luate de la Animal Photography Page, facute de Ralf Schmode (&lt;http://schmode.net/&gt;) și de la LE BERRE Daniel. Acești oameni au dat permisiunea de a include imaginile lor în GCompris. Mulțumim mult.

source: Move the mouse
ar_tn: حرك الفأرة
pa: ਮਾਓਸ ਨੂੰ ਹਿਲਾਓ ।
ro: Mutați șoricelul

source: Move the mouse to erase the area and discover the background
ar_tn: حرك الفأرة لمحو الشاشة و اكتشاف الخلفية
pa: ਖੇਤਰ ਨੂੰ ਰੱਧ ਕਰਨ ਲਈ ਮਾਊਸ ਨੂੰ ਹਿਲਾਓ ਅਤੇ ਪਿਛੋਕੜ ਲਭੋ ।
ro: Mutați șoricelul pentru a descoperi fundalul

source: Move the mouse until all the blocks disappear.
ar_tn: حرك الفأرة حتى تختفي جميع العوائق
pa: ਮਾਊਸ ਨੂੰ ਚਲਾਓ ਜਦ ਤਕ ਡੱਬੇ ਗਾਇਬ ਨਾ ਹੋ ਜਾਨ ।
ro: Mișcă mausul până când dispar toate cărămizile.

source: Click the mouse
ar_tn: انقر الفأرة
pa: ਮਾਊਸ ਤੇ ਕਲਿਕ ਕਰੋ ।
ro: Clicați șoricelul

source: Click the mouse on rectangles until all the blocks disappear.
ar_tn: انقر المستطيلات حتى تختفي جميع العوائق
pa: ਮਾਊਸ ਨੂੰ ਆਇਤ ਤੇ ਕਲਿਕ ਕਰੋ ਜਦ ਤਕ ਡੱਬੇ ਗਾਇਬ ਨਾ ਹੋ ਜਾਨ

source: Click the mouse to erase the area and discover the background
ar_tn: انقر الفأرة لمحو الشاشة و اكتشاف الخلفية
pa: ਖੇਤਰ ਨੂੰ ਰੱਧ ਕਰਨ ਲਈ ਮਾਊਸ ਨੂੰ ਹਿਲਾਓ ਅਤੇ ਪਿਛੋਕੜ ਲਭੋ ।

source: Go to experiential activities
ar_tn: أنشطة التجارب
pa: ਪ੍ਯੋਗ ਕਿਰਿਆਵਾਂ ਤੇ ਜਾਓ ।
ro: Mergi la activitățile experimentale

source: Various activities based on physical movement.
ar_tn: نشاطات متعددة بناء على قواعد فيزيائية
pa: ਵਾਸਤਵਿਕ ਹਿਲਜੁਲ ਪ੍ਤੀ ਕਿਰਿਆਵਾਂ ।
ro: Activități diferite bazate pe mișcări fizice.

source: Go to Experimental activities
ar_tn: أنشطة تجريبية
pa: ਪ੍ਯੋਗ ਕਿਰਿਆਵਾਂ ਤੇ ਜਾਓ ।
ro: Mergi la activitățile Experimentale

source: Run gcompris --experimental to see this menu.
ar_tn: شغل gcompris --experimental لتظهر هذه القائمة
pa: ਸੂਚੀ ਨੂੰ ਦੇਖਨ ਲਈ ਜੀਕੰਮਪਿ੍ਸ ਪ੍ਯੋਗਿਕ ਓਪਕਰਨ ਚਲਾਓ ।
ro: Lansați gcompris--experimental pentru a vedea acest meniu

source: Click on any item that has a free block beside it, and it will be swapped with the empty block.
ar_tn: انقر على أي وحدة بجانبها مكان شاغر و سوف تُحول إلى المكان الشاغر.
pa: ਜਿਸ ਚੀਜ ਨਾਲ ਖਾਲੀ ਡੱਬਾ ਹੈ ਉਸਤੇ ਕਲਿਕ ਕਰੋ । ਅਤੇ ਓਹ ਖਾਲੀ ਡੱਬੇ ਵਿੱਚ ਬਦਲ ਜਾਵੇਗਾ ।
ro: Faceți click pe orice element, care are un block liber lângă el și el va fi schimbat cu un block gol.

source: Move each item to make an increasing series: from the smallest to the largest
ar_tn: حرك كل وحدة لتشكيل سلسلة تصاعدية; من الأصغر إلى الأكبر
pa: ਛੋਟੇ ਤੋਂ ਵੱਡੇ ਤਕ ਚੜਦੀ ਲੜੀ ਬਣਾਓਣ ਲਈ ਹਰੇਕ ਚੀਜ ਨੂੰ ਹਿਲਾਓ ।
ro: Mișcați fiecare element pentru a forma o serie în creștere: de la mic la mare

source: Original code taken from the libgnomecanvas demo
ar_tn: الشيفرة الأصلية مأخوذة من عرض libgnomecanvas
pa: ਅਸਲੀ ਕੌਡ ਲਿਬਜੀਨੋਮਕੈਨਵਸ ਡੈਮੋਂ ਤੋਂ ਲਿਆ ਗਿਆ ਹੈ ।
ro: Cod original luat de la versiunea demo libgnomecanavs

source: The fifteen game
ar_tn: اللعبة الخامسة عشر
pa: 15 ਦੀ ਖੇਡ
ro: Jocul cincisprezece.

source: Control the hose-pipe
ar_tn: تحكم في الخرطوم
pa: ਰਬੜ ਦੀ ਨਲੀ ਨੂੰ ਸਭਾਲੋ ।
ro: Controlează furtunul

source: Fine motor coordination
ar_tn: تناسق جيد للحركات
pa: ਵਧਿਆ ਮੋਟਰ ਤਾਲਮੇਲ । मोटर के साथ अच्छा समन्वय
ro: Coordonare motorie fină

source: Move the mouse over the red part of the hose-pipe. This will move it, bringing it, part by part, up to the flowers. Be careful, if you move off the hose, the red part will go back down.
ar_tn: حرّك الفأرة فوق الجزء الأحمر من الخرطوم. هذا سوف يحركه، باحضاره جزءً بجزء إلى الأزهار. انتبه، إذا قمت بتحريك الخرطوم فإن الجزء الأحمر سيعود للأسفل.
pa: ਰਬੜ ਦੀ ਨਲੀ ਦੇ ਲਾਲ ਭਾਗ ਊਪਰੋਂ ਮਾਓਸ ਨੂੰ ਹਿਲਾਓ । ਇਹ ਓਸਨੂੰ ਟੁਕੜਿਆਂ ਵਿੱਚ ਫੁੱਲਾਂ ਤਕ ਲੈ ਆਵੇਗੀ । ਧਿਆਨ ਰਖੋ ਜੇ ਤੁਸੀ ਰਬੜ ਦੀ ਨਲੀ ਓੱਪਰੋ ਹਿਲਾਨਾ ਛੱਡ ਦਿਤਾ ਤਾਂ ਲਾਲ ਭਾਗ ਨਿੱਚੇ ਚਲਾ ਜਾਵੇਗਾ
ro: Mișcați șoricelul peste partea roșie a țevei. În acest mod vă ve-ți mișca, pas cu pas înspre flori. Fiți atenți, dacă ve-ți rata țeava, partea roșie se va întoarce înapoi.

source: Tux needs to water the flowers, but the hose is blocked.
ar_tn: البطريق بحاجة إلى أن يسقي الأزهار و لكن الخرطوم مسدود
pa: ਫੁੱਲਾਂਨੂੰ ਪਾਣੀ ਦੈਨ ਲਈ ਟਕਸ ਦੀ ਲੋਡ ਹੈ ਪਰ ਨਲੀ ਬੰਦ ਹੈ ।
ro: Tux vrea să ude florile, dar furtunul e blocat.

source: Go to Amusement activities
ar_tn: اذهب إلى الأنشطة المسلية
pa: ਮਨੋਰੰਜਨ ਕਿ੍ਆਵਾਂ ਤੇ ਜਾਓ ।
ro: Mergeți la amuzamente

source: Various fun activities.
ar_tn: أنشطة مسلية و متعددة
pa: ਵੱਖ ਵੱਖ ਮਨੋਰੰਜਨ ਕਿ੍ਆਵਾਂ
ro: Diverse activități distractive.

source: gcompris animation
ar_tn: رسوم جكومبري المتحركة
pa: ਜੀਕੰਪੀ੍ਸ ਐਨਿਮੇਸ਼ਨ
ro: animație gcompris

source: gcompris drawing
ar_tn: مرسم جكومبري
pa: ਜੀਕੰਪੀ੍ਸ ਚਿੱਤਰਕਾਰੀ
ro: desen gcompris

source: svg mozilla animation
ar_tn: رسوم موزيلا المتحركة
pa: ਐਸ ਵੀ ਜੀ ਮੋਜਿਲਾ ਐਨਿਮੇਸ਼ਨ
ro: a nimație mozilla svg

source: wordprocessor text
pa: ਵਰਡਪੋ੍ਸੈਸਰ ਟੈਸਟ
ro: procesor de texte

source: Drag and Drop the items to redraw the whole map
ar_tn: أمسك و اسحب القطع لتعيد رسم الخريطة
pa: ਪੂਰੇ ਨਕਸ਼ੇ ਨੂੰ ਦੁਬਾਰਾ ਬਨਾਓਣ ਦੇ ਲਈ ਖਿੱਚੋ ਤੋ ਛੱਡ ਦਿਓ ।
ro: Trage și Lasă obiectele pentru a redesena întreaga țară

source: Locate the countries
ar_tn: حدد مواقع البلدان
pa: ਦੇਸ਼ ਲਭੋ।
ro: Descoperă țările

source: Mouse manipulation: movement, drag and drop
ar_tn: استعمال الفأرة: تحرك, امسك و اسحب
pa: ਮਾਊਸ ਜੋੜ ਤੋੜ ਗਤੀ,ਖਿੱਚਣਾਂ ਤੇ ਛਡਣਾਂ ।
ro: Folosirea șoricelului: mișcare, tragere și plasare

source: Africa
ar_tn: افريقيا
pa: ਅਫੀ੍ਕਾ

source: America
ar_tn: أمريكا
pa: ਅਮਰੀਕਾ
ro: America de Nord

source: Antartica
ar_tn: القارة الأنترتيكية
pa: ਅਟਾਟਿਕਾ
ro: Antarctica

source: Asia
ar_tn: آسيا
pa: ਏਸ਼ਿਆ

source: Continents
ar_tn: قارات
pa: ਮਾਹਦੀਪ
ro: Continente

source: Europe
ar_tn: أوروبا
pa: ਯਰੌਪ
ro: Europa

source: Oceania
ar_tn: اوشينيا
pa: ਮਾਹਸਾਗਰ

source: Alaska
ar_tn: ألاسكا
pa: ਅਲਾਸਕਾ अलास्का

source: Bahamas
ar_tn: الباهاما
pa: ਬਾਹਾਮਾਸ

source: Canada
ar_tn: كندا
pa: ਕਨੇਡਾ

source: Cuba
ar_tn: كوبا
pa: ਕਿਊਬਾਨ

source: Dominican Republic
ar_tn: جمهورية الدومنيك
pa: ਡੋਮਨਿਕਨ ਰੀਪਬਲਿੱਕ
ro: Republica Dominicană

source: Greenland
ar_tn: غرنلندة
pa: ਗੀ੍ਨਲੈਡ
ro: Groenlanda

source: Haiti
ar_tn: هاييتي
pa: ਹੈਇਤੀ

source: Iceland
ar_tn: اسلندة
pa: ਆਇਸਲੈਡ
ro: Islanda

source: Jamaica
ar_tn: جامايكا
pa: ਜਮਾਇਕਾ

source: Mexico
ar_tn: المكسيك
pa: ਮੈਕਸਿਕੋ
ro: Mexic

source: North America
ar_tn: أمريكا الشمالية
pa: ਓੱਤਰ ਅਮਰੀਕਾ
ro: America de nord

source: United States of America
ar_tn: الولايات المتحدة الأمريكية
pa: ਅਮਰੀਕਾ युनायटेड स्टेट्स ऑफ अमेरिका
ro: Statele Unite ale Americii

source: Argentina
ar_tn: الأرجنتين
pa: ਆਰਜਟਿਨਾ

source: Bolivia
ar_tn: بوليفيا
pa: ਬੋਲਿਵਿਆ

source: Brazil
ar_tn: البرازيل
pa: ਬਰਾਜਿਲ
ro: Brazilia

source: Chile
ar_tn: تشيلي
pa: ਚਿੱਲੀ

source: Colombia
ar_tn: كولومبيا
pa: ਕੋਲੰਬਿਆ
ro: Columbia

source: Ecuador
ar_tn: الإكوادور
pa: ਕੁਆਡੋਰ

source: French Guiana
ar_tn: غينيا الفرنسية
pa: ਫਰੈਂਚ ਗੁਇਆਨਾ
ro: Guiana Franceză

source: Guyana
ar_tn: غينيا
pa: ਗੁਇਆਨਾ
ro: Guiana

source: Panama
ar_tn: بنما
pa: ਪਨਾਮਾ

source: Paraguay
ar_tn: البرغواي
pa: ਪੈਰਾਗੁਏ

source: Peru
ar_tn: البيرو
pa: ਪੈਰੂ

source: South America
ar_tn: أمريكا الجنوبية
pa: ਦਖਿੱਣੀ ਅਮਰੀਕਾ
ro: America de Sud

source: Suriname
ar_tn: سورينام
pa: ਸੁਰੀਨਾਮਾ
ro: Surinam

source: Uruguay
ar_tn: أوروغواي
pa: ਉਰਗੁਵੇ

source: Venezuela
ar_tn: فنزويلا
pa: ਵੈਨਿਜੁਏਲਾ

source: Austria
ar_tn: النمسا
pa: ਆਸਟਿ੍ਆ

source: Belgium
ar_tn: بلجيكا
pa: ਬੈਲਜੀਅਮ
ro: Belgia

source: Denmark
ar_tn: الدنمارك
pa: ਡੈਨਮਾ੍ਕ डेन्मार्क
ro: Danemarca

source: Finland
ar_tn: فنلندا
pa: ਫਿਨਲੈਂਡ
ro: Finlanda

source: France
ar_tn: فرنسا
pa: ਫਰਾਂਸ
ro: Franța

source: Germany
ar_tn: ألمانيا
pa: ਜਰਮਨੀ जर्मनी
ro: Germania

source: Ireland
ar_tn: ارلندا
pa: ਆਇਰਲੈਂਡ
ro: Irlanda

source: Italy
ar_tn: إيطاليا
pa: ਇੱਟਲੀ इटली
ro: Italia

source: Luxembourg
ar_tn: لكسمبورغ
pa: ਲਗਜਿਮਬ੍ਗ
ro: Luxemburg

source: Norway
ar_tn: نرويج
pa: ਨਾਰਵੇ
ro: Norvegia

source: Portugal
ar_tn: برتغال
pa: ਪੁਰਤਗਾਲ
ro: Portugalia

source: Spain
ar_tn: إسبانيا
pa: ਸਪੈਨ
ro: Spania

source: Sweden
ar_tn: السويد
pa: ਸਵਿਡਨ
ro: Suedia

source: Switzerland
ar_tn: سويسرا
pa: ਸਵੀਡਜ਼ਰਲੈਡ
ro: Elveția

source: The Netherlands
ar_tn: هولندا
pa: ਨੀਦਰਲੈਡ
ro: Olanda

source: United Kingdom
ar_tn: المملكة المتحدة
pa: ਸੰਯੁਕਤ ਰਾਜ
ro: Regatul Unit al Marii Britanii

source: Western Europe
ar_tn: أوروبا الغربية
pa: ਵੈਸਟ੍ਨ ਯੁਰੋਪ
ro: Europa de Vest

source: Albania
ar_tn: ألبانيا
pa: ਅਲਬਾਨਿਆ

source: Belarus
ar_tn: روسيا البيضاء
pa: ਬੈਲਾਰੁਸ
ro: Bielorusia

source: Bosnia Herzegovina
ar_tn: البوسنا و الهرسك
pa: ਬੋਸਨਿਆ ਹਰਜਗੋਵੀਨਾ
ro: Bosnia și Herzegovina

source: Bulgaria
ar_tn: بلغاريا
pa: ਬਲਗਾਰਿਆ

source: Croatia
ar_tn: كرواتيا
pa: ਕਰੋਏਟਿਆ
ro: Croația

source: Cyprus
ar_tn: قبرص
pa: ਸਾਈਪਰਸ
ro: Cipru

source: Czech Republic
ar_tn: جمهوية التشك
pa: ਜ਼ੈਚ ਰੀਪਬਲਿਕ
ro: Republica Cehă

source: Eastern Europe
ar_tn: أوروبا الشرقية
pa: ਪੂਰਬੀ ਯੂਰਪ
ro: Europa de Est

source: Estonia
ar_tn: استونيا
pa: ਇਸਟੋਨਿਆ

source: Greece
ar_tn: اليونان
pa: ਗੀ੍ਸ
ro: Grecia

source: Hungary
ar_tn: المجر
pa: ਹੰਗਰੀ
ro: Ungaria

source: Latvia
ar_tn: لاتفيا
pa: ਲੈਟਿਵਾ
ro: Letonia

source: Lithuania
ar_tn: لتوانيا
pa: ਲਿਥੁਆਨਾ
ro: Lituania

source: Macedonia
ar_tn: مقدونيا
pa: ਮੈਸੀਡੋਨਿਆ

source: Moldova
ar_tn: مولدوفيا
pa: ਮੋਲਡੋਵਾ

source: Poland
ar_tn: بولندا
pa: ਪੋਲੈਂਡ
ro: Polonia

source: Romania
ar_tn: رومانيا
pa: ਰੁਮਾਨੀਆ
ro: România

source: Russia
ar_tn: روسيا
pa: ਰਸ਼ਿਆ
ro: Rusia

source: Serbia Montenegro
ar_tn: جمهورية الجبل الأسود صربيا
pa: ਸੈਬੇਰਿਆ ਮੋਂਟੈਂਨੇਗਰੋ
ro: Serbia și Muntenegru

source: Slovak Republic
ar_tn: جمهورية سلوفاكيا
pa: ਸਲੋਵਕ ਰਿਪਬਲਿਕ
ro: Republica Slovacă

source: Slovenia
ar_tn: سلوفانيا
pa: ਸਲੋਵਿਆ

source: Turkey
ar_tn: تركيا
pa: ਤੁਰਕੀ
ro: Turcia

source: Ukraine
ar_tn: أوكرانيا
pa: ਯੂਕਰੇਨ
ro: Ucraina

source: Algeria
ar_tn: الجزائر
pa: ਅਲਜਿਰਿਆ

source: Benin
ar_tn: جمهورية بنين
pa: ਬੈਨਿਨ

source: Burkina Faso
ar_tn: بوركينا فاسو
pa: ਬੁਰਕਿਨਾ ਫਾਸੋਂ

source: Cameroon
ar_tn: الكمرون
pa: ਕੈਮਰੂਨ
ro: Camerun

source: Central African Republic
ar_tn: جمهورية افريقيا الوسطى
pa: ਸੈਂਟਰਲ ਅਫਰਿਰਨ ਰਿਪਬਲਿਕ
ro: Republica Centrală Africană

source: Chad
ar_tn: التشاد
pa: ਚਡ
ro: Ciad

source: Djibouti
ar_tn: جيبوتي
pa: ਜੀਬੌਟੀ

source: Egypt
ar_tn: مصر
pa: ਇਜਿਪਟ
ro: Egipt

source: Equatorial Guinea
ar_tn: غينيا الاستوائية
pa: इक्वेटोरेअल
ro: Guinea Equatorială

source: Eritrea
ar_tn: اريتريا
pa: ਏਰੀਟੀ੍ਆ
ro: Eritreea

source: Ethiopia
ar_tn: اثيوبيا
pa: ਈਥੋਪੀਆ
ro: Etiopia

source: Gabon
ar_tn: ألجابون
pa: ਗਬੋਨ

source: Gambia
ar_tn: جامبيا
pa: ਗੈਂਬੀਆ

source: Ghana
ar_tn: غانا
pa: ਧਾਨਾ

source: Guinea
ar_tn: غينيا
pa: ਗੁਹੈਨਾ
ro: Guineea

source: Guinea Bissau
ar_tn: غينيا بيساو
pa: ਗੁਹੈਨਾ ਬਿਸਾਓ
ro: Guineea-Bissau

source: Ivory Coast
ar_tn: ساحل العاج
pa: ਆਈਟਵਰੀ ਕੋਸਟ
ro: Côte d'Ivoire

source: Liberia
ar_tn: ليبيريا
pa: ਲਿਬਿਰੀਆ

source: Libya
ar_tn: ليبيا
pa: ਲਿਬਿਆ
ro: Libia

source: Mali
ar_tn: مالي
pa: ਮਾਲੀ

source: Mauritania
ar_tn: موريتانيا
pa: ਮਾਰੁਤਿਨਿਆ

source: Morocco
ar_tn: المغرب
pa: ਮੋਰਕੋ
ro: Maroc

source: Niger
ar_tn: النيجر
pa: ਨਾਯਗਰ

source: Nigeria
ar_tn: نيجيريا
pa: ਨਾਈਜੇਰਿਆ

source: Northern Africa
ar_tn: إفريقيا الشمالية
pa: ਓੱਤਰ ਅਫਰੀਕਾ
ro: America de Nord

source: Rwanda
ar_tn: روندا
pa: ਰਾਂਵਦਾ
ro: Ruanda

source: Senegal
ar_tn: السنغال
pa: ਸੇਨੇਗਲ

source: Sierra Leone
ar_tn: سيراليون
pa: ਸਿਰੀਆ ਲਿਓਨ

source: Somalia
ar_tn: الصومال
pa: ਸੋਮਲਿਆ

source: Sudan
ar_tn: السودان
pa: ਸੁਦਾਨ

source: Togo
ar_tn: طوجو
pa: ਟੋਗੋ

source: Tunisia
ar_tn: تونس
pa: ਟਯੁਨੇਸ਼ਿਆ

source: Uganda
ar_tn: أوغندا
pa: ਯੁਗਾਂਡਾ

source: Western Sahara
ar_tn: الصحراء الغربية
pa: ਪੱਛਮੀ ਸਹਾਰਾ
ro: Sahara de Vest

source: Angola
ar_tn: أنغولا
pa: ਅਗੋਂਲੀ

source: Botswana
ar_tn: بوتسوانا
pa: ਬੋਸਟਾਵਨਾ

source: Burundi
ar_tn: بورندي
pa: ਬੂਰੁਡੀਂ

source: Democratic Republic of Congo
ar_tn: جمهورية الكونغو الديمقراطية
pa: ਡੈਮੋਕਿ੍ਟਿਕ ਰਿਪਬਲਿਕ ਆਫ਼ ਕਾਗੋਂ ।
ro: Republica Democrată Congo

source: Kenya
ar_tn: كينيا
pa: ਕੈਨਿਆ

source: Lesotho
ar_tn: ليسوتو
pa: ਲਿਸਾਥੋ
ro: Lesoto

source: Madagascar
ar_tn: مدغشقر
pa: ਮਾਦਾਗਾਸਕਰ

source: Malawi
ar_tn: مالاوي
pa: ਮਾਲਵੀ

source: Mozambique
ar_tn: موزمبيق
pa: ਮੋਜਾਂਬਿਕ
ro: Mozambic

source: Namibia
ar_tn: ناميبيا
pa: ਨਾਬਿਆ

source: Republic of Congo
ar_tn: جمهورية الكونغو
pa: ਕਾਗੋਂ ਰੀਪਬਲਿਕ
ro: Republica Congo

source: South Africa
ar_tn: جنوب أفريقيا
pa: ਦਖਣੀ ਅਫਰੀਕਾ
ro: America de Sud

source: Southern Africa
ar_tn: أفريقيا الجنوبية
pa: ਦਖਣੀ ਅਫਰੀਕਾ
ro: Africa de Sud

source: Swaziland
ar_tn: سوزيلاند
pa: ਸਵਿਟਜ਼ਰਲੈਂਡ

source: Tanzania
ar_tn: تنزانيا
pa: ਟਨਜ਼ਾਨਿਆ

source: Zambia
ar_tn: زمبيا
pa: ਜ਼ਾੰਬਿਆ

source: Zimbabwe
ar_tn: زمبابوي
pa: ਜ਼ਿਮਬਾਬਵੋ

source: Drag and Drop the regions to redraw the whole country
pa: ਪੂਰੇ ਦੇਸ਼ ਨੂੰ ਦੁਬਾਰਾ ਬਣਾਉਣ ਲਈ ਉਸਦੇ ਖੇਤਰਾੰ ਨੂੰ ਖਿੱਚੋ ਅਤੇ ਛੱਡੋ
ro: Trage și Lasă regiunile pentru a redesena întreaga țară

source: Locate the region
pa: ਖੇਤਰ ਦਾ ਸਥਾਨ ਦੱਸੋ
ro: Localizați regionul

source: The map of Germany comes from Wikipedia and is released under the GNU Free Documentation License. Olaf Ronneberger and his children Lina and Julia Ronneberger created the German level.
ar_tn: خريطة ألمانيا هي من ويكيبيديا و أصدرت وفق رخصة توثيق جنو المجانية. أولاف رونبربر و ابنتاه ليناو جوليا رونبرغر أنشأوا المستوى الألماني.
pa: ਜਰਮਨੀ ਦਾ ਨਕਸ਼ਾ ਵਿੱਕੀਪੀਡਿਆ ਤੋਂ ਆਇਆ ਹੈ ਅਤੇ ਇਹ ਜੀ ਐ ਯੂ ਦੇ ਮੁਫਤ ਸਾਰਵਜਨਿਕ ਲਾਈਸੈਂਸ ਦੇ ਅਧੀਨ ਪ੍ਕਾਸ਼ਿਤ ਹੋਇਆ ।ਓਲਫ ਰੋਨੇਬਰਜਰ ਅਤੇ ਉਹਨਾਂ ਦੇ ਬੱਚੇ ਲੀਨਾ ਅਤੇ ਜੂਲਿਆ ਨੇ ਜਰਮਨ ਲੈਵਲ ਬਣਾਇਆ ਹੈ।
ro: Harta Germaniei vine de la Wikipedia și este oferită sub licența GNU Free Documentation License. Olaf Ronneberger și copiii lui Lina și Julia Ronneberger au creat nivelul Germaniei.

source: Regions of France
ar_tn: أقاليم فرنسا
pa: ਫਰਾਂਸ ਦੇ ਖੇਤਰ
ro: Regioanele Franței
