Repository: MkPereira/gcompris
Catalog: po/*.po
Languages: ar_tn, pa, ro

source: Click on the black duck
ar_tn: أنقر على الصورة %s
pa: ਕਾਲੀ ਬੱਤਕ ਤੇ ਕਲਿੱਕ ਕਰੋ
ro: Faceți clic pe rața neagră

source: Click on the white duck
ar_tn: أنقر على اللون المناسب
pa: ਚਿੱਟੀ ਬੱਤਕ ਤੇ ਕਲਿੱਕ ਕਰੋ
ro: Faceți clic pe rața albă

source: Select sound locale
ar_tn: اختر موقع صوت
pa: ਅਵਾਜ਼ ਸਥਲ ਦੀ ਚੋਣ ਕਰੋ
ro: Selectați localizarea sonoră

source: ABCDEFGHIJKLMNOPQRSTUVWXYZ
ar_tn: أبتثجحخدذرزسشصضطظعغفقكلمنهوي
pa: ABCDEFGHIJKLMNOPQRSTUVWXYZABCDEFGHIJKLMNOPQRSTUVWXYZ
ro: AÂĂBCDEFGHIÎJKLMNOPQRSȘTȚUVWXYZ

source: Build the same tower in the empty area as the one you see on the right-hand side.
ar_tn: قم ببناء نفس البرج في المنطقة الخالية كالذي تراه علىءاليمين
pa: ਸੱਜੇ ਹੱਥ ਜਿਦਾਂ ਦਾ ਟਾਵਰ ਤੁਸੀ ਵੇਖਿਆ ਹੈ,ਉਹੋ ਜਿਹਾ ਖਾਲੀ ਖੇਤਰ ਵਿੱਚ ਬਣਾਓ
ro: Construiește același turn în partea liberă, ca și turnul din partea dreaptă.

source: Tower of Hanoi
ar_tn: أبراج هانوي مبسطة
pa: ਟਾਵਰ ਆਫ ਹਨੋਈ
ro: Turnul din hanoi

source: Move the entire stack to the right peg, one disc at a time
ar_tn: حركّ الكومة بأكملها إلى الشماعة اليمنى، قرص واحد كل مرة
pa: ਇਕ ਵਾਰ ਵਿੱਚ ਇਕ ਡਿਸਕ,ਇਸ ਨਿਯਮ ਦਾ ਪਾਲਨ ਕਰਦੇ ਹੋਏ ਸਾਰਾ ਢੇਰ ਸੱਜੇ ਪਾਸੇ ਕਰ ਦੋ
ro: Mutați întreaga stiva pe tija din dreapta, câte un disc la fiecare mutare

source: Learn how to read
ar_tn: تعلم القراءة
pa: ਪੜਨਾ ਸਿੱਖੋ
ro: Învățați citirea

source: left
ar_tn: يسار
pa: ਖੱਬੇ
ro: stânga

source: right
ar_tn: يمين
pa: ਸੱਜੇ
ro: dreapta

source: Look at your position, then switch back to invisible mode to continue your moves
ar_tn: أنظر إلى موقعك ثم تحول إلى الأسلوب الخفي لمتابعة حركاتك
pa: ਆਪਣਾ ਸਥਾਨ ਦੇਖੋ,ਫਿਰ ਚੱਲਣ ਲਈ ਵਾਪਸ ਅਦਿ੍ਸ਼ ਸ਼ੈਲੀ ਵਿੱਚ ਆ ਜਾਵੋ
ro: Vizualizați-vă poziția, apoi reveniți la modul invizibil pentru a continua să mutați

source: Look at your position, then switch back to 3D mode to continue your moves
ar_tn: أنظر إلى موقعك ثم تحول إلى الأسلوب 3D لمتابعة حركاتك
pa: ਆਪਣਾ ਸਥਾਨ ਦੇਖੋ,ਫਿਰ ਚੱਲਣ ਲਈ ਵਾਪਸ 3ਡੀ ਸ਼ੈਲੀ ਵਿੱਚ ਆ ਜਾਵੋ
ro: Vizualizați-vă poziția, apoi reveniți la modul 3D pentru a continua să mutați

source: Memory
ar_tn: ذاكرة
pa: ਸਿਮਰਨ-ਸ਼ਕਤੀ
ro: Memorie

source: Find the matching pair
ar_tn: جد الزوج المتلائم
pa: ਮੇਲ ਖਾਂਦਾ ਜੋੜਾ ਲੱਭੋ
ro: Găsiți perechea potrivită

source: Main Menu Second Version
ar_tn: القائمة الأساسية. نسخة ثانية
pa: ਮੁੱਖ਼ ਸੂਚੀ ਦੂਸਰਾ ਰੁਪਾਂਤਰ
ro: Meniul Principal Versiunea a II-a

source: Select a Board
ar_tn: اختر لوحة
pa: ਬੋਰਡ ਦੀ ਚੋਣ ਕਰੋ
ro: Selectați o tablă

source: Control fall speed with up and down arrow keys.
pa: ਰਫਤਾਰ ਤੇ ਕਾਬੂ ਕਰਨ ਲਈ ਉੱਪਰ ਨੀਚੇ ਬਟਨਾਂ ਦੀ ਵਰਤੋ ਕਰੋ
ro: Controlați viteza căderii cu săgețile sus și jos.

source: Move the plane to catch the clouds in the correct order
ar_tn: حرك الطائرة لتمسك بالسحاب حسب الترتيب الصحيح
pa: ਬਦਲਾਂ ਨੂੰ ਫੜਨ ਲਈ ਜਹਾਜ਼ ਨੂੰ ਸਹੀ ਢੰਗ ਨਾਲ ਚਲਾਓ
ro: Mutați avionul pentru a prinde norii în ordinea corectă

source: Python Board
ar_tn: لوحة بايثون
pa: ਸੱਪ ਸੀੜੀ
ro: Tablă Python

source: Select a profile:
ar_tn: اختر لوحة
pa: ਪੋ੍ਫਾਇਲ ਦੀ ਚੋਣ ਕਰੋ
ro: Selectați profilul:

source: Filter
ar_tn: مصفاة
pa: ਫਿਲਟਰ
ro: Filtru

source: Select all
ar_tn: اختر الكل
pa: ਸਾਰੇ ਸਲੈਕਟ ਕਰੋ
ro: Selectați totul

source: Unselect all
ar_tn: لا تختر الكل
pa: ਸਾਰੇ ਰੱਦ ਕਰੋ
ro: Deselectați totul

source: Locales
ar_tn: مواقع
pa: ਧੁਰਾ
ro: Locale

source: Locales sound
pa: ਅਵਾਜ਼ ਦਾ ਧੁਰਾ
ro: Sunete locale

source: Wordlist
ar_tn: قائمة كلمات
pa: ਸ਼ਬਦ ਸੂਚੀ

source: Login
ar_tn: الدخول
pa: ਲੌਗਿਨ
ro: Autentificare

source: Main menu
ar_tn: قائمة الإختيارات الرئيسية
pa: ਮੁੱਖ਼ ਸੂਚੀ
ro: Meniul principal

source: Active
pa: ਚਾਲੂ
ro: Activ

source: Board title
pa: ਬੋਰਡ ਦਾ ਸਿਰਲੇਖ
ro: Titlul tablei

source: Filter Boards difficulty for profile %s
pa: %s ਪੋ੍ਫਾਇਲ ਵਿੱਚ ਫਿਲਟਰ ਬੋਰਡ ਦੀ ਮੁਸ਼ਕਿਲ
ro: Filtrează dificultatea tablelor în funcție de profil %s

source: <span size='x-large'> Select the difficulty range for profile <b>%s</b></span>
pa: <span size='x-large'>ਪੋ੍ਫਾਇਲ ਲਈ <b>%s</b></span> ਕਠਿਨਤਾ ਦੀ ਚੋਣ ਕਰੋ
ro: <span size='x-large'> Alegeți nivelul de dificultate pentru profil <b>%s</b></span>

source: Editing a Class
ar_tn: تنقيح درس
pa: ਸ਼ੇ੍ਣੀ ਠੀਕ ਕਰੋ

source: Editing class:
ar_tn: تنقيح الدرس
pa: ਸੰਪਾਦਨ ਸ਼ੇ੍ਣੀ

source: Editing a new class
ar_tn: تنقيح درس جديد
pa: ਨਵੀ ਸ਼ੇ੍ਣੀ ਠੀਕ ਕਰੋ

source: Class:
ar_tn: درس
pa: ਸ਼ੇ੍ਣੀ
ro: Clasă:

source: Teacher:
ar_tn: مدرس
pa: ਅਧਿਆਪਕ
ro: Învățător:

source: Assign all the users belonging to this class
ar_tn: ألحق جميع المستعملين بهذا القسم
pa: ਇਸ ਸ਼ੇ੍ਣੀ ਦੇ ਨਾਲ ਸੰਬਧਿਤ ਸਾਰੇ ਖਿਡਾਰਿਆਂ ਦੀ ਚੋਣ ਕਰੋ
ro: Atribue utilizatorii, ce aparțin clasei.

source: First Name
ar_tn: الاسم الأول
pa: ਪਹਿਲਾ ਨਾਮ
ro: Numele

source: Last Name
ar_tn: اسم العائلة
pa: ਅਖੀਰਲਾ ਨਾਮ
ro: Prenumele

source: You need to provide at least a name for your class
ar_tn: عليك الادلاء باسم واحد على الأقل لدرسك
pa: ਤੁਹਾਨੂੰ ਆਪਣੀ ਸ਼ੇ੍ਣੀ ਲਈ ਕੋਈ ਇੱਕ ਨਾਮ ਦੇਣ ਹੀ ਪਵੇਗਾ
ro: Oferiți un nume pentru clasă.

source: There is already a class with this name
ar_tn: هناك درس بهذا الاسم موجود مسبقاً
pa: ਇਸ ਨਾਮ ਨਾਲ ਸੰਬਧਿਤ ਪਹਿਲਾਂ ਹੀ ਸ਼ੇ੍ਣੀ ਮੌਜੂਦ ਹੈ
ro: Deja este o clasă cu acest nume

source: Class
ar_tn: درس
pa: ਸ਼ੇ੍ਣੀ
ro: Clasă

source: Teacher
ar_tn: مدرس
pa: ਅਧਿਆਪਕ
ro: Învățător

source: Editing a Group
pa: ਸਮੂਹ ਨੂੰ ਠੀਕ ਕਰੋ

source: Editing group:
pa: ਸਮੂਹ ਨੂੰ ਠੀਕ ਕਰੋ

source: for class:
pa: ਸ਼ੇ੍ਣੀ ਲਈ
ro: pentru clasa:

source: Editing a new group
pa: ਨਵੇ ਸਮੂਹ ਨੂੰ ਠੀਕ ਕਰੋ
ro: Redactarea unui grup nou

source: Group:
pa: ਸਮੂਹ
ro: Grupa:

source: Description:
ar_tn: الوصف
pa: ਵਰਨਣ
ro: Descriere:

source: Assign all the users belonging to this group
pa: ਇਸ ਸਮੂਹ ਦੇ ਨਾਲ ਸੰਬਧਿਤ ਸਾਰੇ ਖਿਡਾਰਿਆਂ ਦੀ ਚੋਣ ਕਰੋ
ro: Repartizați toți utilizatorii care aparțin grupului dumneavoastră

source: You need to provide at least a name for your group
pa: ਤੁਹਾਨੂੰ ਆਪਣੀ ਸਮੂਹ ਲਈ ਕੋਈ ਇੱਕ ਨਾਮ ਦੇਣ ਹੀ ਪਵੇਗਾ
ro: Trebuie să furnizați cel puțin un nume pentru grupul dumneavoastră

source: There is already a group with this name
pa: ਇਸ ਨਾਮ ਨਾਲ ਸੰਬਧਿਤ ਪਹਿਲਾਂ ਹੀ ਸਮੂਹ ਮੌਜੂਦ ਹੈ
ro: Există un grup cu acest nume

source: Select a class:
ar_tn: اختر لوحة
pa: ਸ਼ੇ੍ਣੀ ਦੀ ਚੋਣ ਕਰੋ
ro: Selectați o clasă:

source: Group
pa: ਸਮੂਹ
ro: Grupa

source: Description
ar_tn: الوصف
pa: ਵਰਨਣ
ro: Descriere

source: You must first select a group in the list
pa: ਤੁਹਾਨੂੰ ਪਹਿਲਾਂ ਸੂਚੀ ਵਿੱਚੋਂ ਸਮੂਹ ਦੀ ਚੋਣ ਕਰਨੀ ਪਵੇਗੀ
ro: Selectează o grupă din listă

source: Birth Date
pa: ਜਨਮ ਤਿਥੀ
ro: Data nașterii

source: Select a user:
pa: ਖਿਡਾਰੀ ਦੀ ਚੋਣ ਕਰੋ
ro: Selectați un utilizator:

source: All users
pa: ਸਾਰੇ ਖਿਡਾਰੀ
ro: Toți utilizatorii

source: Default
pa: ਡਿਫਾਲਟ
ro: Implicit

source: Reset
pa: ਦੁਬਾਰਾ ਸੈਟ ਕਰੋ
ro: Resetare

source: Date
pa: ਤਿਥੀ
ro: Data

source: User
pa: ਖਿਡਾਰੀ
ro: Utilizator

source: Board
pa: ਬੋਰਡ
ro: Tabla

source: Level
ar_tn: مستوى
pa: ਦਰਜਾ
ro: Nivel

source: Sublevel
pa: ਛੋਟਾ ਦਰਜਾ
ro: Subnivel

source: Duration
pa: ਅਵਧੀ
ro: Durata

source: Status
pa: ਹਾਲਤ
ro: Statut

source: Boards
pa: ਬੋਰਡ
ro: Table

source: Groups
ar_tn: مجموعات
pa: ਸਮੂਹ
ro: Grupe

source: Profiles
ar_tn: ملفات
pa: ਪੋ੍ਫਾਇਲ
ro: Profiluri

source: Reports
pa: ਸੂਚਨਾ
ro: Rapoarte

source: Users
ar_tn: مستخدمين
pa: ਖਿਡਾਰੀ
ro: Utilizatori

source: Classes
ar_tn: صفوف
pa: ਸ਼ੋ੍ਣੀ
ro: Clase

source: Editing a Profile
ar_tn: تعديل ملف
pa: ਪੋ੍ਫਾਇਲ ਠੀਕ ਕਰੋ प्रोफाईल का संपादन करें
ro: Redactare Profil

source: Editing profile:
ar_tn: تعديل الملف
pa: ਪੋ੍ਫਾਇਲ ਠੀਕ ਕਰਨਾ
ro: Redactare profilului:

source: Editing a new profile
ar_tn: تعديل ملف جديد
pa: ਨਵਾ ਪੋ੍ਫਾਇਲ ਠੀਕ ਕਰੋ
ro: Redactarea profilului nou

source: Profile:
ar_tn: ملف
pa: ਪੋ੍ਫਾਇਲ
ro: Profil:

source: Assign all the groups belonging to this profile
pa: ਇਸ ਪੋ੍ਫਾਇਲ ਨਾਲ ਸੰਬਧਿਤ ਸਾਰੇ ਸਮੂਹ ਦੀ ਚੋਣ ਕਰੋ
ro: Asociază toate grupurile aparținând acestui profil

source: You need to provide at least a name for your profile
pa: ਤੁਹਾਨੂੰ ਆਪਣੀ ਪੋ੍ਫਾਇਲ ਲਈ ਕੋਈ ਇੱਕ ਨਾਮ ਦੇਣ ਹੀ ਪਵੇਗਾ
ro: Setați un nume pentru profil

source: There is already a profile with this name
pa: ਇਸ ਨਾਮ ਨਾਲ ਸੰਬਧਿਤ ਪਹਿਲਾਂ ਹੀ ਪੋ੍ਫਾਇਲ ਮੌਜੂਦ ਹੈ
ro: Deja este un profil cu așa nume

source: Profile
pa: ਪੋ੍ਫਾਇਲ
ro: Profil

source: [Default]
pa: [ਡਿਫਾਲਟ]
ro: [Implicit]

source: Editing a User
pa: ਖਿਡਾਰੀ ਵਿੱਚ ਬਦਲਾਵ ਕਰੋ
ro: Redactare Utilizator

source: Editing a User
pa: ਖਿਡਾਰੀ ਵਿੱਚ ਬਦਲਾਵ ਕਰੋ
ro: Redactare Utilizator

source: Editing a new user
pa: ਨਵੇ ਖਿਡਾਰੀ ਵਿੱਚ ਬਦਲਾਵ ਕਰੋ
ro: Redactare utilizatorului nou

source: Login:
pa: ਲਾਗਿਨ
ro: Utilizator:

source: First name:
pa: ਪਹਿਲਾ ਨਾਮ
ro: Numele:

source: Last name:
ar_tn: مؤقت سريع
pa: ਅਖੀਰਲਾ ਨਾਮ
ro: Prenumele:

source: Birth date:
pa: ਤਿਥੀ
ro: Data de naștere:

source: You need to provide at least a login, first name and last name for your users
pa: ਤੁਹਾਨੂੰ ਆਪਣੇ ਖਿਡਾਰੀ ਲਈ ਲੌਗੀਨ,ਪਹਿਲਾ ਨਾਮ ਅਤੇ ਅਖੀਰਲਾ ਨਾਮ ਦੇਣਾ ਜ਼ਰੂਰੀ ਹੈ
ro: Setați un login, nume și prenume pentru utilizatori.

source: There is already a user with this login
pa: ਇਸ ਲੌਗੀਨ ਦਾ ਖਿਡਾਰੀਪਹਿਲਾਂ ਹੀ ਪੋ੍ਫਾਇਲ ਮੌਜੂਦ ਹੈ
ro: Deja există utilizator cu așa nume

source: To import a user list from a file, first select a class. FILE FORMAT: Your file must be formatted like this: login;First name;Last name;Date of birth The separator is autodetected and can be one of ',', ';' or ':'
pa: ਫਾਈਲ ਵਿੱਚੋਂ ਖਿਡਾਰੀਆਂ ਦੀ ਸੂਚੀ ਕੱਡਣ ਲਈ ਪਹਿਲਾਂ ਸ਼ੇ੍ਣੀ ਦੀ ਚੋਣ ਕਰੋ . ਫਾਈਲ ਰੂਪ ਰੇਖਾ : ਤੁਹਾਡੀ ਫਾਇਲ ਦੀ ਰੂਪ ਰੇਖਾ ਇਸ ਤਰਾਂ ਹੋਇਗੀ। ਲੌਗਿਨ : ਪਹਿਲਾ ਨਾਮ,ਅਖੀਰਲਾ ਨਾਮ, ਜਨਮ ਤਿਥੀ . ਵੱਖ ਚਿਨੰ ਆਪਣੇ ਆਪ ਲੱਭਿਆ ਜਾਂਦਾ ਹੈ ਅਤੇ ਇਹਨਾਂ ਵਿੱਚੋਂ ਇੱਕ ਹੋ ਸਕਦਾ ਹੈ`,',`;' ਯਾ `:'

source: One or more logins are not unique ! You need to change them: %s !
pa: ਇੱਕ ਯਾ ਇੱਕ ਤੋਂ ਜਿਆਦਾ ਲੌਗਿਨ ਵੱਖ ਨਹੀ ਹਨ।ਉਹਨਾਂ ਨੂੰ ਬਦਲਨਾ ਪਵੇਗਾ।

source: SVG is disabled. Install python xml module to enable it
ar_tn: SVC غير مفعل، لتفعيله عليك تركيب python xml module
pa: SVG ਬੰਦ ਹੈ।ਇਸ ਨੂੰ ਚਲਾਉਣ ਲਈ python xml module ਸਥਾਪਿਤ ਕਰੋ।SVG पर्याय नष्ट हुआ है. SVG फिरसे शुरू करने के लिये python xml module कार्यरत करें.
ro: SVG este dezactivat. Instalează modulul python xml pentru a îl activa

source: The corresponding items have been skipped.
pa: ਇਸਦੇ ਨਾਲ ਸੰਬਧਿਤ ਚੀਜਾਂ ਹਟਾ ਦਿੱਤੀਆਂ ਗਈਆਂ ਹਨ।
ro: Elementele următoare au fost omise.

source: All messages will be displayed here.
pa: ਸਾਰੇ ਸੰਦੇਸ਼ ਇੱਥੇ ਦਿਖਾਏ ਜਾਣਗੇ
ro: Toate mesajele vor fi afișate aici.

source: Your Friends
pa: ਤੁਹਾਡੇ ਮਿੱਤਰ
ro: Prietenii tăi

source: Your Channel
pa: ਤੁਹਾਡਾ ਮਾਰਗ
ro: Canalul tău

source: Type your message here, to send to other GCompris users on your local network.
pa: ਲੋਕਲ ਨੈਟਵਰਕ ਅਤੇ ਹੋਰ ਜੀਕੰਮਪਿ੍ਸ ਖਿਡਾਰਿਆਂ ਨੂੰ ਆਪਣਾ ਸੰਦੇਸ਼ ਭੇਜਣ ਲਈ ਇੱਥੇ ਲਿੱਖੋ
ro: Scrie mesajul aici, pentru a-l trimite altor utilizatori de GCompris din rețeaua ta locală.

source: Your friends must set the same channel in order to communicate with you
pa: ਤੁਹਾਡੇ ਮਿੱਤਰ ਨੂੰ ਤੁਹਾਡੇ ਨਾਲ ਗਲ ਕਰਨ ਲਈ ਇੱਕੋ ਜਿਹੇ ਮਾਰਗ ਦੀ ਚੋਣ ਕਰਨੀ ਪਵੇਗੀ
ro: Prietenii tăi trebuie să seteze același canal pentru a putea comunica cu tine

source: Cannot find the 'gnucap' electric simulator. You can download and install it from: <http://geda.seul.org/tools/gnucap/> To be detected, it must be installed in /usr/bin/gnucap or /usr/local/bin/gnucap. You can still use this activity to draw schematics without computer simulation.
pa: ਜੀਐਨਯੂਕੈਪ ਇਲੈਕਟਿ੍ਕ ਸਿਮੂਲੇਟਰ ਨਹੀ ਲੱਭਿਆ ਜਾ ਸਕਦਾ ਹੈ।ਤੁਸੀ ਇਸ ਤੋਂ <http://geda.seul.org/tools/gnucap/> ਡਾਊਨਲੋਡ ਅਤੇ ਸਥਾਪਿਤ ਕਰ ਸਕਦੇ ਹੋ।ਇਸ ਨੂੰ ਲੱਭਣ ਲਈ ਇਹਦਾ ਇਸ ਵਿੱਚ /usr/bin/gnucap or /usr/local/bin/gnucap. ਸਥਾਪਿਤ ਹੋਣਾ ਜ਼ਰੂਰੀ ਹੈ।ਤੁਸੀ ਕੰਪਿਊਟਰ ਸਿਮੂਲੇਸ਼ਨ ਤੋਂ ਬਿਨਾ ਵੀ ਇਸ ਕਿ੍ਆ ਦੀ ਵਰਤੋ ਨਾਲ ਚਿੱਤਰ ਵਾਹ ਸਕਦੇ ਹੋ।

source: and %d
pa: ਅਤੇ %d
ro: și %d

source: %d is divisible by %s.
pa: %d ਨੂੰ %s ਨਾਲ ਤਕਸੀਮ ਕੀਤਾ ਗਿਆ ਹੈ।
ro: %d este divizibil cu %s.

source: 1 is not a prime number.
pa: 1 ਪਾ੍ਇਮ ਅੰਕ ਨਹੀ ਹੈ
ro: 1 nu este un număr prim.

source: Primes less than %d
pa: %d ਤੋਂ ਘੱਟ ਪਾ੍ਇਮ
ro: Numere prime mai mici decât %d

source: Multiples of %(d1)d include %(s)s, but %(d2)d is not a multiple of %(d3)d.
pa: %(d1)d ਦੀ ਗੁਣਜ ਵਿੱਚ %(s)s ਵੀ ਸ਼ਾਮਿਲ ਹੈ ਪਰ %(d2)d %(d3)d ਦਾ ਗੁਣਜ ਨਹੀ ਹੈ।
ro: Multiplii lui %(d1)d includ pe %(s)s, dar %(d2)d nu este un multiplu al lui %(d3)d.

source: Factors of %d
pa: %d ਦੇ ਗੁਣਕਖੰਡ
ro: Factori ai lui %d

source: %s are the factors of %d.
pa: %s %d ਦੇ ਗੁਣਕਖੰਡ ਹਨ।
ro: %s sunt factori ai lui %d.

source: Multiples of %d
pa: %d ਦੇ ਗੁਣਜ
ro: Multiplii ai lui %d

source: %d × %d
pa: %d x %d

source: Equal to %d
pa: %d ਦੇ ਬਰਾਬਰ ਹੈ
ro: Egal cu %d

source: Not equal to %d
pa: %d ਦੇ ਬਰਾਬਰ ਨਹੀ ਹੈ
ro: Nu e egal cu %d

source: You were eaten by a Troggle. Press <Return> to continue.
pa: ਤੁਹਾਨੂੰ ਇੱਕ ਟੋ੍ਗਲ ਨੇ ਖਾ ਲਿਆ ਸੀ, ਜਾਰੀ ਰੱਖਣ ਲਈ <Return> ਦਬਾਓ
ro: Ați fost mâncat de Troggle. Apăsați <Return> pentru continuare.

source: You ate a wrong number.
pa: ਤੁਸੀ ਗਲਤ ਅੰਕ ਖਾਧਾ ਹੈआपने गलत संख्या खायी.
ro: Ați mâncat un număr greșit.

source: Press <Return> to continue.
pa: ਜਾਰੀ ਰੱਖਣ ਲਈ <Return> ਦਬਾਓ
ro: Apăsați <Return> pentru continuare.

source: Guess a number between %d and %d
pa: %d ਅਤੇ %d ਦੇ ਵਿਚਕਾਰਲਾ ਇੱਕ ਅੰਕ ਸੋਚੋ
ro: Ghiciți un număr între %d și %d

source: Please enter a number between %d and %d
pa: ਕਿਰਪਾ ਕਰਕੇ %d ਅਤੇ %d ਦੇ ਵਿਚਕਾਰਲਾ ਇੱਕ ਅੰਕ ਭਰੋ
ro: Întroduceți un număr între %d și %d

source: Out of range
pa: ਦਾਇਰੇ ਤੋਂ ਬਾਹਰ
ro: În afara valorilor admise.

source: Too high
pa: ਬਹੁਤ ਉੱਚਾ
ro: Prea mare

source: Too low
pa: ਬਹੁਤ ਨੀਚੇ
ro: Prea mic

source: Profile:
pa: ਪੋ੍ਫਾਇਲ
ro: Profilul:

source: Login:
pa: ਲੌਗਿਨ

source: Enter login to log in
pa: ਅੰਦਰ ਜਾਣ ਲਈ ਲੌਗਿਨ ਕਰੋ

source: Rebuild the same mosaic on the right area
pa: ਓਹੀ ਪੱਚੀਕਾਰੀ ਸੱਜੇ ਪਾਸੇ ਦੁਬਾਰਾ ਬਣਾਓ

source: Error: this activity cannot be played with the sound effects disabled. Go to the configuration dialogue to enable the sound
pa: ਗਲਤੀ: ਇਹ ਕਿ੍ਆ ਅਵਾਜ਼ ਬੰਦ ਕਰਕੇ ਨਹੀ ਖੇਡੀ ਜਾ ਸਕਦੀ।ਰੂਪ ਰੇਖਾ ਸੰਵਾਦ ਵਿੱਚ ਜਾ ਕੇ ਅਵਾਜ਼ ਚਾਲੂ ਕਰੋ
ro: Eroare: această activitate nu se poate juca cu efectele sonore dezactivate. Mergeți in panoul de configurare și activați suntetul.

source: This activity is not playable, just a test
pa: ਇਹ ਕਿ੍ਆ ਖੇਡੀ ਨਹੀ ਜਾ ਸਕਦੀ,ਇਹ ਸਿਰਫ ਇੱਕ ਤਜਰਬਾ ਹੈ।
ro: Activitatea nu se poate juca, e un test

source: Disable line drawing in circle
pa: ਗੋਲ ਚੱਕਰ ਵਿੱਚ ਰੇਖਾ ਡਾ੍ਇੰਗ ਬੰਦ ਕਰੋ
ro: Dezactivează desenarea de linii în cerc

source: Color of the line
pa: ਰੇਖਾ ਦਾ ਰੰਗ
ro: Culoarea liniei

source: Distance between circles
pa: ਗੋਲਚਕਰਾਂ ਵਿੱਚਕਾਰ ਦੂਰੀ
ro: Distanța dintre cercuri

source: Use circles
pa: ਗੋਲਚਕਰ ਵਰਤੋ
ro: Folosiți cercuri

source: Use rectangles
pa: ਆਇਤ ਵਰਤੋ
ro: Folosiți dreptunghiuri

source: Choice of pattern
pa: ਰੂਪ ਵਿਧੀ ਦੀ ਚੋਣ
ro: Alegere șablon

source: Coordinate
ar_tn: إحداثية
pa: ਨਿਹਦੇਸ਼ ਅੰਕ
ro: Coordonată

source: The race is already being run
pa: ਦੌੜ ਪਹਿਲਾਂ ਹੀ ਦੌੜੀ ਜਾ ਰਹੀ ਹੈ
ro: Cursa a fost lansată

source: forward
pa: ਅਗਾਂਹ
ro: înainte

source: COMMANDS ARE
pa: ਆਦੇਸ਼
ro: COMENZILE SUNT

source: This is a draw
pa: ਬਰਾਬਰੀ ਤੇ ਖਤਮ
ro: E un desen

source: The Red boat has won
pa: ਲਾਲ ਕਿਸ਼ਤੀ ਜੇਤੂ ਹੈ
ro: Corabia Roșie a câștigat

source: The Green boat has won
pa: ਹਰੀ ਕਿਸ਼ਤੀ ਜੇਤੂ ਹੈ
ro: Corabia Verde a câștigat

source: Angle:
pa: ਕੋਣ
ro: Ungi:

source: Wind:
ar_tn: ريح:
pa: ਪਵਨ
ro: Vânt:

source: Syntax error at line
ar_tn: خطأ تركيبي في السطر
pa: ਇਸ ਲਾਇਨ ਦੇ ਸਿਂਟੈਕਸ ਵਿਚ ਗਲਤੀ ਹੈ
ro: Eroare de sintaxă în rândul

source: The command
ar_tn: الأمر
pa: ਆਦੇਸ਼
ro: Comanda

source: Unknown command at line
ar_tn: أمر مجهول في السطر
pa: ਲਾਇਨ ਵਿੱਚ ਅਣਪਛਾਤਾ ਆਦੇਸ਼ ਹੈ
ro: Comandă necunoscută în rândul

source: Distance:
ar_tn: المسافة :
pa: ਦੂਰੀ
ro: Distanța:

source: Cannot find Tuxpaint. Install it to use this activity !
ar_tn: لا يمكنني إيجاد مرسم البطريق. نصبه لتستخدم هذا النشاط
pa: ਟਕਸਪੇਂਟ ਨਹੀ ਲੱਭਿਆ ।ਇਸ ਕਿ੍ਆ ਨੂੰ ਲਭੱਣ ਲਈ ਟਕਸਪੇਂਟ ਸਥਾਪਿਤ ਕਰੋ
ro: Nu pot găsi Tuxpaint.<br> Instatați-l pentru folosirea activității !

source: Waiting for Tuxpaint to finish
ar_tn: انتظر مرسم البطريق حتى ينتهي
pa: ਟਕਸਪੇਂਟ ਦੇ ਖਤਮ ਹੋਣ ਦਾ ਇਂਤਜਾ਼ਰ ਕਰਦੇ ਹੋਏ
ro: Așteptați Tuxpaint să finișeze

source: Inherit fullscreen setting from GCompris
pa: ਜੀਕੰਪਿ੍ਸ ਤੋਂ ਪੂਰੀ ਸਕਰੀਨ ਵਾਲੀ ਸੈਟਿੰਗ ਲਓ
ro: Moștenește setarea de afișare pe întreg ecranul din GCompris

source: Inherit size setting from GCompris (800x600, 640x480)
pa: ਜੀਕੰਪਿ੍ਸ ਤੋਂ ਆਕਾਰ ਵਾਲੀ ਸੈਟਿੰਗ ਲਓ (800X600, 640X480)
ro: Moștenește setarea de mărime din GCompris (800x600, 640x480)

source: Disable shape rotation
ar_tn: عطل تدوير الأشكال
pa: ਆਕਾਰ ਘੁਮਾਉਣ ਵਾਲੀ ਕਿ੍ਆ ਬੰਦ ਕਰੋ
ro: Dezactivează rotirea formelor

source: Show Uppercase text only
ar_tn: اعرض الحروف الكبيرة فقط
pa: ਕੇਵਲ ਵੱਡੇ ਅੱਖਰ ਦਿਖਾਓ
ro: Arată doar textul cu majuscule

source: Disable stamps
ar_tn: عطل الطوابع
pa: ਮੋਹਰਾਂ ਬੰਦ ਕਰੋ
ro: Dezactivează ștampile

source: Memory game
ar_tn: لعبة ذاكرة
pa: ਮੈਮਿਊਰੀ ਖੇਡ
ro: Joc de memorie

source: Build a train according to the model
ar_tn: اصنع قطارا حسب النموذج
pa: ਨਕਸ਼ੇ ਅਨੁਸਾਰ ਰੇਲ ਗੱਡੀ ਬਣਾਓ
ro: Construiește un tren urmând modelul

source: Please, check if the word
ar_tn: تحقق من فضلك أن الكلمة
pa: ਕਿਰਪਾ ਕਰਕੇ ਦੇਖੋ ਜੇਕਰ ਅੱਖਰ
ro: Verificați dacă cuvântul

source: is being displayed
ar_tn: معروضة على الشاشة
pa: ਦਿਖਾਈ ਦੇ ਰਿਹਾ ਹੈ
ro: este afișat

source: I am Ready
ar_tn: أنا مستعد
pa: ਮੈਂ ਤਿਆਰ ਹਾਂ
ro: Sunt gata

source: Yes, I saw it
ar_tn: نعم رأيتها
pa: ਹਾਂ ਮੈਂ ਉਹਨੂੰ ਦੇਖ ਲਿਆ
ro: Da, am văzut-o

source: No, it was not there
ar_tn: لا لم أرها
pa: ਨਹੀ,ਉਹ ਉੱਥੇ ਨਹੀਂ ਸੀ
ro: Nu, nu a fost acolo

source: The word to find was '%s'
ar_tn: الكلمة التي نبحث عنها هي : '%s'
pa: ਜਿਹੜਾ ਅੱਖਰ ਲੱਭਣਾ ਸੀ,ਉਹ %s ਸੀ
ro: Cuvântul căutat a fost '%s'

source: But it was not displayed
ar_tn: لكنها لم تكن معروضة على الشاشة
pa: ਉਹ ਦਿਖਾਈ ਨਹੀਂ ਦੇ ਰਿਹਾ ਸੀ
ro: Dar nu a fost afișat

source: And it was displayed
ar_tn: معروضة على الشاشة
pa: ਅਤੇ ਉਹ ਦਿਖਾਈ ਦੇ ਰਿਹਾ ਸੀ
ro: Și a fost afișat

source: Weight = %s
pa: ਵਜ਼ਨ = %s
ro: Greutate = %s

source: Take care, you can drop masses on both sides of the scale.
pa: ਧਿਆਨ ਰੱਖੋ,ਦੋਨੋ ਪਾਸੇ ਭਾਰ ਸੁੱਟ ਸਕਦੇ ਹੋ
ro: Ai grijă, poți lăsa greutăți pe ambele talere ale cântarului.

source: Points = %s
ar_tn: نقاط = %s
pa: ਅੰਕ = %s
ro: Puncte = %s

source: Wind speed = %d kilometers/hour
ar_tn: سرعة الريح = %d /nكم/س
pa: ਹਵਾ ਦੀ ਗਤੀ = %d ਕਿਲੋਮੀਟਰ/ਘੰਟਾ
ro: Cu viteza = %d kilometri pe oră

source: Distance to target = %d meters
ar_tn: المسافة المتبقية إلى الهدف : %d أمتار
pa: ਟੀਚੇ ਦੀ ਦੂਰੀ = %d ਮੀਟਰ
ro: Distanța până la țintă = %d metri

source: Research
pa: ਖੋਜ
ro: Cercetare

source: Sentimental
pa: ਜਜ਼ਬਾਤੀ

source: Official
pa: ਦਫਤਰੀअधिकृत
ro: Oficial

source: Text
pa: ਅੱਖਰ

source: Flyer
pa: ਫਲਾਇਰ

source: Title
pa: ਸਿਰਲੇਖशीर्षक
ro: Titlu

source: Heading 1
pa: ਉਪ-ਸਿਰਲੇਖ 1
ro: Subtitlu 1

source: Heading 2
pa: ਉਪ-ਸਿਰਲੇਖ 2
ro: Subtitlu 2

source: translator_credits
ar_tn: بسام مقني
pa: ਅਨੁਵਾਦਕ ਸਿਹਰਾभाषांतरकार_श्रेय
ro: Galuna S.R.L. www.galuna.ro, Veaceslav Grecea Launchpad Contributions: Adi Roiban https://launchpad.net/~adiroiban Alexandru Butum https://launchpad.net/~cyberzet Ionuț Jula https://launchpad.net/~ionutjula Manuel R. Ciosici https://launchpad.net/~manuelciosici Perghel Alin https://launchpad.net/~perghel-alin Rus-Rebreanu Alin-Florin https://launchpad.net/~netblock Veaceslav Grecea https://launchpad.net/~slavutich

source: About GCompris
ar_tn: حول جكومبري
pa: ਜੀਕੰਪਿ੍ਸ ਬਾਰੇ
ro: Despre GCompris

source: Translators:
ar_tn: الجمعية الرقمية للبرمجيات الحرة
pa: ਅਨੁਵਾਦਕ
ro: Galuna S.R.L. www.galuna.ro, Veaceslav Grecea

source: GCompris Home Page http://gcompris.net
ar_tn: الصفحة الرئيسية لجكومبريhttp://gcompris.net
pa: ਜੀਕੰਪਿ੍ਸ ਮੁੱਖ ਪੰਨਾ http://gcompris.net
ro: Pagina principală GCompris http://gcompris.net

source: This software is a GNU Package and is released under the GNU General Public License
ar_tn: هذا البرنامج جزء من إصدارات جنو و قد تم إصداره وفقا لرخصة جنو العلنية
pa: ਇਹ ਸਾਫਟਵੇਅਰ ਜੀ ਐਨ ਯੂ ਪੈਕੇਜ ਹੈ ਅਤੇ ਇਹ ਜੀ ਐਨ ਯੂ ਦੇ ਜਨਰਲ ਪਬਲਿਕ ਲਾਇਸੈਂਸ ਦੇ ਅਧੀਨ ਪ੍ਕਾਸ਼ਿਤ ਹੋਇਆ ਹੈयह सॉफ्टवेअर जीएनयू पैकेज का है और जीएनयू जनरल पब्लीक लायसेन्स तले प्रकाशित हुआ है.
ro: Acestă aplicație este un pachet GNU și este lansată sub licența GNU General Public License

source: OK
ar_tn: موافق
pa: ਠੀਕ ਹੈ

source: GCompris confirmation
ar_tn: إعدادات جكومبري
pa: ਜੀਕੰਪਿ੍ਸ ਪੁਸ਼ਟੀ
ro: Confirmare GCompris

source: Are you sure you want to quit?
ar_tn: هل أنت متأكد أنك تريد المغادرة؟
pa: ਕੀ ਤੁਸੀ ਨਿਸ਼ਚਤ ਹੋ ਇਸ ਤੋਂ ਬਾਹਰ ਨਿਕਲਨ ਲਈ ?
ro: Sunteți siguri vreți să ieșiți?

source: Yes, I am sure!
ar_tn: نعم أنا متأكد
pa: ਹਾਂ,ਮੈਂ ਨਿਸ਼ਚਤ ਹਾਂ
ro: Da, sunt sigur!

source: No, I want to keep going
ar_tn: لا أريد المواصلة
pa: ਨਹੀਂ,ਮੈਂ ਅੱਗੇ ਚਾਲੂ ਰਖਨਾ ਚਾਹੁੰਦਾ ਹਾਂ
ro: Nu, vreau să continui

source: Select the language to use in the board
ar_tn: اختر اللغة المستخدمة في اللوحات
pa: ਬੋਰਡ ਵਿੱਚ ਵਰਤੇ ਜਾਣ ਵਾਲੀ ਭਾਸ਼ਾ ਚੁਣੋ
ro: Selectați limbajul<br> pentru interfață

source: Global GCompris mode
pa: ਗਲੋਬਲ ਜੀਕੰਪਿ੍ਸ ਮੋਡविश्वव्यापक खेलगंमत क्रिया
ro: Modul global GCompris

source: Normal
pa: ਸਧਾਣਨ

source: 2 clicks
pa: 2 ਕਲਿਕ
ro: 2 clicuri

source: both modes
pa: ਦੋਨੋ ਮੋਡ
ro: amândouă modurile

source: Select the drag and drop mode to use in the board
pa: ਬੋਰਡ ਦੀ ਵਰਤੋ ਕਰਨ ਲਈ ਚੱਕ ਰੱਖ ਮੋਡ ਦੀ ਵਰਤੋ ਕਰੋ
ro: Selectează modul trage și plasează

source: Your system default
ar_tn: الإفتراضي في نظامك
pa: ਤੁਹਾਡਾ ਸ਼ੁਰੂਆਤੀ ਸਿਸਟਮ
ro: Setările implicite ale sistemului

source: Amharic
pa: ਐਮਹੈਰਿਕ

source: Arabic
ar_tn: عربي
pa: ਅਰੈਬਿਕ
ro: Arabă

source: Turkish (Azerbaijan)
ar_tn: التركية
pa: ਟਰਕਿਸ਼(ਅਜ਼ਰਬਾਈਜਨ)
ro: Turcă (Azerbaidja)

source: Bulgarian
ar_tn: بلغاري
pa: ਬੁਲਗਾਰਿਅਨ
ro: Bulgar

source: Catalan
ar_tn: كاتالوني
pa: ਕਟਲਨकॅटलन
ro: Catalană

source: Danish
ar_tn: الدنماركية
pa: ਦਾਨਿਸ਼
ro: Daneză

source: German
ar_tn: ألماني
pa: ਜਰਮਨ
ro: Germană

source: Greek
ar_tn: يوناني
pa: ਗੀ੍ਕ
ro: Greacă

source: English (Canada)
ar_tn: انجليزي كندا
pa: ਇੰਗਲਿਸ਼(ਕਨੇਡਾ)
ro: Engleză (Canada)

source: English (Great Britain)
ar_tn: انجليزي بريطانيا العظمى
pa: ਇੰਗਲਿਸ਼(ਗੇ੍ਟ ਬਿ੍ਟੇਨ)
ro: Engleză (Marea Britanie)

source: English (United States)
pa: ਇੰਗਲਿਸ਼(ਯੁਨਾਇਟਡ ਸਟੇਟਸ)
ro: Engleză (Statele Unite)

source: Spanish
ar_tn: إسباني
pa: ਸਪੈਨਿਸ਼
ro: Spaniolă

source: Basque
pa: ਬਾਸਕਿਊ
ro: Bască

source: Dzongkha
pa: ਡਜ਼ੋਂਗਖਾ

source: Finnish
ar_tn: فنلندي
pa: ਖਤਮ
ro: Finlandeză

source: French
ar_tn: فرنسي
pa: ਫਰੈਂਚ
ro: Franceză

source: Irish (Gaelic)
pa: ਆਇਰਿਸ਼(ਗਾਲਿਕ)
ro: Galic

source: Hebrew
ar_tn: عبري
pa: ਹੇਬਰਿਊ
ro: Ebraică

source: Hindi
ar_tn: هندي
pa: ਹਿੰਦੀ

source: Indonesian
pa: ਇੰਡੋਨੇਸ਼ਿਅਨ
ro: IIndoneziană

source: Japanese
pa: ਜਪਾਨੀ
ro: Japaneză

source: Gujarati
pa: ਗੁਜਰਾਤੀ

source: Punjabi
pa: ਪੰਜਾਬੀ

source: Hungarian
ar_tn: مجري
pa: ਹੰਗਰਿਅਨ
ro: Ungară

source: Croatian
ar_tn: كرواتي
pa: ਕਰੋਟਿਅਨ
ro: Croația

source: Italian
ar_tn: إيطالي
pa: ਇਟੈਲਿਅਨ
ro: Italiană

source: Georgian
ar_tn: جورجي
pa: ਜੌਰਜਿਅਨ
ro: Georgiană

source: Korean
pa: ਕੋਰਿਅਨ
ro: Coreeană

source: Lithuanian
ar_tn: لتواني
pa: ਲਿਥੁਨੇਇਨ
ro: Lituaniană

source: Macedonian
ar_tn: مقدوني
pa: ਮੇਸਿਡੋਨਿਅਨ
ro: Macedoniană

source: Malayalam
ar_tn: ماليزي (ماليالم)
pa: ਮਲਿਆਲਮ

source: Marathi
pa: ਮਰਾਠੀ

source: Malay
ar_tn: ماليزي
pa: ਮਲਅ
ro: Malaieziană

source: Nepal
ar_tn: نيبالي
pa: ਨੇਪਾਲੀ

source: Dutch
ar_tn: هولندي
pa: ਡੱਚ
ro: Daneză

source: Norwegian Bokmal
ar_tn: نرويجي
pa: ਨੌਰਵੇਜਿਅਨ ਬੋਕਮਲ
ro: Norvegiană (Bokmal)

source: Norwegian Nynorsk
ar_tn: نرويجي
pa: ਨੌਰਵੇਜਿਅਨ ਨਿਨੌਰਸਕ
ro: Norvegiană (Nynorsk)

source: Polish
ar_tn: بولوني
pa: ਪੌਲਿਸ਼
ro: Poloneză

source: Portuguese
ar_tn: برتغالي
pa: ਪੌਰਟੁਗੀਜ਼
ro: Portugheză

source: Portuguese (Brazil)
ar_tn: برتغالي البرازيل
pa: ਪੌਰਟੁਗੀਜ਼ (ਬਰਾਜ਼ਿਲ)
ro: Portugheză (Brazilia)

source: Romanian
ar_tn: روماني
pa: ਰੋਮਾਨਿਅਨ
ro: Română

source: Russian
ar_tn: روسي
pa: ਰਸ਼ਿਅਨ
ro: Rusă

source: Kinyarwanda
pa: ਕਿਨਰਵਾਂਡਾ

source: Slovak
ar_tn: سلوفاكي
pa: ਸਲੋਵਕ
ro: Slovacă

source: Slovenian
ar_tn: سلوفاني
pa: ਸਲੋਵੇਨਿਅਨ
ro: Slovenă

source: Somali
pa: ਸੋਮਾਲੀ

source: Albanian
ar_tn: ألباني
pa: ਅਲਬਾਨਿਅਨ
ro: Albaneză

source: Serbian (Latin)
ar_tn: سربي لاتيني
pa: ਸਰਬਿਅਨ(ਲੈਟਿਨ)
ro: Serbă (latin)

source: Serbian
ar_tn: سربي
pa: ਸਰਬਿਅਨ
ro: Serbă

source: Swedish
ar_tn: سويدي
pa: ਸਵਿਡਿਸ਼
ro: Suedeză

source: Thai
pa: ਥਾਈ
ro: Thailandeză

source: Turkish
ar_tn: تركي
pa: ਤੁਰਕਿਸ਼
ro: Turcă

source: Vietnamese
ar_tn: ڦيتنامي
pa: ਵਿਅਤਨਾਮਿਜ਼
ro: Vietnameză

source: Walloon
ar_tn: الولّوني
pa: ਵਾਲੂਨ

source: Chinese (Simplified)
ar_tn: صيني (مبسط)
pa: ਚਾਇਨਿਜ਼(ਸਧਾਣਨ)
ro: Cineză (simplificată)

source: Chinese (Traditional)
ar_tn: صيني (تقليدي)
pa: ਚਾਇਨਿਜ਼(ਪਾਰੰਪਰਿਕ)
ro: Cineză (tradițional)

source: No time limit
ar_tn: وقت غير محدد
pa: ਸਮਾਂ ਦੀ ਕੋਈ ਪਾਬੰਦੀ ਨਹੀ
ro: Fără limită de timp

source: Slow timer
ar_tn: مؤقت بطيء
pa: ਹੋਲੀ ਸਮਾਂ ਦਸਣ ਵਾਲਾ ਯੰਤਰ
ro: Timp încet

source: Normal timer
ar_tn: مؤقت عادي
pa: ਸਧਾਣਨ ਸਮਾਂ ਦਸਣ ਵਾਲਾ ਯੰਤਰ
ro: Timp normal

source: Fast timer
ar_tn: مؤقت سريع
pa: ਜਲਦੀ ਸਮਾਂ ਦਸਣ ਵਾਲਾ ਯੰਤਰ
ro: Timp rapid
