Repository: MkPereira/gcompris
Catalog: po/*.po
Languages: ar_tn, pa, ro

source: Click on the hat to open or close it. Under the hat, how many stars can you see moving around? Count carefully. :) Click in the bottom-right area to input your answer.
pa: ਟੋਪੀ ਨੂੰ ਖੋਲਣ ਜਾਂ ਬੰਦ ਕਰਨ ਲਈ ਟੋਪੀ ਤੇ ਕਲਿਕ ਕਰੋ। ਟੋਪੀ ਦੇ ਨੀਚੇ ਕਿਨੇ ਸਿਤਾਰੇ ਹਿਲਦੇ ਨਜ਼ਰ ਆ ਰਹੇ ਹਨ।ਧਿਆਨ ਨਾਲ ਗਿਣੋ।ਆਪਣਾ ਜਵਾਬ ਦੇਣ ਲਈ ਨੀਚੇ ਸੱਜੇ ਪਾਸੇ ਕਲਿਕ ਕਰੋ
ro: Fă clic pe pălărie pentru a o deschide sau închide. Câte stele vezi că se mișcă sub pălărie? Numără atent. :) Fă clic în zona din dreapta-jos pentru a introduce răspunsul.

source: Count how many items are under the magic hat
ar_tn: عد الوحدات تحت القبعة السحرية
pa: ਗਿਣੋ, ਕਿੰਨੀਆਂ ਚੀਜ਼ਾਂ ਜਾਦੂਗਰੀ ਟੋਪੀ ਦੇ ਨੀਚੇ ਹਨ
ro: Numără câte obiecte se află sub pălăria magică

source: Learn addition
ar_tn: تعلم الجمع
pa: ਜੋੜ ਸਿੱਖੋ
ro: Învața adunarea

source: The magician hat
ar_tn: القبعة السحرية
pa: ਜਾਦੂਗਰੀ ਟੋਪੀ
ro: Pălăria magicianului

source: Count how many items are under the magic hat after some have got away
ar_tn: عد الوحدات تحت القبعة السحرية بعد خروج بعضها
pa: ਜਦੋ ਕੁੱਝ ਚੀਜ਼ਾਂ ਗਾਇਬ ਹੋ ਜਾਣ,ਗਿਣੋ ਕਿੱਨੀਆਂ ਜਾਦੂਗਰੀ ਟੋਪੀ ਦੇ ਨੀਚੇ ਹਨ
ro: Socoate câte elemente sunt sub pălăria magică, după dispariția câtorva din ele

source: Learn subtraction
ar_tn: تعلم الطرح
pa: ਘਟਾਓ ਸਿੱਖੋ
ro: Învața scăderea

source: Look at the magician, he tells the number of stars that are under his magic hat. Then, click on the hat to open it. A few stars escape. Click again on the hat to close it. You have to count how many are still under the hat. Click on the bottom right area to answer.
ar_tn: انظر إلى الساحر ,إنه يعطي عدد النجوم تحت قبعته. ثم انقر على قبعته لفتحها. مجموعة من النجوم تهرب. انقر القبعة ثانية لإغلاقها. عد النجوم المتبقية تحت القبعة. انقر الزاوية اليمنى والسفلى لإدخال إجابتك.
pa: ਜਾਦੂਗਰ ਵਲ ਵੇਖੋ,ਜਿਹੜੇ ਉਸਦੀ ਟੋਪੀ ਥੱਲੇ ਤਾਰੇ ਪਏ ਹਨ, ਉਹ ਉਸਦੇ ਅੰਕ ਦਸਦਾ ਹੈ।ਹੁਣ ਤੁਸੀ ਟੋਪੀ ਖੋਲਣ ਲਈ ਇਸ ਤੇ ਕਲਿਕ ਕਰੋ ਜਿਸਦੇ ਨਾਲ ਇਸ ਵਿਚੋਂ ਕੁੱਝ ਤਾਰੇ ਨਿਕਲ ਜਾਣਗੇ।ਟੋਪੀ ਨੂੰ ਬੰਦ ਕਰਨ ਲਈ ਇਸਤੇ ਦੋਬਾਰਾ ਕਲਿਕ ਕਰੋ।ਹੁਣ ਤੁਸੀ ਗਿਣਨੇ ਹਨ ਕਿ ਟੋਪੀ ਥੱਲੇ ਕਿੰਨੇ ਤਾਰੇ ਬਾਕੀ ਹਨ।ਆਪਣਾ ਜਵਾਬ ਦੇਣ ਲਈ ਸੱਜੇ ਪਾਸੇ ਸਭ ਤੋਂ ਥਲੜੇ ਖੇਤਰ ਤੇ ਕਲਿਕ ਕਰੋ

source: Subtraction
ar_tn: الطرح
pa: ਘਟਾਓ
ro: Scădere

source: Mathematical activities.
ar_tn: أنشطة الرياضيات
pa: ਹਿਸਾਬ ਕਿ੍ਆਵਾਂ
ro: Mergeți la activitățile de matematică

source: Mathematics
ar_tn: الرياضيات
pa: ਹਿਸਾਬ
ro: Matematica

source: Can use the keyboard arrow to move an object.
ar_tn: استعمال أسهم لوحة المفاتيح لتحريك الأشياء
pa: ਚੀਜ਼ ਨੂੰ ਹਿਲਾਉਣ ਲਈ ਕੀਬੋਰਡ ਦੀ ਵਰਤੋ ਕਰ ਸਕਦੇ ਹੋ।
ro: Poate folosi săgețile de pe tastatură pentru muta un obiect.

source: Find your way out of the maze
ar_tn: جد الطريق للخروج من المتاهة
pa: ਭੁੱਲਭੱਲਇਆ ਤੋਂ ਬਾਹਰ ਆਉਣ ਲਈ ਆਪਣਾ ਰਾਹ ਲੱਭੋ
ro: Găsiți ieșirea din labirint

source: Help Tux get out of this maze.
ar_tn: ساعد البطريق للخروج من المتاهة
pa: ਭੁੱਲਭੱਲਇਆ ਤੋਂ ਬਾਹਰ ਆਉਣ ਲਈ ਟਕਸ ਦੀ ਸਹਾਇਤਾ ਕਰੋ
ro: Ajutați-l pe Tux să iasă afară din labirint.

source: Maze
ar_tn: متاهة
pa: ਭੁੱਲਭੱਲਇਆ
ro: Labirint

source: Use the keyboard arrows to move Tux up to the door.
ar_tn: استعمل مفاتيح الأسهم لإيصال البطريق إلى الباب
pa: ਟਕਸ ਨੂੰ ਦਰਵਾਜੇ ਤਕ ਲਿਆਉਣ ਲਈ ਕਿਬੋਰਡ ਬਟਨਾਂ ਦੀ ਵਰਤੋ ਕਰੋ
ro: Folosiți săgețile de pe tastatură pentru a-l duce pe Tux la ușă.

source: Find your way out of the maze (Move is relative)
ar_tn: جد الطريق للخروج من المتاهة. تحرك نسبي
pa: ਭੁੱਲਭੱਲਇਆ ਤੋਂ ਬਾਹਰ ਆਉਣ ਲਈ ਆਪਣਾ ਰਾਹ ਲੱਭੋ(ਹਿਸਾਬ ਦਾ ਹਿਲਾਓ)
ro: Găsește drumul afară din labirit (Mișcarea este relativă)

source: Use the keyboard arrows to move Tux up to the door. In this maze, the move is relative (first person). Use the up arrow to go forward. The other arrow let you turn Tux in another direction.
ar_tn: استعمل مفاتيح الأسهم لإيصال البطريق إلى الباب. في هذه المتاهة التحرك نسبي. استعمل السهم العلوي لتتقدم إلى الأمام. الأسهم الأخرى تدير البطريق للاتجاهات الأخرى.
pa: ਟਕਸ ਨੂੰ ਦਰਵਾਜੇ ਤਕ ਲਿਆਉਣ ਲਈ ਕਿਬੋਰਡ ਬਟਨਾਂ ਦੀ ਵਰਤੋ ਕਰੋ।ਇਸ ਭੁੱਲਭੱਲਇਆ ਵਿੱਚ ਹਿਸਾਬ ਦਾ ਹਿਲਾਉਣਾ ਹੈ(ਪਹਿਲਾ ਬੰਦਾ)।ਉਪਰਲੀ ਦਿਸ਼ਾ ਵਾਲੇ ਬਟਨ ਨੂੰ ਦਬਾ ਕੇ ਅੱਗੇ ਵਧੋ।ਦੂਜੇ ਬਟਨ ਨਾਲ ਤੁਸੀ ਟਕਸ ਨੂੰ ਦੂਜੀ ਵਲ ਮੋੜੋ ।
ro: Folosiți săgețile pentru a-l duce pe Tux până la ușâ. În acest labirint mișcarea este relativă (de la prima persoană). Folosițî șageata în sus pentru a vă mișca înainte. Celelalte săgeți vă permit să schimbați direcția lui Tux.

source: 3D Maze
ar_tn: متاهة ثلاثية الأبعاد
pa: 3ਡੀ ਭੁੱਲਭੱਲਇਆ
ro: Labirint 3D

source: Find your way out of the 3D maze
ar_tn: جد الطريق للخروج من المتاهة الثلاثية الأبعاد
pa: 3ਡੀ ਭੁੱਲਭੱਲਇਆ ਤੋਂ ਬਾਹਰ ਆਉਣ ਲਈ ਆਪਣਾ ਰਾਹ ਲੱਭੋ
ro: Găsiți ieșirea din labirint

source: Use the keyboard arrows to move Tux up to the door. Use the spacebar to switch between 2D and 3D modes. 2D mode just gives you an indication of your position, like a map. You cannot move Tux in 2D mode.
ar_tn: استعمل مفاتيح الأسهم لإيصال البطريق إلى الباب. استعمل مفتاح المساحة للتحول بين الصيغة الثنائية و الثلاثية الأبعاد. الصيغة الثنائية الأبعاد تعطيك دلالة على موقعك مثل الخريطة. لا يمكنك تحربك البطريق في الصيغة الثنائية الأبعاد.
pa: ਟਕਸ ਨੂੰ ਦਰਵਾਜੇ ਤਕ ਲਿਆਉਣ ਲਈ ਕਿਬੋਰਡ ਬਟਨਾਂ ਦੀ ਵਰਤੋ ਕਰੋ।ਸਪੇਸਬਾਰ ਦੀ ਵਰਤੋ ਨਾਲ ਤੁਸੀ 2ਡੀ ਤੋਂ 3ਡੀ ਵਿੱਚ ਜਾ ਸਕਦੇ ਹੋ।2ਡੀ ਬਸ ਤੁਹਾਨੂੰ ਤੁਹਾਡੀ ਜਗਾਹ ਬਾਰੇ ਦੱਸੇਗਾ,ਇੱਕ ਨਕਸ਼ੇ ਦੀ ਤਰਾਂ।ਤੁਸੀ ਟਕਸ ਨੂੰ 2ਡੀ ਮੋਡ ਵਿੱਚ ਨਹੀਂ ਹਿਲਾ ਸਕਦੇ
ro: Folosiți săgețile de pe tastatură pentru a-l duce pe Tux la ușă. Folosiți tasta 'spațiu' pentru a schimba între modul bidimensional și tridimensional. Modul bidimensional vă indică poziția la moment, ca o hartă. Nu-l puteți mișca pe Tux în acest mod.

source: Find your way out of the invisible maze
ar_tn: جد الطريق للخروج من المتاهة الخفية
pa: ਅਦਿ੍ਸ਼ ਭੁੱਲਭੱਲਇਆ ਤੋਂ ਬਾਹਰ ਆਉਣ ਲਈ ਆਪਣਾ ਰਾਹ ਲੱਭੋ
ro: Găsește drumul afară din labiritul invizibil

source: Use the keyboard arrows to move Tux up to the door. Use the spacebar to switch between invisible and visible modes. Visible mode just gives you an indication of your position, like a map. You cannot move Tux in visible mode.
ar_tn: استعمل مفاتيح الأسهم لإيصال البطريق إلى الباب. استعمل مفتاح المساحة للتحول بين الصيغة المرئية و المخفية. الصيغة المرئية تعطيك دلالة على موقعك مثل الخريطة. لا يمكنك تحربك البطريق في الصيغة المخفية
pa: ਟਕਸ ਨੂੰ ਦਰਵਾਜੇ ਤਕ ਲਿਆਉਣ ਲਈ ਕਿਬੋਰਡ ਬਟਨਾਂ ਦੀ ਵਰਤੋ ਕਰੋ ।ਸਪੇਸਬਾਰ ਦੀ ਵਰਤੋ ਕਰਕੇ ਤੁਸੀ ਅਦਿ੍ਸ਼ ਤੋਂ ਦਿ੍ਸ਼ ਮੋਡ ਵਿੱਚ ਜਾ ਸਕਦੇ ਹੋ।ਦਿ੍ਸ਼ ਮੋਡ ਬਸ ਤੁਹਾਨੂੰ ਤੁਹਾਡੀ ਜਗਾਹ ਬਾਰੇ ਦੱਸੇਗਾ,ਇੱਕ ਨਕਸ਼ੇ ਦੀ ਤਰਾਂ।ਤੁਸੀ ਟਕਸ ਨੂੰ ਦਿ੍ਸ਼ ਮੋਡ ਵਿੱਚ ਨਹੀਂ ਹਿਲਾ ਸਕਦੇ।
ro: Folosiți săgețile de pe tastatură pentru a-l duce pe Tux la ușă. Folosiți tasta 'spațiu' pentru a schimba între modul vizibil și invizibil. Modul vizibil vă indica poziția la moment, ca o hartă. Nu-l puteți mișca pe Tux în acest mod.

source: Find your way out of different types of mazes
ar_tn: جد الطريق للخروج من أنواع مختلفة من المتاهات
pa: ਵੱਖ-ਵੱਖ ਭੁੱਲਭੱਲਇਆ ਤੋਂ ਬਾਹਰ ਆਉਣ ਲਈ ਆਪਣਾ ਰਾਹ ਲੱਭੋ
ro: Găsește drumul afară din diferite tipuri de labirint

source: Go to Maze activities
ar_tn: أنشطة المتاهات
pa: ਭੁੱਲਭੱਲਇਆ ਕਿ੍ਆਵਾਂ ਤੇ ਜਾਓ
ro: Mergi la activitățile cu Labirinturi

source: Ear-training activity
ar_tn: أنشطة التدرب على الاستماع
pa: ਕੰਨ ਅੱਭਿਆਸ ਕਿ੍ਆ
ro: Activități de auz

source: Listen to the sound sequence played, and repeat it by clicking on the elements. You can listen again by clicking on the repeat button.
ar_tn: استمع إلى المقطع الصوتي و أعده بالنقر على العناصر. بإمكانك إعادة الاستماع بالنقر على زر الإعادة
pa: ਅਵਾਜ਼ ਨੂੰ ਸੁਣੋ ਅਤੇ ਦੋਬਾਰਾ ਸਣਨ ਲਈ ਉਸੇ ਚੀਜ਼ ਤੇ ਕਲਿੱਕ ਕਰੋ।ਤੁਸੀ ਰੀਪੀਟ ਬਟਨ ਤੇ ਕਲਿੱਕ ਕਰਕੇ ਦੋਬਾਰਾ ਸੁਣ ਸਕਦੇ ਹੋ।
ro: Ascultați secvențele sonore și repetați-le făcând un click pe elemente. Puteți asculta iarăși fă©ând un click pe butonul repetă.

source: Melody
ar_tn: لحن
pa: ਗਾਣਾ
ro: Melodie

source: Repeat a melody
ar_tn: أعد اللحن
pa: ਗਾਣਾ ਦੋਬਾਰਾ ਚਲਾਓ
ro: Repetă melodia

source: A set of blank cards is shown. Each card has a picture on the other side, and each picture card has a twin exactly the same. Click on a card to see its hidden picture, and try to match the twins. You can only turn over two cards at once, so you need to remember where a picture is, while you look for its twin. When you turn over the twins, they both disappear.
ar_tn: تعرض مجموعة من البطاقات البيضاء. كل بطاقة تحوي صورة في ظهرها و كل صورة لها مثيلتها. انقر بطاقة لتظهرالصورة المخفية و حاول البحث عن مثيلتها. بإمكانك قلب بطاقتين فقط في آن واحد لذا عليك تذكر مكان الصورة لتجد مثيلتها. عندما تقلب بطاقتين متماثلتين فإنهما تختفيان.
pa: ਖਾਲੀ ਪੱਤਿਆਂ ਦੀ ਜੋੜੀ ਦਿਖਾਈ ਗਈ ਹੈ।ਹਰ ਇੱਕ ਪੱਤੇ ਦੇ ਪਿੱਛਲੇ ਪਾਸੇ ਚਿੱਤਰ ਹੈ ਅਤੇ ਹਰ ਇੱਕ ਪੱਤੇ ਦਾ ਇੱਕ ਹੋਰ ਸਮਾਨ ਰੂਪ ਮੋਜੂਦ ਹੈ।ਛੁੱਪਿਆ ਹੋਇਆ ਚਿੱਤਰ ਦੇਖਣ ਲਈ ਪੱਤੇ ਤੇ ਕਲਿੱਕ ਕਰੋ ਅਤੇ ਉਸਦਾ ਦੂਜਾ ਸਮਾਨ ਰੂਪ ਵਾਲੇ ਚਿੱਤਰ ਨਾਲ ਮੇਲ ਕਰਨ ਦੀ ਕੋਸ਼ਿਸ਼ ਕਰੋ।ਤੁਸੀ ਸਿਰਫ ਇੱਕ ਵਾਰੀ ਵਿੱਚ 2 ਪੱਤੇ ਹੀ ਪਲਟਾ ਸਕਦੇ ਹੋ, ਇਸ ਕਰਕੇ ਤੁਹਾਨੰ ਚਿੱਤਰ ਯਾਦ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ,ਜਦੋਂ ਤੁਸੀ ਉਸਦਾ ਜੁੜਵਾ ਚਿੱਤਰ ਲੱਭ ਰਹੇ ਹੋ।ਜਦੋਂ ਤੁਸੀ ਦੋਨਾ ਨੂੰ ਪਲਟਾ ਦਵੋਗੇ ਤਾਂ ਦੋਨੋ ਗਾਇਬ ਹੋ ਜਾਣਗੇ।
ro: Vă sunt arătate un set de carți. Fiecare carte are o imagine pe o parte și fiecare imagine are o pereche. Faceți un click pe carte pentru a vedea imaginea ascunsă. În acest mod poți găsi perechea. În același moment poți întoarce numai două cărți, deci trebuie să ții minte, unde este imaginea-pereche. Când găsești perechea, carțile cu aceleași imagini dispar.

source: Flip the cards to find the matching pairs
ar_tn: اكشف البطاقات و جد الأزواج المتناسبة
pa: ਮੇਲ ਖਾਂਦੀ ਜੋੜੀ ਲੱਭਣ ਲਈ ਪੱਤਿਆਂ ਨੂੰ ਪਲਟਾਓ
ro: Întoarce cărțile pentru a descoperi perechi

source: Memory Game with images
ar_tn: لعبة ذاكرة تعتمد على الصور
pa: ਮੈਮਿਊਰੀ ਖੇਡ ਚਿੱਤਰਾਂ ਵਾਲੀ
ro: Jocul memoriei cu imagini

source: Train your memory and remove all the cards
ar_tn: درب ذاكرتك و أزل جميع البطاقات
pa: ਸਿਮਰਨ ਸ਼ਕਤੀ ਨੂੰ ਤੇਜ਼ ਕਰੋ ਅਤੋ ਸਾਰੇ ਪੱਤੇ ਹਟਾਓ
ro: Exersați-vă memoria și eliminați toate cărțile

source: Addition memory game
ar_tn: لعبة ذاكرة الجمع
pa: ਜਮਾਂ ਸਿਮਰਨ ਸ਼ਕਤੀ ਖੇਡ
ro: Jocuri de memorie cu adunare

source: Practise adding up, until all the cards are gone.
ar_tn: مارس عملية الجمع إلى أن تختفي جميع البطاقات
pa: ਖਡਦੇ ਰਹੋ ਜਦ ਤੱਕ ਸਾਰੇ ਪੱਤੇ ਚਲੇ ਨਾ ਜਾਣ
ro: Practicați adunarea, până când toate cărțile dispar.

source: Turn the cards over to find two numbers which add up the same, until all the cards are gone.
ar_tn: اقلب البطاقات لتجد رقمين لديهما نفس المجموع، إلى أن تختفي جميع البطاقات
pa: ਇੱਕੋ ਜਿਹੋ 2 ਅੰਕਾਂ ਵਾਲੇ ਪੱਤੇ ਪਲਟਾਓ ਜਦ ਤੱਕ ਸਾਰੇ ਪੱਤੇ ਚਲੇ ਨਾ ਜਾਣ
ro: Întoarceți cărțile pentru a găsi două numere indentice, până când toate cărțile dispar.

source: You can see some cards, but you can't see what's on the other side of them. Each card is hiding an adding-up sum, or the answer to the sum. An adding-up sum looks like this: 2 + 2 = 4 The numbers on one side of the equals sign (=) have to be the same as the number on the other side. So 2 (1, 2) and 2 more (3, 4) makes 4. Count aloud when you work this out, and count on your fingers, because the more ways you do something, the better you remember it. You can also use blocks, or buttons, or anything you can count. If you have lots of brothers and sisters, you can count them! Or the kids in your class at school. Sing counting songs. Count lots of things, for practice, and you'll be very good at adding-up! In this game, these cards are hiding the two parts of an adding-up sum (also called an addition sum). You need to find the two parts of the sum, and bring them together again. Click on a card to see what number it's hiding, then try to find the other card that goes with it, to make a whole sum. You can only turn over two cards in one go, so you need to remember where the numbers are hiding, then you can match them when you find their other half. You're doing the job of the equals sign, and the numbers need you to put them together and make a proper sum. When you do that, both those cards disappear! When you've made them all disappear, found all the sums, you've won the game! :)
ar_tn: بإمكانك رؤية بعض البطاقات و لكنك لا تستطيع رؤية ما في وجها الآخر. كل بطاقة تخفي محصلة جمع . محصلة عملية جمع تشبه التالي: 2 + 2 = 4 إن الأرقام على الجهة اليمنى من رمز المساواة (=) يجب أن تكون مساوية للأرقام على الجهة الأخرى. فا 2(1،3) و 2 من (3،4) تساوي 4. عد بصوت مرتفع عندما تحل هذا التمرين وعد على أصابعك، لأنه كلما زادت الطرق لأداء شيئ معين، كلما سهل تذكره. بإمكانك أيضاً استخدام قطع أو أي شيئ للعد. إذا كان لديك العديد من الأخوة و الأخوات، فبإمكانك أن تعدهم! أو الأطفال في صفك في المدرسة. عد الكثير من الأشياء للمارسة و سوف تكون جيدا في العد. في هذه اللعبة، هذه البطاقات تخفي جزئين من المجموع، عليك ايجاد جزئي المجموع و تقريبهم لبعض مجدداً. أنقر على بطاقة لترى الرقم الذي تخفيه، ثم حاول إيجاد البطاقة اللأخرى الموافقة لها، للحصول على مجموع كامل، بإمكانك قلب بطاقتين في مرة واحدة ، لذا عليك أن تتذكر أين أخفيت الأرقام ثم تستطيع مطابقتها عندما تجد نصفها الآخر. أنت الآن تقوم بعمل رمز المساواة، و الأرقام تطلب منك أن تضعها مع بعضها لتشكيل مجموع متناسب. عندما تقوم بهذا، كلا البطاقتين سوف تختفيان، عندما تجد جميع المجاميع تربح اللعبة! :)
pa: ਤੁਸੀ ਕੁੱਝ ਪੱਤੇ ਦੇਖ ਸਕਦੇ ,ਪਰ ਉਹਨਾਂ ਦੇ ਪਿਛਲੇ ਪਾਸੇ ਕੀ ਹੈ ,ਇਹ ਨਹੀ ਦੇਖ ਸਕਦੇ।ਹਰ ਪੱਤੇ ਵਿੱਚ ਜੋੜ ਛੁੱਪਿਆ ਹੋਇਆ ਹੈ।ਜੋੜ ਇਸ ਤਰਾਂ ਦਾ ਦਿਖਾਈ ਦੇਵੇਗਾ : 2+2=4, ਬਰਾਬਰ ਚਿਨੰ ਦੇ ਦੋਹਾਂ ਪਾਸੇ ਇੱਕੋ ਜਿਹੇ ਅੰਕ ਹੋਣਗੇ।2 ਅਤੇ 2 ਮਿਲਕੇ 4 ਬਣਾਂਉਦੇ ਹਨ।ਉੱਚੀ ਅਵਾਜ਼ ਵਿਚ ਆਪਣਿਆਂ ਉਂਗਲਾਂ ਤੇ ਗਿਣੋ ਕਿਉਂਕੀ ਜਿੰਨੀ ਵਾਰ ਗਿਣੋਗੇ ਉਨਾਂ ਚੰਗੀ ਤਰਾਂ ਯਾਦ ਹੋਇਗਾ।ਤੁਸੀ ਗਿਣਨ ਲਈ ਡੱਬੇ ,ਬਟਨ ਯਾ ਕਿਸੀ ਚੀਜ਼ ਦੀ ਵਰਤੋ ਕਰ ਸਕਦੇ ਹੋ। ਜੇ ਤੁਹਾਡੇ ਬਹੁਤ ਸਾਰੇ ਭੇਣ ਭਰਾ ਹੈ ਤਾਂ ਤੁਸੀ ਉਹਨਾਂ ਨੂੰ ਵੀ ਗੀਣ ਸਕਦੇ ਹੋ।ਆਪਣੀ ਸਕੂਲ ਦੀ ਜਮਾਤ ਵਾਲੇ ਬੱਚਿਆਂ ਨੂੰ ਗਿਣ ਸਕਦੇ ਹੋ। ਗਿਣਤੀ ਵਾਲੇ ਗਾਣੇ ਗਾਓ, ਅੱਭਿਆਸ ਦੇ ਤੋਰ ਤੇ ਜਿਨੀ ਜਿਆਦਾ ਚੀਜ਼ਾਂ ਗਿਣ ਸਕਦੇ ਹੋ ,ਗਿਣੋ ਅਤੇ ਤੁਸੀ ਗਿਣਤੀ ਵਿੱਚ ਬਹੁਤ ਮਾਹਿਰ ਹੋ ਜਾਵੋਗੇ।ਇਸ ਖੇਡ ਵਿਚ ਪੱਤੇ ਜੋੜ ਦੇ ਦੋ ਭਾਗਾਂ ਨੂੰ ਛੁਪਾ ਕੇ ਰਖਦੇ ਹਨ(ਜਿਨਾੰ ਨੂੰ ਅਸੀ ਅੰਕਾੰ ਦਾ ਜੋੜ ਕਿੰਹਦੇ ਹਾਂ)।ਤੁਹਾਨੂੰ ਜੋੜ ਦੇ ਦੋਨਾਂ ਭਾਗਾਂ ਨੂੰ ਲੱਭਣਾ ਹੈ ਅਤੇ ਉਹਨਾਂ ਨੂੰ ਇੱਕਠਾ ਕਰਨਾ ਹੈ।ਪੱਤੇ ਤੇ ਕਲਿਕ ਕਰ ਕੇ ਦੇਖੋ ਕਿ ਉਹਦੇ ਵਿੱਚ ਕਿਹੜਾ ਅੰਕ ਛੁੱਪਿਆ ਹੋਇਆ ਹੈ ਫੇਰ ਉਸਦੇ ਨਾਲ ਦਾ ਪੱਤਾ ਲੱਭਣ ਦੀ ਕੋਸ਼ਿਸ਼ ਕਰੋ ਤਾਂਕੀ ਉਹਨਾਂ ਦਾ ਜੋੜ ਬਣ ਸਕੇ।ਤੁਸੀ ਸਿਰਫ ਇੱਕ ਵਾਰੀ ਵਿੱਚ 2 ਪੱਤੇ ਹੀ ਪਲਟਾ ਸਕਦੇ ਹੋ,ਇਸ ਕਰਕੇ ਤੁਹਾਨੰ ਯਾਦ ਰਖਣਾ ਹੋਇਗਾ ਕਿ ਅੰਕ ਕਿੱਥੇ ਛੁਪੇ ਹਨ,ਫੇਰ ਹੀ ਤੁਸੀ ਦੋਨਾ ਨੂੰ ਮਿਲਾ ਸਕਦੇ ਹੇ ਜਦੋਂ ਤੁਹਾਨੂੰ ਦੂਜਾ ਪੱਤਾ ਮਿਲ ਜਾਇਗਾ। ਤੁਸੀ ਬਰਾਬਰ ਚਿਨੰ ਦਾ ਕੰਮ ਕਰ ਰਹੇ ਹੋ ਅਤੇ ਤੁਹਾਨੂੰ ਅੰਕ ਇੱਕਠੇ ਪਾਣੇ ਹੋਣਗੇ ਤਾਂ ਜੇ ਉਹਨਾਂ ਦਾ ਸਹੀ ਜੋੜ ਨਿਕਲ ਸਕੇ।ਜਦੋਂ ਤੁਸੀ ਇਦਾਂ ਕਰੋਗੇ ਤਾਂ ਦੋਨੋ ਪੱਤੇ ਗਾਇਬ ਹੋ ਜਾਣਗੇ। ਜੇ ਤੁਸੀ ਸਾਰਿਆਂ ਪੱਤਿਆਂ ਨੂਂ ਗਾਇਬ ਕਰਤਾ ਅਤੇ ਸਾਰਿਆਂ ਦਾ ਜੇੜ ਕੱਡ ਲਿਆ ਤਾਂ ਇਸਦਾ ਮਤਲਬ ਤੁਸੀ ਖੇਡ ਜਿੱਤ ਲਈ।

source: Addition and subtraction memory game
ar_tn: لعبة ذاكرة الجمع و الطرح
pa: ਜਮਾ ਘਟਾ ਸਿਮਰਨ ਸ਼ਕਤੀ ਖੇਡ
ro: Jocuri de adunare și scădere

source: Practise addition, subtraction, until all the cards are gone.
ar_tn: مارس الجمع و الطرح إلى أن تختفي جميع البطاقات
pa: ਜਦ ਤਕ ਸਾਰੇ ਪੱਤੇ ਗਾਇਬ ਨਾ ਹੋ ਜਾਣ, ਜਮਾ ਘਟਾ ਦਾ ਅਭਿੱਆਸ ਕਰੋ।
ro: Practicați adunarea și scăderea până când toate fișele vor dispărea.

source: Turn the cards over to find two numbers which add or subtract the same, until all the cards are gone.
ar_tn: اقلب البطاقات لتجد رقمين لديهما نفس محصلة الجمع أو الطرح إلى أن تختفي جميع البطاقات
pa: ਸਾਰੇ ਪੱਤੇ ਪੱਲਟ ਕੇ ਉਹ ਦੋ ਅੰਕ ਲੱਭੋ,ਜਿਨਾੰ ਦਾ ਜੋੜ ਅਤੇ ਘਟਾ ਦਿੱਤੇ ਸਮਾਨ ਹੋਵੇ,ਜਦ ਤਕ ਸਾਰੇ ਪੱਤੇ ਗਾਇਬ ਨਾ ਹੋ ਜਾਣ
ro: Întoarceți cărțile pentru a găsi două numere care se adună sau scad la fel, până când toate cărțile dispar.

source: You can see some cards, but you can't see what's on the other side of them. Each card is hiding an operation, or the answer to it. In this game, these cards are hiding the two parts of an operation. You need to find the two parts of the operation, and bring them together again. Click on a card to see what number it's hiding, then try to find the other card that goes with it, to make a whole operation. You can only turn over two cards in one go, so you need to remember where the numbers are hiding, then you can match them when you find their other half. You're doing the job of the equals sign, and the numbers need you to put them together and make a proper equality. When you do that, both those cards disappear! When you've made them all disappear, found all the operations, you've won the game! :)
ar_tn: بإمكانك رؤية بعض البطاقات و لكنك لا تستطيع رؤية ما في وجها الآخر. كل بطاقة يخفي عملية حسابية أو الإجابة لها. . في هذه اللعبة، هذه البطاقات تخفي جزئين من العملية الحسابية ، عليك ايجاد جزئي المجموع و تقريبهم لبعض مجدداً. أنقر على بطاقة لترى الرقم الذي يخفيه، ثم حاول إيجاد البطاقة الآخر المتوافق معه، للحصول على مجموع كامل، بإمكانة قلب بطاقتين في مرة واحدة ، لذا عليك أن تذكر أين الأرقام مخبأة ثم تستطيع مطابقتهم عندما تجد نصفهم الآخر. أنت الآن تقوم بعمل رمز المساواة، و الأرقام تطلب منك أن تضعها مع بعضها لتشكيل مجموع متناسب. عندما تقوم بهذا، كلا البطاقتين سوف يختفيان، جد جميع المجاميعلقد ربحت اللعبة! :)
pa: ਤੁਸੀ ਕੁੱਝ ਪੱਤੇ ਦੇਖ ਸਕਦੇ ,ਪਰ ਉਹਨਾਂ ਦੇ ਪਿਛਲੇ ਪਾਸੇ ਕੀ ਹੈ ,ਇਹ ਨਹੀ ਦੇਖ ਸਕਦੇ।ਹਰ ਪੱਤੇ ਪਿੱਛੇ ਹਿਸਾਬ ਕਿ੍ਆ ਪ੍ਣਾਲੀ ਛੁੱਪੀ ਹੋਈ ਹੈ ਜਾਂ ਉਸਦਾ ਜਵਾਬ ਹੈ। ਇਸ ਖੇਡ ਵਿੱਚ ਇਹ ਪੱਤੇ ਕਾਰਜ ਦੇ ਦੋ ਪਹਿਲੂਆਂ ਲੁਕਾ ਰਹੇ ਹਨ।ਤੁਸੀ ਕਾਰਜ ਦੇ ਇਹਨਾਂ ਦੋ ਪਹਿਲੂਆਂ ਨੂੰ ਲੱਭਣਾ ਹੈ ਅਤੇ ਉਹਨਾਂ ਨੂੰ ਦੋਬਾਰਾ ਇਕੱਠੇ ਕਰਨਾ ਹੈ।ਪੱਤੇ ਤੇ ਕਲਿਕ ਕਰਕੇ ਦੇਖੋ,ਉਹਦੇ ਥੱਲੇ ਕਿਹੜਾ ਅੰਕ ਹੈ ,ਫਿਰ ਦੂਜਾ ਪੱਤਾ ਲੱਭਣ ਦੀ ਕੋਸ਼ਿਸ਼ ਕਰੋ ਜੋ ਇਸ ਨਾਲ ਮਿਲ ਕੇ ਕੰਮ ਪੂਰਾ ਕਰੇਗਾ।ਤੁਸੀ ਸਿਰਫ ਇੱਕ ਵਾਰੀ ਵਿੱਚ 2 ਪੱਤੇ ਹੀ ਪਲਟਾ ਸਕਦੇ ਹੋ,ਇਸ ਕਰਕੇ ਤੁਹਾਨੰ ਯਾਦ ਰਖਣਾ ਹੋਇਗਾ ਕਿ ਅੰਕ ਕਿੱਥੇ ਛੁਪੇ ਹਨ ਤਾਂ ਕਿ ਦੂਜਾ ਪੱਤਾ ਮਿਲਣ ਤੇ ਤੁਸੀ ਉਹਨਾਂ ਨੂੰ ਮਿਲਾ ਸਕੋ।ਤੁਸੀ ਬਰਾਬਰ ਚਿਨੰ ਦਾ ਕੰਮ ਕਰ ਰਹੇ ਹੋ ।ਤੁਸੀ ਅੰਕ ਨੂੰ ਇੱਕਠੇ ਕਰਨਾ ਹੈ ਤਾਂ ਕਿ ਉਹ ਬਰਾਬਰ ਜੋੜੀ ਬਣਾ ਸਕੱਣ।ਜਦੋਂ ਤੁਸੀ ਇਦਾਂ ਕਰੋਗੇ ਤਾਂ ਦੋਨੋ ਪੱਤੇ ਗਾਇਬ ਹੋ ਜਾਣਗੇ।ਜੇ ਤੁਸੀ ਸਾਰਿਆਂ ਪੱਤਿਆਂ ਨੂਂ ਗਾਇਬ ਕਰਤਾ ਤਾਂ ਤੁਸੀ ਖੇਡ ਜਿੱਤ ਜਾਓਗੇ।

source: Addition, subtraction, multiplication, division
ar_tn: جمع، طرح، ضرب، قسمة
pa: ਜੋੜ,ਘਟਾ,ਗੁਣਾ,ਤਕਸੀਮ
ro: Adunarea, scăderea, înmulțirea și scăderea

source: All operations memory game
ar_tn: لعبة ذاكرة جميع العمليات
pa: ਕਿ੍ਆ ਪ੍ਣਾਲੀ ਵਾਲੀ ਮੈਮਿਊਰੀ ਖੇਡ
ro: Toate activitățile pentru antrenarea memoriei.

source: Practise addition, subtraction, multiplication, division, until all the cards are gone.
ar_tn: مارس الجمع، الطرح، الضرب, القسمة إلى أن تختفي جميع البطاقات
pa: ਜਦ ਤਕ ਸਾਰੇ ਪੱਤੇ ਗਾਇਬ ਨਾ ਹੋ ਜਾਣ ,ਜੋੜ,ਘਟਾ,ਗੁਣਾ,ਤਕਸੀਮ ਦਾ ਅਭਿਆਸ ਕਰੋ
ro: Practicați adunarea, scăderea, înmulțirea, împărțirea, până când toate fișele vor dispărea.

source: Turn the cards over to find a matching operation, until all the cards are gone.
ar_tn: اقلب جميع البطاقات لتجد عملية مطابقة إلى أن تختفي جميع البطاقات
pa: ਜਦ ਤਕ ਸਾਰੇ ਪੱਤੇ ਗਾਇਬ ਨਾ ਹੋ ਜਾਣ ,ਜੋੜੀਦਾਰ ਕਿ੍ਆ ਪ੍ਣਾਲੀ ਲੱਭਣ ਲਈ ਸਾਰੇ ਪੱਤੇ ਪਲਟੋ।
ro: Întoarceți cărțile pentru a găsi operații indentice, până când toate cărțile dispar.

source: All operations memory game against Tux
ar_tn: لعبة ذاكرة جميع العمليات ضد البطريق
pa: ਟਕਸ ਦੇ ਖਿਲਾਫ ਸਾਰਿਆਂ ਕਿ੍ਆ ਪ੍ਣਾਲੀ ਵਾਲੀ ਮੈਮਿਊਰੀ ਖੇਡ
ro: Toate activitățile pentru antrenarea memoriei contra Tux.

source: Addition and subtraction memory game against Tux
ar_tn: لعبة ذاكرة الجمع و الطرح ضد البطريق
pa: ਟਕਸ ਦੇ ਖਿਲਾਫ ਜੋੜ ਅਤੇ ਘਟਾ ਵਾਲੀ ਮੈਮਿਊਰੀ ਖੇਡ
ro: Un joc cu adunarea și scăderea contra Tux

source: Addition memory game against Tux
ar_tn: لعبة ذاكرة الجمع ضد البطريق
pa: ਟਕਸ ਦੇ ਖਿਲਾਫ ਜੋੜ ਵਾਲੀ ਮੈਮਿਊਰੀ ਖੇਡ
ro: Un joc cu adunarea contra Tux

source: Additions
ar_tn: الجمع
pa: ਜੋੜ
ro: Adunarea

source: Division
ar_tn: القسمة
pa: ਤਕਸੀਮ
ro: Împărțirea

source: Division memory game
ar_tn: لعبة ذاكرة القسمة
pa: ਤਕਸੀਮ ਵਾਲੀ ਮੈਮਿਊਰੀ ਖੇਡ
ro: Joc de memorie cu împărțirea

source: Practise division, until all the cards are gone.
ar_tn: مارس القسمة إلى أن تختفي جميع البطاقات
pa: ਜਦ ਤਕ ਸਾਰੇ ਪੱਤੇ ਗਾਇਬ ਨਾ ਹੋ ਜਾਣ ਤਕਸੀਮ ਦਾ ਅਭਿਆਸ ਕਰੋ
ro: Practicați împărțirea până când toate fișele vor dispărea.

source: Division memory game against Tux
ar_tn: لعبة ذاكرة القسمة ضد البطريق
pa: ਟਕਸ ਦੇ ਖਿਲਾਫ ਤਕਸੀਮ ਵਾਲੀ ਮੈਮਿਊਰੀ ਖੇਡ
ro: Un joc de memorie cu împărțirea contra Tux

source: Go to Memory activities
ar_tn: اذهب إلى أنشطة الذاكرة المعتمدة على الألوان
pa: ਸਿਮਰਨ ਸ਼ਕਤੀ ਕਿ੍ਆਵਾਂ ਤੇ ਜਾਓ
ro: Mergi la activități de memorie

source: Various memory activities (images, letters, sounds).
ar_tn: نشاطات ذاكرة متعددة
pa: ਕੁੱਝ ਸਿਮਰਨ ਸ਼ਕਤੀ ਕਿ੍ਆਵਾਂ(ਤਸਵੀਰ,ਅੱਖਰ.ਆਵਾਜ਼)
ro: Activități diferite pentru memorie (imagini, scrisori, sunete).

source: Practise subtraction, until all the cards are gone.
ar_tn: مارس عملية الطرح من خلال لعبة مسلية
pa: ਜਦ ਤਕ ਸਾਰੇ ਪੱਤੇ ਗਾਇਬ ਨਾ ਹੋ ਜਾਣ ਘਟਾ ਦਾ ਅਭਿਆਸ ਕਰੋ
ro: Exersează scăderea, până când toate cărțile au dispărut.

source: Subtraction memory game
ar_tn: لعبة ذاكرة الطرح
pa: ਘਟਾ ਵਾਲੀ ਮੈਮਿਊਰੀ ਖੇਡ
ro: Un joc ce folosește împărțirea

source: Turn the cards over to find two numbers which subtract the same, until all the cards are gone.
ar_tn: اقلب جميع البطاقات لتجد رقمين لديهم نفس نتيجة الطرح إلى أن تختفي جميع البطاقات
pa: ਜਦ ਤਕ ਸਾਰੇ ਪੱਤੇ ਗਾਇਬ ਨਾ ਹੋ ਜਾਣ,ਪੱਤੇ ਪਲਟੋ ਤਾਂ ਕਿ ਉਹ ਦੋ ਅੰਕ ਲੱਭ ਜਾਣ ਜਿਨਾ ਦੀ ਘਟਾਓ ਸਮਾਨ ਹੈ।
ro: Întoarceți cărțile pentru a găsi două numere care se împart identic, până când toate cărțile dispar.

source: You can see some cards, but you can't see what's on the other side of them. Each card is hiding a subtraction, or the answer to it. A subtraction looks like this: 3 - 1 = 2 The numbers on one side of the equals sign (=) have to be the same as the number on the other side. So 3 (1, 2, 3) less 1 (1) makes 2. Count aloud when you work this out, and count on your fingers, because the more ways you do something, the better you remember it. You can also use blocks, or buttons, or anything you can count. If you have lots of brothers and sisters, you can count them! Or the kids in your class at school. Sing counting songs. Count lots of things, for practice, and you'll be very good at adding-up! In this game, these cards are hiding the two parts of a subtraction. You need to find the two parts of the subraction, and bring them together again. Click on a card to see what number it's hiding, then try to find the other card that goes with it, to make a whole sum. You can only turn over two cards in one go, so you need to remember where the numbers are hiding, then you can match them when you find their other half. You're doing the job of the equals sign, and the numbers need you to put them together and make a proper sum. When you do that, both those cards disappear! When you've made them all disappear, found all the subtracts, you've won the game! :)
ar_tn: بإمكانك رؤية بعض البطاقات و لكنك لا تستطيع رؤية ما في وجها الآخر. كل بطاقة تخفي محصلة طرح أو عملية طرح . محصلة عملية الطرح ستشبه التالي:3 -1=2 إن الأرقام على الجهة اليمنى من رمز المساواة (=) يجب أن تكون مساوية للأرقام على الجهة الأخرى. فا3(1،2،3) إلا 1 (1) تساوي 2. عد بصوت مرتفع عندما تحل هذا التمرين وعد على أصابعك، لأنه كلما زادت الطرق لأداء شيئ معين، كلما سهل تذكرها. بإمكانك أيضاً استخدام كتل أو أي شيئ للعد. إن كان لديك العديد من الأخوة و الأخوات، فبإمكانك أن تعدهم! أو الأطفال في صفك في المدرسة. غني أغاني العد. عد الكثير من الأشياء للمارسة و سوف تكون جيدا جداً في العد. في هذه اللعبة، هذه البطاقات تخفي جزئين من المجموع، عليك ايجاد جزئي المجموع و تقريبهم لبعض مجدداً. أنقر على بطاقة لترى الرقم الذي تخفيه، ثم حاول إيجاد البطاقة الأخرى المتوافقة معها، للحصول على مجموع كامل، بإمكانك قلب بطاقتين في مرة واحدة ، لذا عليك أن تذكر أين الأرقام مخبأة ثم تستطيع مطابقتها عندما تجد نصفها الآخر. أنت الآن تقوم بعمل رمز المساواة، و الأرقام تطلب منك أن تضعها مع بعضها لتشكيل مجموع متناسب. عندما تقوم بهذا، كلا البطاقتين سوف تختفيان، جد جميع المجاميع لكي تربح اللعبة! :)
pa: ਤੁਸੀ ਕੁੱਝ ਪੱਤੇ ਦੇਖ ਸਕਦੇ ,ਪਰ ਉਹਨਾਂ ਦੇ ਪਿਛਲੇ ਪਾਸੇ ਕੀ ਹੈ ,ਇਹ ਨਹੀ ਦੇਖ ਸਕਦੇ।ਹਰ ਪੱਤੇ ਪਿੱਛੇ ਹਿਸਾਬ ਕਿ੍ਆ ਪ੍ਣਾਲੀ ਛੁੱਪੀ ਹੋਈ ਹੈ ਜਾਂ ਉਸਦਾ ਜਵਾਬ ਹੈ।ਇੱਕ ਘਟਾਓ ਇਸ ਤਰਾਂ ਦਿਖਦਾ ਹੈ 3-1=2 ਬਰਾਬਰ ਚਿਨੰ ਦੇ ਇੱਕ ਪਾਸੇ ਵਾਲੇ ਅੰਕ ਦੂਜੇ ਪਾਸੇ ਦੇ ਬਰਾਬਰ ਹੋਨੇ ਚਾਹੀਦੇ ਹਨ।ਇਸ ਲਈ 3(1,2,3) ਘਟ 1, 2 ਹੋਇਆ।ਇਹ ਕੰਮ ਕਰਦੇ ਹੋਏ ਉੱਚੀ ਉੱਚੀ ਗਿਣੋ ਅਤੇ ਆਪਣਿਆਂ ਉਂਗਲਾਂ ਤੇ ਗਿਣੋ ਕਿਉਂਕੀ ਜਿਨਾੰ ਚੰਗੀ ਤਰਾਂ ਤੁਸੀ ਇਹ ਕੰਮ ਕਰੋਗੇ ,ਉਹਨਾਂ ਬਿਹਤਰ ਯਾਦ ਰਹੇਗਾ।ਤੁਸੀ ਗਿਣਨ ਲਈ ਡੱਬੇ ,ਬਟਨ ਯਾ ਕਿਸੀ ਚੀਜ਼ ਦੀ ਵਰਤੋ ਕਰ ਸਕਦੇ ਹੋ। ਜੇ ਤੁਹਾਡੇ ਬਹੁਤ ਸਾਰੇ ਭੇਣ ਭਰਾ ਹੈ ਤਾਂ ਤੁਸੀ ਉਹਨਾਂ ਨੂੰ ਵੀ ਗੀਣ ਸਕਦੇ ਹੋ।ਆਪਣੀ ਸਕੂਲ ਦੀ ਜਮਾਤ ਵਾਲੇ ਬੱਚਿਆਂ ਨੂੰ ਗਿਣ ਸਕਦੇ ਹੋ। ਗਿਣਤੀ ਵਾਲੇ ਗਾਣੇ ਗਾਓ, ਅੱਭਿਆਸ ਦੇ ਤੋਰ ਤੇ ਜਿਨੀ ਜਿਆਦਾ ਚੀਜ਼ਾਂ ਗਿਣ ਸਕਦੇ ਹੋ ,ਗਿਣੋ ਅਤੇ ਤੁਸੀ ਗਿਣਤੀ ਵਿੱਚ ਬਹੁਤ ਮਾਹਿਰ ਹੋ ਜਾਵੋਗੇ।ਇਸ ਖੇਡ ਵਿਚ ਪੱਤੇ ਘਟਾਓ ਦੇ ਦੋ ਭਾਗਾਂ ਨੂੰ ਛੁਪਾ ਕੇ ਰਖਦੇ ਹਨ।ਤੁਹਾਨੂੰ ਜੋੜ ਦੇ ਦੋਨਾਂ ਭਾਗਾਂ ਨੂੰ ਲੱਭਣਾ ਹੈ ਅਤੇ ਉਹਨਾਂ ਨੂੰ ਇੱਕਠਾ ਕਰਨਾ ਹੈ।ਪੱਤੇ ਤੇ ਕਲਿਕ ਕਰ ਕੇ ਦੇਖੋ ਕਿ ਉਹਦੇ ਵਿੱਚ ਕਿਹੜਾ ਅੰਕ ਛੁੱਪਿਆ ਹੋਇਆ ਹੈ ਫੇਰ ਉਸਦੇ ਨਾਲ ਦਾ ਪੱਤਾ ਲੱਭਣ ਦੀ ਕੋਸ਼ਿਸ਼ ਕਰੋ ਤਾਂਕੀ ਉਹਨਾਂ ਦਾ ਘਟਾਓ ਬਣ ਸਕੇ।ਤੁਸੀ ਸਿਰਫ ਇੱਕ ਵਾਰੀ ਵਿੱਚ 2 ਪੱਤੇ ਹੀ ਪਲਟਾ ਸਕਦੇ ਹੋ,ਇਸ ਕਰਕੇ ਤੁਹਾਨੰ ਯਾਦ ਰਖਣਾ ਹੋਇਗਾ ਕਿ ਅੰਕ ਕਿੱਥੇ ਛੁਪੇ ਹਨ,ਫੇਰ ਹੀ ਤੁਸੀ ਦੋਨਾ ਨੂੰ ਮਿਲਾ ਸਕਦੇ ਹੇ ਜਦੋਂ ਤੁਹਾਨੂੰ ਦੂਜਾ ਪੱਤਾ ਮਿਲ ਜਾਇਗਾ। ਤੁਸੀ ਬਰਾਬਰ ਚਿਨੰ ਦਾ ਕੰਮ ਕਰ ਰਹੇ ਹੋ ਅਤੇ ਤੁਹਾਨੂੰ ਅੰਕ ਇੱਕਠੇ ਪਾਣੇ ਹੋਣਗੇ ਤਾਂ ਜੇ ਉਹਨਾਂ ਦਾ ਸਹੀ ਘਟਾਓ ਨਿਕਲ ਸਕੇ।ਜਦੋਂ ਤੁਸੀ ਇਦਾਂ ਕਰੋਗੇ ਤਾਂ ਦੋਨੋ ਪੱਤੇ ਗਾਇਬ ਹੋ ਜਾਣਗੇ। ਜੇ ਤੁਸੀ ਸਾਰਿਆਂ ਪੱਤਿਆਂ ਨੂਂ ਗਾਇਬ ਕਰਤਾ ਅਤੇ ਸਾਰਿਆਂ ਦਾ ਘਟਾਓ ਕੱਡ ਲਿਆ ਤਾਂ ਇਸਦਾ ਮਤਲਬ ਤੁਸੀ ਖੇਡ ਜਿੱਤ ਲਈ।आप कुछ कार्डस् देख सकते हैं लेकिन उसके पिछे क्या है ये नहीं देख सकते. हर एक कार्डके पिछे घटाव अथवा उसका जवाब छिपाया हुआ है. घटाव 3-1=2 जैसी दिखती है.
