Repository: MkPereira/gcompris
Catalog: po/*.po
Languages: ar_tn, pa, ro

source: - In the 'Boards' section you can change the list of activities. Just untoggle them in the treeview. You can change the language used for reading, for example, then the language used for saying the names of colors. - You can save multiple configurations, and switch between them easily. In the 'Profile' section add a profile, then in the 'Board' section select the profile in the combobox, then select the boards you want to be active. You can add multiple profiles, with different lists of boards, and different languages. You set the default profile in the 'Profile' section, by choosing the profile you want, then clicking on the 'Default' button. You can also choose a profile from the command line. - You can add users, classes and for each class, you can create groups of users. Note that you can import users from a comma-separated file. Assign one or more groups to a profile, after which those new logins will appear after restarting GCompris. Being able to identify individual children in GCompris means we can provide individual reports. It also recognizes the children as individuals; they can learn to type in and recognize their own usernames (login is configurable).
pa: ਬੋਰਡ ਵਿਭਾਗ ਵਿਚ ਤੁਸੀਂ ਕਿਰਿਆਵਾਂ ਦੀ ਸੂਚੀ ਬਦਲ ਸਕਦੇ ਹੋ।ਬੱਸ ਉਹਨਾਂ ਨੂੰ ਟਰੀ-ਵਿਊ ਵਿੱਚ ਅਨਟੌਗਲ ਕਰੋ।ਪਣਨ ਲਈ ਭਾਸ਼ਾ ਬਦਲੀ ਜਾ ਸਕਦੀ ਹੈ।ਉਦਾਹਰਣ ਲਈ ਰੰਗਾਂ ਦੇ ਨਾਮ ਦੱਸਣ ਲਈ ਵਰਤੀ ਜਾਣ ਵਾਲੀ ਭਾਸ਼ਾ.ਬਹੂ ਰੂਪੀ ਰੇਖਾਵਾਂ ਸੇਵ ਕਰ ਸਕਦੇ ਹੋ ਅਤੇ ਇੱਕ ਰੇਖਾ ਤੋਂ ਦੂਜੀ ਵਿੱਚ ਅਸਾਨੀ ਨਾਲ ਜਾ ਸਕਦੇ ਹੋ।ਪਰੋਫਾਇਲ ਸੈਕਸ਼ਨ ਵਿੱਚ ਨਵੀ ਪਰੋਫਾਇਲ ਜੋੜੋ,ਫਿਰ ਬੋਰਡ ਵਿਭਾਗ ਵਿੱਚ ਪਰੋਫਾਇਲ ਨੂੰ ਕੌਮਬੋਬਾਕਸ ਵਿੱਚ ਚੁਣੋਂ,ਫਿਰ ਉਹ ਬੋਰਡ ਚੁਣੋਂ ਜਿਸਨੂੰ ਤੁਸੀਂ ਐਕਟਿਵ ਰਖਣਾਂ ਚਾਹੁੰਦੇ ਹੋ। ਤੁਸੀਂ ਇੱਕ ਤੋਂ ਵਧੇਰੇ ਪਰੋਫਾਇਲਾਂ ਚੁਣ ਸਕਦੇ ਹੋ,ਜਿਹਨਾਂ ਵਿਚ ਵੱਖਰੇ ਬੋਰਡ ਅਤੇ ਵੱਖਰੀਆਂ ਭਾਸ਼ਾਵਾਂ ਹੋਣ। ਪਰੋਫਾਇਲ ਵਿਭਾਗ ਵਿਚ ਡਿਫਾੱਲਟ ਪਰੋਫਾਇਲ ਚੁਣਨ ਲਈ ਕਿਸੇ ਇੱਕ ਪਰੋਫਾਇਲ ਨੂੰ ਚੁਣਕੇ ਡਿਫਾੱਲਟ ਬਟਨ ਤੇ ਕਲਿੱਕ ਕਰੋ। ਤੁਸੀਂ ਕਮਾਂਡ ਲਾਈਨ ਤੋਂ ਵੀ ਪਰੋਫਾਇਲ ਚੁਣ ਸਕਦੇ ਹੋ। ਤੁਸੀਂ ਨਵੇਂ ਯੂਜ਼ਰ ਅਤੇ ਕਲਾਸ ਜੋੜ ਸਕਦੇ ਹੋ ਅਤੇ ਹਰ ਕਲਾਸ ਲਈ ਯੂਜ਼ਰਾਂ ਦਾ ਸਮੂਹ ਬਣਾ ਸਕਦੇ ਹੋ। ਇਹ ਗਲ ਨੋਟ ਕੀਤੀ ਜਾਵੇ ਕਿ ਤੁਸੀਂ ਯੂਜ਼ਰ ਕੌਮੇ ਨਾਲ ਵੱਖ ਕੀਤੀਆਂ ਫਾਈਲਾਂ ਵਿੱਚੋਂ ਇਮਪੋਰਟ ਕਰਵਾ ਸਕਦੇ ਹੋ।ਇੱਕ ਪਰੋਫਾਇਲ ਨੂੰ ਇੱਕ ਜਾਂ ਇੱਕ ਤੋਂ ਵੱਧ ਗਰੁੱਪ ਦੇਵੋ। ਜੀ ਕੌਮਪਰਿਸ ਦੁਬਾਰਾ ਸ਼ੁਰੂ ਕਰਨ ਤੇ ਨਵੇਂ ਲੌਗਿਨ ਦਿਖਾਈ ਦੇਣਗੇ। ਹਰ ਬੱਚੇ ਨੂੰ ਵੱਖਰਾ ਪਹਿਚਾਨਣ ਦਾ ਮਤਲਬ ਹੈ ਹਰ ਬੱਚੇ ਦੀ ਵੱਖਰੀ ਰਿਪੋਰਟ ਦੇਣੀ। ਇਹ ਹਰ ਬੱਚੇ ਨੂੰ ਵੱਖਰਾ ਪਹਿਚਾਣਦਾ ਹੈ । ਬੱਚੇ ਆਪਣਾ ਯੂਜ਼ਰ ਨਾਮ ਟਾਇਪ ਕਰਨਾ ਅਤੇ ਪਹਿਚਾਨਣਾ ਸਿੱਖ ਸਕਦੇ ਹਨ(ਲੌਗਿਨ ਕਨਫਿਊਗਰੇਬਲ ਹੈ)।
ro: - În secțiunea „Table” puteți modifica lista cu activități. Trebuie doar să le comutați în vizualizarea arborescentă. Puteți modifica limba folosită pentru citit, astfel încât să fie diferită față de cea folosită pentru rostirea culorilor. - Puteți salva mai multe configurații, și să comutați între ele ușor. În secțiunea „Profiluri” adăugați un profil, apoi în secțiunea „Table” selectați profilul din lista de selecție, apoi selectați tabla pe care doriți să o utilizați. Puteți adăuga diverse profiluri, cu diferite liste de table și diferite limbi. Pentru a seta profilul implicit, alegeți-l din secțiunea „Profiluri” și dați clic pe butonul „Implicit”. Există de asemenea și posibilitatea de a alege un profil din linia de comandă. - Puteți adăuga utilizatori, clase și pentru fiecare clasă puteți crea un grup de utilizatori. Nu uitați că puteți importa utilizatori dintr-un fișier în care sunt separați cu virgulă. Asociați unul sau mai multe grupuri unui profil, după care noile autentificări vor apărea de îndată ce GCompris a fost repornit. Folosind GCompris puteți identifica fiecare copil în parte, în acest mod putându-se crea câte un raport individual. De asemenea copiii sunt recunoscui ca indivizi; ei pot învăța să își scrie și să își recunoască propriul nume de utilizator (autentificarea este configurabilă).

source: GCompris Administration Menu
ar_tn: قائمة الإختيارات الرئيسية لجكومبري
pa: ਜੀ ਕੌਮਪਰਿਸ ਪਰਬੰਧਕ ਮੇਨੂ
ro: Meniu de administrare GCompris

source: If you want to fine tune GCompris to your needs, you can use the administration module here. The ultimate goal is to provide child-specific reporting for parents and teacher who want to monitor the progress, strengths and needs of their children.
ar_tn: إذا أردت أن تعدل جكمبري وفقاً لحاجاتك، بإمكانك استخدام الوحدة ا لإدارية هنا. إن الهدف النهائي هو توفر عملية تقرير خاصة بالطفل للآباء و المدرسين الراغبين في الإشراف على مسيرة تطور أطفالهم، و نقاط القوة و الضعف لديهم
pa: ਜੀ ਕੌਮਪਰਿਸ ਨੂੰ ਆਪਣੀ ਜ਼ਰੂਰਤ ਦੇ ਹਿਸਾਬ ਨਾਲ ਟਿਊਨ ਕਰਨ ਲਈ ਐਡਮਨਿਸਟਰੇਸ਼ਨ ਮੌਡਿਊਲ ਦੀ ਵਰਤੋਂ ਕਰੋ। ਇੱਥੇ ਮੁੱਖ ਟੀਚਾ ਬੱਚਿਆਂ ਨਾਲ ਖਾਸ ਸੰਬੰਧਿਤ ਰਪਟ ਅਧਿਆਪਕਾਂ ਅਤੇ ਮਾਤਾ ਪਿਤਾ ਨੂਂ ਮੁਹਇਆ ਕਰਵਾਉਣਾ ਹੈ ਜੋ ਆਪਣੇ ਬੱਚਿਆਿਹਨ।
ro: Pentru a adapta GCompris la necesitățile voastre, puteți folosi modulul de administrare. Scopul final este de prevederea rapoartelor particulare afiecarui copil pentru părinți și profesori, care doresc să monitorizeze progresul, virtutea și necesitățile copiilor lor.

source: Left-Click with the mouse to select an activity
ar_tn: انقر بزر الفأرة الأيسر لاختيار النشاط اللذي تريده
pa: ਐਕਟਿਵਿਟੀ ਚੁਨਣ ਲਈ ਮਾਊਸ ਨਾਲ ਲੈਫਟ ਕਲਿੱਕ ਕਰੋ।
ro: Dați clic stânga cu mausul pentru a selecta o activitate

source: Advanced colors
ar_tn: ألوان مركبة
pa: ਆਧੁਨਿਕ ਰੰਗ
ro: Culori avansate

source: Can read
ar_tn: تعلم القراءة
pa: ਪੜ੍ ਸਕਦੇ ਹੋ।
ro: Poate citi

source: Click on the correct color
ar_tn: أنقر على اللون المناسب
pa: ਸਹੀ ਰਂਗ ਤੇ ਕਲਿੱਕ ਕਰੋ।
ro: Dă clic pe culoarea corectă

source: Click on the correct colored box.
ar_tn: أنقر على العلبة الملونة المناسبة
pa: ਸਹੀ ਰਂਗ ਵਾਲੇ ਡੱਬੇ ਤੇ ਕਲਿੱਕ ਕਰੋ
ro: Dă clic pe cutia avînd culoarea corectă

source: Learn to recognize unusual colors.
ar_tn: تعلم تمييز الألوان النادرة
pa: ਵਿਲੱਖਣ ਰੰਗ ਪਹਿਚਾਨਣਾ ਸਿੱਖੋ।
ro: Învață să recunoști culori neobișnuite.

source: almond
ar_tn: لوزي
pa: ਬਦਾਮੀ ਰੰਗ
ro: migdală

source: chestnut
ar_tn: كستنائي
pa: ਭੂਰਾ ਰੰਗ
ro: castană

source: claret
ar_tn: أرجواني داكن
pa: ਗੂੜਾ ਲਾਲ ਰੰਗ
ro: vin roșu

source: cobalt
ar_tn: فضي
pa: ਧੁੰਦਲਾ ਨੀਲਾ ਰੰਗ

source: coral
ar_tn: مرجاني
pa: ਮੂੰਗੀਆ ਰੰਗ

source: corn
ar_tn: قمحي
pa: ਮੱਕੀ ਵਾਲਾ ਰੰਗ
ro: porumb

source: cyan
ar_tn: أزرق
pa: ਸਾਯਨ ਰੰਗ
ro: turcoaz

source: sienna
ar_tn: ترابي
pa: ਮਿੱਟੀ ਦਾ ਰੰਗ
ro: siena

source: lime
ar_tn: زيزفوني
pa: ਨੀਂਬੂ ਦਾ ਰੰਗ
ro: lămâie verde

source: sage
ar_tn: ناعم
pa: ਗੂੜ ਹਰਾ ਰੰਗ
ro: salvie

source: salmon
ar_tn: سلموني
pa: ਗੇਰੂਆ ਰੰਗ
ro: somon

source: sapphire
ar_tn: صفيري
pa: ਗੂੜ ਨੀਲਾ ਰੰਗ
ro: safir

source: sepia
ar_tn: بني داكن
pa: ਕਾਲਾ ਭੂਰਾ ਰੰਗ
ro: sepie

source: sulphur
ar_tn: كبريتي
pa: ਗੰਧਕ ਦਾ ਰੰਗ
ro: sulfură

source: tea
ar_tn: شاي
pa: ਚਾਹ ਦਾ ਰੰਗ
ro: ceai

source: turquoise
ar_tn: فيروزي
pa: ਫਿਰੋਜ਼ੀ ਰੰਗ
ro: turcoaz

source: absinthe
ar_tn: خمري
pa: ਲੱਕੜ ਦਾ ਰੰਗ
ro: absint

source: alabaster
ar_tn: مرمري
pa: ਸੰਗਮਰਮਰ ਵਰਗਾ ਚਿੱਟਾ ਰੰਗ
ro: alabastru

source: amber
ar_tn: كهرماني
pa: ਅੰਬਰ ਰੰਗ
ro: chihlimbar

source: amethyst
ar_tn: أرجواني
pa: ਜਾਮੁਨੀ ਰੰਗ
ro: ametist

source: anise
ar_tn: ينسوني
pa: ਸੌਂਫ ਦੇ ਬੀਜ ਦਾ ਰੰਗ
ro: anison

source: aquamarine
ar_tn: زبرجدي
pa: ਹਰਾ ਨੀਲਾ ਰੰਗ
ro: aquamarin

source: mahogany
ar_tn: أكاجو بني محمر
pa: ਲਾਲ ਭੂਰਾ ਰੰਗ
ro: mahon

source: vermilion
ar_tn: قرمزي
pa: ਸਿੰਧੂਰੀ ਰੰਗ
ro: vermil

source: aubergine
ar_tn: باذنجاني
pa: ਬੈਂਗਨੀ ਰੰਗ
ro: vânătă

source: ceruse
ar_tn: كرزي
pa: ਚਿੱਟਾ ਰੰਗ
ro: plumb alb

source: chartreuse
ar_tn: خمري
pa: ਫਿੱਕਾ ਹਰਾ ਰੰਗहलका हरा रंग
ro: lichior

source: emerald
ar_tn: زمردي
pa: ਪੰਨਾ ਦਾ ਰੰਗ
ro: smarald

source: fawn
ar_tn: خشفي
pa: ਪੀਲੱਤਣ ਵਾਲਾ ਭੂਰਾ ਰੰਗ
ro: castaniu

source: fuchsia
ar_tn: أرجواني
pa: ਫੁੱਲ-ਪਤਿਆਂ ਦਾ ਰੰਗ
ro: fucsie

source: glaucous
ar_tn: أخضر شاحب
pa: ਮੇਘਨੀਲ ਰੰਗ
ro: glauc

source: ruby
ar_tn: ياقوتي
pa: ਗੂੜਾ ਲਾਲ ਰੰਗ
ro: rubin

source: auburn
ar_tn: كستنائي
pa: ਸੁਨਹਿਰੀ ਭੂਰਾ ਰੰਗ
ro: roșcat

source: azure
ar_tn: أزرق سماوي
pa: ਆਸਮਾਨੀ ਰੰਗ
ro: azur

source: bistre
ar_tn: بيستري
pa: ਬਰੀਸਟ ਵਰਗਾ ਰੰਗ
ro: bistru

source: celadon
ar_tn: سيلادوني
pa: ਸੈਲਾਡੋਨ ਵਰਗਾ ਰੰਗ
ro: verde deschis

source: cerulean
ar_tn: أزرق
pa: ਗੂੜਾ ਨੀਲਾ ਰੰਗ
ro: azuriu

source: crimson
ar_tn: قرمزي
pa: ਕਿਰਮਜੀ ਰੰਗ
ro: stacojiu

source: greyish-brown
ar_tn: أسمر رمادي
pa: ਭੂਰਾ ਬਦਾਮੀ ਰੰਗ
ro: cafeniu-suriu

source: dove
ar_tn: يمامي
pa: ਬੱਤਖ ਪੰਛੀ ਦਾ ਰੰਗ
ro: porumbel

source: garnet
ar_tn: عقيقي
pa: ਰਕਤਮਣੀ ਰੰਗ
ro: rodie

source: indigo
ar_tn: نيلي
pa: ਨੀਲਾ ਰੰਗ

source: ivory
ar_tn: عاجي
pa: ਹਾਥੀ ਦੰਦ ਵਰਗਾ ਚਿੱਟਾ ਰੰਗ
ro: fildeș

source: jade
ar_tn: يشبي
pa: ਹਰਿਤਾਸ਼ਮ ਰੰਗ
ro: jad

source: lavender
ar_tn: خُزامى
pa: ਨੀਲਾ ਲੋਹਿਤ ਰੰਗ
ro: levănțică

source: lichen
ar_tn: طحلبي
pa: ਸ਼ੈਵਾਲ ਵਰਗਾ ਹਰਾ ਰੰਗ

source: wine
ar_tn: نبيذي
pa: ਗੂੜਾ ਲਾਲ ਰੰਗ
ro: vin

source: larch
ar_tn: أرزي
pa: ਦੇਵਦਾਰੂ ਦਰੱਖਤ ਦਾ ਰੰਗ
ro: buștean

source: lilac
ar_tn: أرجواني فاتح
pa: ਨੀਲਾ ਰੰਗ
ro: liliac

source: magenta
ar_tn: أرجواني
pa: ਗੁਲਾਬੀ ਰੰਗ
ro: fucsină

source: malachite
ar_tn: ملاكيتي
pa: ਹਰੇ ਖਨਿੱਜ ਵਰਗਾ ਰੰਗ
ro: malacit

source: mimosa
ar_tn: سنطي
pa: ਲਜਾਲੂ ਬੂਟੇ ਦਾ ਰੰਗ
ro: mimoză

source: navy
ar_tn: بحري
pa: ਗੂੜਾ ਨੀਲਾ ਰੰਗ
ro: marină

source: ochre
ar_tn: ذهبي
pa: ਗੇਰੂਆ ਰੰਗ
ro: ocru

source: olive
ar_tn: زيتوني
pa: ਭੂਰਾ ਹਰਾ ਰੰਗ
ro: măslină

source: greyish blue
ar_tn: أزرق رمادي
pa: ਭੂਰਾ ਨੀਲਾ ਰੰਗ
ro: albastru gri

source: mauve
ar_tn: بنفسجي فاتح
pa: ਚਮਕੀਲਾ ਬੈਗਨੀ ਰੰਗ
ro: mov

source: opaline
ar_tn: براق
pa: ਵਿਮਲ ਕੱਚ ਵਰਗਾ ਚਿੱਟਾ ਰੰਗ
ro: semitransparent

source: pistachio
ar_tn: فستقي
pa: ਪਿਸਤੇ ਦਾ ਹਰਾ ਰੰਗ
ro: fistic

source: platinum
ar_tn: رمادي معتدل
pa: ਭੂਰਾ ਸੁਨਹਿਰੀ ਰੰਗ
ro: platină

source: purple
ar_tn: بنفسجي
pa: ਜਾਮੁਨੀ ਰੰਗ
ro: purpuriu

source: ultramarine
ar_tn: الازوردي
pa: ਗੂੜਾ ਨੀਲਾ ਰੰਗ
ro: ultramarin

source: dark purple
ar_tn: بنفسجي داكن
pa: ਗੂੜਾ ਜਾਮੁਨੀ ਰੰਗ
ro: purpuriu închis

source: plum
ar_tn: برقوقي
pa: ਲਾਲ ਹਰਾ ਰੰਗ
ro: prună

source: prussian blue
ar_tn: أزرق داكن
pa: ਗੂੜਾ ਨੀਲਾ ਰੰਗ
ro: albatru prusac

source: rust
ar_tn: خمري
pa: ਜ਼ੰਗ ਦਾ ਰੰਗ
ro: rugină

source: saffron
ar_tn: زعفراني
pa: ਕੇਸਰੀ ਰੰਗ
ro: safran

source: vanilla
ar_tn: فانيلا
pa: ਵੈਨੀਲਾ ਬੂਟੇ ਦਾ ਰੰਗ
ro: vanilie

source: verdigris
ar_tn: جنزاري
pa: ਜੰਗਾਰ ਵਰਗਾ ਰੰਗ
ro: cocleala

source: veronese
ar_tn: فيرونيسي
pa: ਨੀਲੇ,ਚਿੱਟੇ,ਜਾਮੁਨੀ ਫੁੱਲਾਂ ਵਾਲੇ ਬੂਟੇ ਦਾ ਰੰਗ
ro: veronez

source: A multiplication of two numbers is displayed. At the right of the equals sign, give the answer, the product. Use the left and right arrows to modify your answer and press the Enter key to check if you've got it right. If not, just try again.
ar_tn: سيتم عرض عملية ضرب عددين. أدخل الإجابة على يمين علامة التساوي. استعمل الأسهم يمين يسار لتغيير إجابتك, و مفتاح الإدخال لتثبيت الإجابة
pa: ਦੋ ਅੰਕਾਂ ਦਾ ਗੁਣਾਂ ਦਿਖਾਇਆ ਗਿਆ ਹੈ।ਬਰਾਬਰ ਚਿੰਨ੍ ਦੇ ਸੱਜੇ ਪਾਸੇ ਗੁਣਾਂ ਦਾ ਜਵਾਬ ਲਿਖੋ।ਆਪਣਾ ਜਵਾਬ ਬਦਲਣ ਲਈ ਬੋਰਡ ਦੇ ਸੱਜੇ ਅਤੇ ਖੱਬੇ ਤੀਰ ਵਾਲੇ ਬਟਨਾਂ ਦੀ ਵਰਤੋਂ ਕਰੋ।ਜਵਾਬ ਦੀ ਜਾਂਚ ਕਰਨ ਲਈ ਐਂਟਰ ਬਟਨ ਦਬਾਓ ਅਤੇ ਜੇਕਰ ਜਵਾਬ ਗਲਤ ਹੈ ਤਾਂ ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
ro: Produsul a două numere este afișat. Dați rezultatul, produsul, în dreapta semnului egal. Folosiți săgețile dreapta și stânga pentru a modifica răspunsurile dumneavoastră și apăsați tasta Enter pentru a verifica dacă ați raspuns corect. Dacă nu, încercați din nou.

source: Answer some algebra questions
ar_tn: سأسألك بعض الأسئلة في الحساب
pa: ਬੀਜ-ਗਣਿਤ ਦੇ ਕੁਝ ਸਵਾਲਾਂ ਦੇ ਜਵਾਬ ਦਿਓ
ro: Răspundeți la niște întrebari din algebră.

source: In a limited time, give the product of two numbers
ar_tn: أعط نتيجة عملية ضرب عددين في وقت محدود
pa: ਸੀਮਿਤ ਸਮੇਂ ਵਿੱਚ ਦੋ ਅੰਕਾਂ ਦੀ ਗੁਣਾਂ ਕਰੋ।
ro: În limita timpului, dați produsul a două numere

source: Multiplication table
ar_tn: جدول الضرب
pa: ਪਹਾੜਾ
ro: Tabla înmulțirii

source: Practice the multiplication operation
ar_tn: تدرب على عملية الضرب
pa: ਗੁਣਾਂ ਦੀ ਕਿਰਿਆ ਦਾ ਅਭਿਆਸ ਕਰੋ।
ro: Exersați operația de înmulțire

source: Go to Algebra activities
ar_tn: أنشطة العمليات الحسابية
pa: ਬੀਜ-ਗਣਿਤ ਕਿਰਿਆਵਾਂ ਵੱਲ ਜਾਓ।
ro: Activități de algebră

source: Left-click the mouse on an activity to select it.
ar_tn: انقر بزر الفأرة الأيسر لاختيار النشاط الذي تريده
pa: ਕਿਰਿਆ ਨੂੰ ਸ਼ੁਰੂ ਕਰਨ ਲਈ ਮਾਊਸ ਦਾ ਖੱਬਾ ਬਟਨ ਉਸੀ ਕਿਰਿਆ ਤੇ ਦਬਾਉ।
ro: Apăsați butonul din stânga al mouse-ului pe o activitate pentru a o selecta.

source: Animal pictures come from the Animal Photography Page of Ralf Schmode (http://schmode.net/). Ralf has kindly permitted Gcompris to include his pictures. Thanks a lot, Ralf.
ar_tn: رسوم الحيوانات مأخوذة من صفحة صور الحيوانات لرالف شمود )http://schmode.net ( أعطى رالف جكومبري الإذن لاستعمال رسومه
pa: ਰਾਲਫ ਸਕਮੋਡ (http://schmode.net/)ਦੇ ਪੇਜ ਤੋਂ ਜਾਨਵਰਾਂ ਦੀਆਂ ਤਸਵੀਰਾਂ ਲਈਆਂ ਗਈਆਂ ਹਨ।ਰਾਲਫ ਨੇ ਜੀ ਕੌਮਪਰਿਸ ਨੂੰ ਆਪਣੀਆਂ ਤਸਵੀਰਾਂ ਵਰਤਣ ਦੀ ਆਗਿਆ ਦਿੱਤੀ ਹੈ। ਰਾਲਫ ਨੂੰ ਬਹੁਤ ਧੰਨਵਾਦ।
ro: Pozele animalelor sunt de pe pagina Animal Photography a lui Ralf Schmode (http://schmode.net/). Ralf a permis cu amabilitate să fie incluse pozele lui în Gcompris. Mulțumesc mult, Ralf.

source: At the top of the board area, choose the numbers and arithmetic operators that give the specified result. You can deselect a number or operator by clicking on it again.
ar_tn: لتشكيل عملياتك, اختر أعدادك و عواملك في أعلى اللوحة. تستطيع إلغاء العدد أو العامل بالنقر عليه مرة أخرى.
pa: ਬੋਰਡ ਦੇ ਉੱਪਰਲੇ ਖੇਤਰ ਵਿੱਚੋਂ ਕੁਝ ਅੰਕ ਅਤੇ ਬੀਜ-ਗਣਿਤ ਦੇ ਚਿੰਨ੍ ਚੁਣੋਂ ਜਿਹੜੇ ਨਿਸ਼ਚਿਤ ਨਤੀਜੇ ਦੇਣ। ਇਹਨਾਂ ਨੂੰ ਹਟਾਉਣ ਲਈ ਇਹਨਾਂ ਤੇ ਦੁਬਾਰਾ ਕਲਿੱਕ ਕਰੋ।
ro: Pentru a compune operațiile, alegeți numerele și operatorii aritmetici din partea de sus a tablei. Aceste numere și operatori pot fi deselectați făcând clic pe ele.

source: Deploy a strategy to arrange a set of arithmetic operations to match a given value.
ar_tn: خطط لترتيب جملة من العمليات الحسابية للحصول على قيمة معينة
pa: ਇੱਕ ਇਹੋ ਜਿਹੀ ਹਿਸਾਬ ਪ੍ਣਾਲੀ ਦਾ ਵਰਗ ਤਿਆਰ ਕਰੋ ਜੋ ਦਿੱਤੀ ਹੋਈ ਸੰਖਿਆ ਨਾਲ ਮੇਲ ਖਾਵੇ।
ro: Alegeți o strategie pentru a aranja o mulțime de operații aritmetice în așa fel încât să fie egal cu o valoare dată.

source: Find the series of correct operations that matches the given answer
ar_tn: جد العمليات الصحيحة للحصول على النتيجة
pa: ਦਿੱਤੇ ਗਏ ਉੱਤਰਾਂ ਨਾਲ ਜੁੜਨ ਵਾਲੀਆਂ ਸਹੀ ਕਿਰਿਆਵਾਂ ਦੀ ਲੜੀ ਲੱਭੋ।
ro: Gasiți șirul de operații corecte care sunt egale cu un răspuns dat.

source: The four arithmetic operations. Combine several arithmetic operations.
ar_tn: العمليات الحسابية الأربعة. أدمج العديد من العمليات الحسابية
pa: ਚਾਰ ਹਿਸਾਬ ਕਿਰਿਆ ਪ੍ਣਾਲੀਆਂ,ਕਈ ਹਿਸਾਬ ਕਿਰਿਆ ਪ੍ਣਾਲੀਆਂ ਨੂੰ ਮਿਲਾਓ।
ro: Cele patru operații aritmetice. Combinați diferite operații aritmetice.

source: Work out the right combination of numbers and operations to match the given value
ar_tn: كون المجموعة المناسبة من الأرقام و العمليات الحسابية لتحصل على القيمة ذاتها
pa: ਇੱਕ ਇਹੋ ਜਿਹਾ ਸੰਥਿਆਵਾਂ ਅਤੇ ਕਿਰਿਆ ਪ੍ਣਾਲੀਆਂ ਦਾਗੱਠਜੋੜ ਤਿਆਰ ਕਰੋ ਜੋ ਦਿੱਤੀ ਹੋਈ ਸੰਖਿਆ ਨਾਲ ਮੇਲ ਖਾਵੇ।
ro: Aplică combinația corectă dintre numere și operații pentru a primi valoarea dată

source: A subtraction problem with two numbers is displayed. At the right of the equals sign, give the answer, the difference. Use the left and right arrows to modify your answer and press the Enter key to check if you've got it right. If not, just try again.
ar_tn: سيتم عرض حصيلة عملية طرح عددين. أدخل الإجابة على يمين علامة التساوي. استعمل الأسهم يمين يسار لتغيير إجابتك, و مفتاح الإدخال لتثبيت الإجابة
pa: ਦੋ ਅੰਕਾਂ ਦੇ ਅੰਤਰ ਦਾ ਪ੍ਸ਼ਨ ਦਰਸਾਇਆ ਗਿਆ ਹੈ। ਤੁਸਿਂ ਆਪਣਾ ਜਵਾਬ ਬਰਾਬਰ ਨਿਸ਼ਾਨ ਦੇ ਸੱਜੇ ਪਾਸੇ ਲਿਖੋ । ਆਪਣਾ ਜਵਾਬ ਬਦਲਣ ਲਈ ਸੱਜੇ ਅਤੇ ਖੱਬੇ ਤੀਰ ਵਾਲੀ ਕੁੰਜੀ ਦੀ ਵਰਤੋਂ ਕਰੋ। ਜੇਕਰ ਤੁਸੀਂ ਸਹੀ ਜਵਾਬ ਜਾਨਣਾ ਚਾਹੁੰਦੇ ਹੋ ਤਾਂ ਐਂਟਰ ਕੁੰਜੀ ਦਬਾਉ,ਜੇ ਜਵਾਬ ਗਲਤ ਹੋਗਿਆ ਤਾਂ ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
ro: O problemă cu diferența a doua numere este afișată. Dați răspunsul, diferența, în dreapta semnului egal. Folosiți sagetile dreapta si stanga pentru a modifica raspunsul dumneavoastra și apăsați tasta Enter pentru a verifica dacă ați raspuns corect. Dacă nu, încercați din nou.

source: In a limited time, find the difference between two numbers
ar_tn: اطرح عددين في وقت محدود
pa: ਸੀਮਿਤ ਸਮੇਂ ਵਿੱਚ ਦੋ ਅੰਕਾਂ ਦਾ ਅੰਤਰ ਪਤਾ ਕਰੋ।
ro: În limita timpului, calculați diferența a doua numere

source: Practice the subtraction operation
ar_tn: تدرب على عملية الطرح
pa: ਘਟਾਉਣ ਦੀ ਕਿਰਿਆ ਦਾ ਅਭਿਆਸ ਕਰੋ।
ro: Exersați operația de scădere

source: Simple subtraction
ar_tn: عملية طرح بسيطة
pa: ਸਰਲ ਘਟਾਉਣ ਦੀ ਕਿਰਿਆ
ro: Scădere simplă

source: An addition problem with two numbers is displayed. At the right of the equals sign, give the answer, the sum. Use the left and right arrows to modify your answer and press the Enter key to check if you've got it right. If not, just try again.
ar_tn: سيتم عرض حصيلة عملية جمع عددين. أدخل الإجابة على يمين علامة التساوي. استعمل الأسهم يمين يسار لتغيير إجابتك, و مفتاح الإدخال لتثبيت الإجابة
pa: ਦੋ ਅੰਕਾਂ ਦਾ ਜੋੜ ਦਿਖਾਇਆ ਗਿਆ ਹੈ।ਬਰਾਬਰ ਚਿੰਨ੍ ਦੇ ਸੱਜੇ ਪਾਸੇ ਗੁਣਾਂ ਦਾ ਜਵਾਬ ਲਿਖੋ।ਆਪਣਾ ਜਵਾਬ ਬਦਲਣ ਲਈ ਰਡ ਦੇ ਸੱਜੇ ਅਤੇ ਖੱਬੇ ਤੀਰ ਵਾਲੇ ਬਟਨਾਂ ਦੀ ਵਰਤੋਂ ਕਰੋ।ਜਵਾਬ ਦੀ ਜਾਂਚ ਕਰਨ ਲਈ ਐਂਟਰ ਬਟਨ ਦਬਾਓ ਅਤੇ ਜੇਕਰ ਜਵਾਬ ਗਲਤ ਹੈ ਤਾਂ ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
ro: Este afișată o problemă de adunare a două numere. Scrieți rezultatul (suma) la dreapta semnului egal. Folosiți săgețile stânga/dreapta pentru a modifica răspunsul și apăsați tasta Enter pentru verificare. Dacă rezultatul nu este corect, încercați din nou.

source: In a limited time, find the sum of of two numbers. Introduction to simple in-line addition.
ar_tn: اجمع عددين في وقت محدود
pa: ਸੀਮਿਤ ਸਮੇਂ ਵਿੱਚ ਦੋ ਅੰਕਾਂ ਦਾ ਜੋੜ ਪਤਾ ਕਰੋ। ਇੱਕ ਰੇਖਾ ਵਿੱਚ ਸਰਲ ਜੋੜ ਦੀ ਪ੍ਸਤਾਵਨਾ।
ro: Într-un timp limitat, găsește diferența dintre două numere

source: Practice the addition operation
ar_tn: تدرب على عملية الجمع
pa: ਜੋੜ ਕਿਰਿਆ ਦਾ ਅਭਿਆਸ ਕਰੋ।
ro: Exersați operația de adunare

source: Simple addition. Can recognize written numbers
ar_tn: جمع بسيط. القدرة على تمييز الأرقام المكتوبة
pa: ਸਰਲ ਜੋੜ ਕਿਰਿਆ.ਲਿਖਿਆ ਹੋਇਆ ਅੰਕ ਪਹਿਚਾਨੋ।
ro: Adăugare simplă. Recunoaște cifre scrise de mână.

source: Go to calculation activities
ar_tn: أنشطة حسابية
pa: ਹਿਸਾਬ ਕਿਰਿਆ ਵੱਲ
ro: Mergeți la activitățile de calcul

source: Various calculation activities.
ar_tn: أنشطة حسابية مختلفة
pa: ਵੱਖ ਵੱਖ ਹਿਸਾਬ ਕਿਰਿਆਵਾਂ
ro: Activități diverse de calcul.

source: Complete a list of symbols
ar_tn: أكمل قائمة الرموز
pa: ਚਿੰਨ੍ਾ ਦੀ ਸੂਚੀ ਪੂਰੀ ਕਰੋ।
ro: Listă completă de simboluri.

source: Find the next symbol in a list.
ar_tn: ابحث في القائمة عن الرمز التالي
pa: ਪਤਾ ਕਰੋ ਕਿ ਦਿੱਤੀ ਗਈ ਸੂਚੀ ਵਿੱਚ ਅਗਲਾ ਚਿੰਨ ਕਿਹੜਾ ਹੋਵੇਗਾ।
ro: Găsiți simboul următor în listă.

source: Logic training activity
ar_tn: تدريبات على المنطق
pa: ਤਰਕ ਸਿੱਖਿਆ ਕਿਰਿਆ
ro: Activitate antrenament logică.

source: Move and click the mouse
ar_tn: حرك الفأرة و انقرها
pa: ਮਾਊਸ ਨੂੰ ਚਲਾਉ ਅਤੇ ਕਲਿੱਕ ਕਰੋ।
ro: Mișcă mausul și fă clic

source: algorithm
ar_tn: القاعدة
pa: ਐਲਗੋਰਿਥਮ
ro: algoritm

source: Create a drawing or an animation
ar_tn: أنشأ لوحة أو رسمة متحركة
pa: ਚਿੱਤਰ ਅਤੇ ਐਨੀਮੇਸ਼ਨ ਬਣਾਉ।
ro: Creați un desen sau o animație.

source: Free drawing and animation tool.
ar_tn: أداة الرسم و الرسم المتحرك الحرة
pa: ਮੁਫਤ ਐਨੀਮੇਸ਼ਨ ਅਤੇ ਡਰਾਇੰਗ ਹਥਿਆਰ
ro: Instrument de desenat și animare liber.

source: In this game, children can draw freely. The goal is to discover how to create attractive drawings based on basic shapes: rectangles, ellipses and lines. To give children a wider range of choices, a set of images can also be used.
ar_tn: في هذه اللعبة، باستطاعة الأطفال الرسم بحرية. الهدف هو إكتشاف طريقة لإنشاء رسوم خلاقة من أشكال أساسية: مستطيلات، و أشكال بيضوية، و خطوط. لإعطاء الأطفال خيارات أوسع، من الممكن أيضاً استخدام مجموعة من الصور
pa: ਇਸ ਖੇਡ ਵਿੱਚ ਬੱਚੇ ਅਜ਼ਾਦੀ ਨਾਲ ਚਿੱਤਰ ਬਣਾ ਸਕਦੇ ਹਨ।ਇਸ ਖੇਡ ਦਾ ਉਦੇਸ਼ ਸਾਧਾਰਣ ਆਕਾਰ ਜਿਵੇਂ ਰੇਖਾ, ਅੰਡਕਾਰ ,ਆਇਤ ਨੂੰ ਕਿਵੇਂ ਮਨਮੋਹਣੇ ਤਰਕੇ ਨਾਲ ਬਨਾਉਣਾ ਹੈ। ਇਸ ਵਿੱਚ ਤਸਵੀਰਾਂ ਦਾ ਵਰਗ ਵੀ ਵਰਤਿਆ ਜਾ ਸਕਦਾ ਹੈ ਤਾਂ ਜੋ ਬੱਚੇ ਆਪਣੇ ਪਸੰਦ ਦੀ ਤਸਵੀਰ ਚੁਣ ਸਕਣ।
ro: În acest joc, copiii pot desena liber. Scopul este să descopere cum pot crea desene drăguțe bazate pe forme simple: dreptunghiuri, elipse și linii.

source: Needs to be capable of moving and clicking the mouse easily
ar_tn: تتطلب القدرة على تحريك و نقر الفأرة بسهولة
pa: ਮਾਊਸ ਨੂੰ ਚੰਗੀ ਤਰਾ ਚਲਾਉਣ ਅਤੇ ਕਲਿਕ ਕਰਨ ਦੇ ਕਾਬਲ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ।
ro: Necesită capabilități de mișcare și click a șoricelului ușor.

source: Select a drawing tool on the left, and a color down the bottom. Then click and drag in the white area to create a new shape. Once you've completed a drawing, you can take a snapshot of it with the 'camera' button. This creates a new image with the same content, a copy of your image. You can then edit it by moving objects a little bit or adding/deleting objects. When you create several drawings and then click on the 'film' button, you will see all your images in a continuous slide-show (an infinite loop pattern). You can also change the viewing speed in this mode. In viewing mode, click on the 'drawing' button to return to drawing mode. You can then edit each image in your animation, by using the image selector in the bottom-left corner of the screen. You can also save and reload your animations with the 'floppy disk' and 'folder' buttons.
ar_tn: اختر أداة رسم من اليسار، و لون من الأسفل ثم أنقر و اسحب إلى المساحة البيضاء لتكوين شكل جديد. حالما تنهي الرسمة، بإمكانك ألتقاط لقطة لها بزر الكمرا. و بذلك تتكون صورة جديدة بنفس المحتوى، نسخة من رسمتك. بإمكانك بعد ذلك تعديلها من خلال تحريك قليل للمجسمات. عندما تنشأ عدة رسومات و من ثم تنقر على زر الفلم، سترى جميع صورك معروضة في عرض مستمر ( بأسلوب حلقي، لا نهائي). بإمكانك أيضاً تغيير سرعة العرض. من وضعية العرض، أنقر على زر الرسم لتعود إلى وضعية الرسم. عندها يمكنك تعديل كل صورة من رسومك المتحركة، باستخدام منتقي الصور من أسفل اليسار. بإمكانك أيضاً حفظ و إعادة تحميل رسومك المتحركة في قرص مرن و ملف
pa: ਖੱਬੇ ਪਾਸੇ ਤੋਂ ਡਰਾਇੰਗ ਟੂਲ ਅਤੇ ਸਭ ਤੋਂ ਥੱਲੇ ਤੋਂ ਰੰਗ ਨੂੰ ਚੁਣੋਂ।ਫਿਰ ਇੱਕ ਨਵੀਂ ਆਕਿ੍ਤੀ ਬਣਾਉਣ ਲਈ ਕਲਿੱਕ ਕਰਕੇ ਅਤੇ ਉਸਨੂੰ ਖਿੱਚਕੇ ਖੇਤਰ ਵਿੱਚ ਲੈ ਜਾਉ।ਇੱਕ ਵਾਰ ਜਦੋਂ ਤੁਸੀਂ ਆਪਣੀ ਤਸਵੀਰ ਪੂਰੀ ਕਰ ਲਈ,ਤਾਂ ਤੁਸੀ ਕੈਮਰਾ ਬਟਨ ਤੇ ਕਲਿੱਕ ਕਰਕੇ ਉਸਦੀ ਫੋਟੋ ਵੀ ਖਿੱਚ ਸਕਦੇ ਹੋ। ਇਹ ਤੁਹਾਡੇ ਉਸੇ ਚਿੱਤਰ ਦੀ ਨਕਲੀ ਕਾਪੀ ਤਿਆਰ ਕਰ ਦਿੰਦਾ ਹੈ। ਤੁਸੀਂ ਇਸ ਚਿੱਤਰ ਨੂੰ ਬਦਲ ਵੀ ਸਕਦੇ ਹੋ। ਜਦੋਂ ਤੁਸੀਂ ਆਪਣੀਆਂ ਬਣਾਈਆਂ ਹੋਈਆਂ ਕਈ ਤਸਵੀਰਾਂ ਨੂੰ ਇੱਕ ਇੱਕ ਕਰਕੇ ਲਗਾਤਾਰ ਦੇਖਣਾ ਚਾਹੁੰਦੇ ਹੋ,ਤਾਂ ਫਿਲਮ ਬਟਨ ਤੇ ਕਲਿੱਕ ਕਰੋ। ਇਸ ਵਿੱਚ ਤੁਸੀਂ ਤਸਵੀਰਾਂ ਦੇਖਣ ਦੀ ਗਤੀ ਨੂੰ ਵੀ ਬਦਲ ਸਕਦੇ ਹੋ।ਤੁਸੀਂ ਡਰਾਇੰਗ ਬਟਨ ਤੇ ਕਲਿੱਕ ਕਰਕੇ ਦੁਬਾਰਾ ਡਰਾਇੰਗ ਮੋਡ ਵਿੱਚ ਜਾ ਸਕਦੇ ਹੋ।ਫਿਰ ਤੁਸੀਂ ਤਸਵੀਰ ਸਲੈਕਟਰ ਬਟਨ ਦੀ ਮਦੱਦ ਨਾਲ,ਜੋ ਕਿ ਸਕਰੀਨ ਦੇ ਸੱਭ ਤੋਂ ਥੱਲੇ ਖੂੰਜੇ ਵਿੱਚ ਹੈ,ਆਪਣੀਆਂ ਬਣਾਈਆਂ ਤਸਵੀਰਾਂ ਵਿੱਚ ਫੇਰ ਬਦਲ ਕਰ ਸਕਦੇ ਹੋ। ਤੁਸੀਂ ਆਪਣੀ ਐਨੀਮੇਸ਼ਨ ਨੂੰ ਫੋਲਡਰ ਅਤੇ ਫਲਾਪੀ ਡਿਸਕ ਦੇ ਬਟਨ ਰਾਹੀਂ ਸੇਵ ਅਤੇ ਦੁਬਾਰਾ ਲੋਡ ਕਰ ਸਕਦੇ ਹੋ।
ro: În stânga selectați o unealtă de desen, jos selectați o culoare. Apoi făceți clic și trageți în zona albă pentru a crea o formă nouă. După ce ați terminat desenul puteți face o copie cu ajutorul butonului 'camera'. Puteți redacta desenul mișcând obiectele puțin sau adăugând/ștergând-ule. Odată ce aveți câteva desene și facând un click pe butonul 'film' veți putea rula o animatie continuă. De asemenea puteți schimba viteza de rulare a filmului în acest mod. Faceți un click pe butonul 'desen' pentru a vă întoarce în regimul de desenare. Apoi puteți redacta fiecare imagine a animației, folosind selectorul de imagini în colțul de jos din stânga a ecranului. De asemenea puteți păstra și reîncărca animațiile într-un directoriu sau pe un floppy-disk.
